const data = [
  {
    "STT": 1,
    "CHỮ": "A",
    "CỤM": "阿出来再委回去",
    "PINYIN": "ā chūlái zài wěi huíqù",
    "NGHĨA": "比喻作出决定或承诺之后又反悔了。"
  },
  {
    "STT": 2,
    "CHỮ": "A",
    "CỤM": "阿到人头,上拿尿浇",
    "PINYIN": "ā dào réntóu, shàng ná niào jiāo",
    "NGHĨA": "形容欺人太甚。"
  },
  {
    "STT": 3,
    "CHỮ": "A",
    "CỤM": "阿几儿寸高的尿",
    "PINYIN": "ā jǐ ér cùn gāo de niào",
    "NGHĨA": "见“撒不出…丈的尿”。"
  },
  {
    "STT": 4,
    "CHỮ": "A",
    "CỤM": "矮爱碍安鞍",
    "PINYIN": "ǎi ài ài ān ān",
    "NGHĨA": "用来形容出家人慈悲的心肠,后多形容 人心地过于善良,甚至有点迂腐。\r\n 也作“矮半头”、“矮二寸”、“矮三分”、“矮一头”、“矮一截”。"
  },
  {
    "STT": 5,
    "CHỮ": "A",
    "CỤM": "矮半截",
    "PINYIN": "ǎi bàn jié",
    "NGHĨA": "半截:半段,物体总长度的一半。 指因感到身份、地位、气势等不如别人而产生了强烈的自卑感。"
  },
  {
    "STT": 6,
    "CHỮ": "A",
    "CỤM": "挨板子",
    "PINYIN": "ái bǎn zi",
    "NGHĨA": "遭到,遭受。板子:长条形木板 或竹片,旧时常用作拷打或体罚的工具。\r\n 比喻遭受严厉的批评、指责或处罚。\r\n 也作“挨巴掌”、“吃板子”。"
  },
  {
    "STT": 7,
    "CHỮ": "A",
    "CỤM": "挨鼻头",
    "PINYIN": "ái bí tóu",
    "NGHĨA": "鼻头:鼻子尖。\r\n 被人指着鼻子(骂)。指挨骂,受指责。"
  },
  {
    "STT": 8,
    "CHỮ": "A",
    "CỤM": "挨不上边",
    "PINYIN": "āi bù shàng biān",
    "NGHĨA": "形容彼此相差很远,无法接近。\r\n 形容双方关系疏远,毫无关联。\r\n 也作“挨不上来”、“挨不着边”。"
  },
  {
    "STT": 9,
    "CHỮ": "A",
    "CỤM": "爱财不要命",
    "PINYIN": "ài cái bù yào mìng",
    "NGHĨA": "为了金钱连命都可以不要。形容人极 端贪财。"
  },
  {
    "STT": 10,
    "CHỮ": "A",
    "CỤM": "爱吃好的怕动弹,提起做活干叫唤",
    "PINYIN": "ài chī hǎo de pà dòng tan ，tí qǐ zuò huó gàn jiào huàn",
    "NGHĨA": "动弹:方言,指劳动。 讽刺人好吃懒做,贪图享受。"
  },
  {
    "STT": 11,
    "CHỮ": "A",
    "CỤM": "挨锄头,不挨针头",
    "PINYIN": "āi chú tou，bù āi zhēn tóu",
    "NGHĨA": "镊头:刨土用的一种农具,类 似镐。\r\n 比喻宁可明着吃大亏,也不愿暗着吃 小亏。"
  },
  {
    "STT": 12,
    "CHỮ": "A",
    "CỤM": "挨打不记数",
    "PINYIN": "ái dǎ bù jì shù",
    "NGHĨA": "指遭受批评、处罚或吃亏上当之后,还 不知道接受教训。"
  },
  {
    "STT": 13,
    "CHỮ": "A",
    "CỤM": "矮冬瓜",
    "PINYIN": "ǎi dōng guā",
    "NGHĨA": "戏称又矮又胖的人。有戏谑、自嘲、嘲笑他人的意味。"
  },
  {
    "STT": 14,
    "CHỮ": "A",
    "CỤM": "挨黑枪",
    "PINYIN": "ái hēi qiāng",
    "NGHĨA": "黑枪:暗中射出的子弹。\r\n 被人暗中枪击。比喻遭人暗算。"
  },
  {
    "STT": 15,
    "CHỮ": "A",
    "CỤM": "挨烙铁",
    "PINYIN": "āi lào tiě",
    "NGHĨA": "烙铁:熨斗。 比喻遭受批评和打击。"
  },
  {
    "STT": 16,
    "CHỮ": "A",
    "CỤM": "挨了電子又霜打",
    "PINYIN": "ái le diàn zi yòu shuāng dǎ",
    "NGHĨA": "比喻接连遭受打击。"
  },
  {
    "STT": 17,
    "CHỮ": "A",
    "CỤM": "挨闷棍",
    "PINYIN": "ái mèn gùn",
    "NGHĨA": "闷棍:古代的一种兵器,拦路抢劫的强盗常从背后给人一闷棍,把 人打昏或打死,抢东西。\r\n 比喻遭到暗中的或突如其来的打击。\r\n 也作“挨闷棒”、“挨闷雷”。"
  },
  {
    "STT": 18,
    "CHỮ": "A",
    "CỤM": "爱面子",
    "PINYIN": "ài miàn zi",
    "NGHĨA": "比喻怕损害自己的体面，被人看不起。"
  },
  {
    "STT": 19,
    "CHỮ": "A",
    "CỤM": "爱盘不击鼠",
    "PINYIN": "ài pán bù jī shǔ",
    "NGHĨA": "击:打。\r\n 因怕打碎盘子而不打旁边的老鼠。 喻因有所顾忌而不打击坏人。"
  },
  {
    "STT": 20,
    "CHỮ": "A",
    "CỤM": "挨千刀",
    "PINYIN": "ái qiān dāo",
    "NGHĨA": "千刀:本指古代凌迟的酷刑,后亦常用 为咒骂语。\r\n 诅咒人不得好死,没有好下场。"
  },
  {
    "STT": 21,
    "CHỮ": "A",
    "CỤM": "挨枪子",
    "PINYIN": "ái qiāng zi",
    "NGHĨA": "枪子:子弹。\r\n 指被子弹打中而毙命。\r\n 也作“吃枪子”。"
  },
  {
    "STT": 22,
    "CHỮ": "A",
    "CỤM": "挨软棍",
    "PINYIN": "ái ruǎn gùn",
    "NGHĨA": "比喻遭到委婉的批评或反击。"
  },
  {
    "STT": 23,
    "CHỮ": "A",
    "CỤM": "挨上门",
    "PINYIN": "āi shàng mén",
    "NGHĨA": "指主动上门,不请自来。"
  },
  {
    "STT": 24,
    "CHỮ": "A",
    "CỤM": "挨一刻似三秋",
    "PINYIN": "āi yī kè sì sān qiū",
    "NGHĨA": "形容等待的心情非常焦急或迫切。"
  },
  {
    "STT": 25,
    "CHỮ": "A",
    "CỤM": "挨一天算一天",
    "PINYIN": "āi yī tiān suàn yī tiān",
    "NGHĨA": "见“过一天算一天”。"
  },
  {
    "STT": 26,
    "CHỮ": "A",
    "CỤM": "挨砖不挨瓦",
    "PINYIN": "āi zhuān bù āi wǎ",
    "NGHĨA": "宁可被砖头打,也不愿意挨瓦片打。\r\n 比喻人不明事理,不知轻重、好坏。"
  },
  {
    "STT": 27,
    "CHỮ": "A",
    "CỤM": "矮子里面选将军",
    "PINYIN": "ǎi zi lǐ miàn xuǎn jiāng jūn",
    "NGHĨA": "矮子:身材矮小的人。\r\n 比喻在条件较差的人群里面挑选比较 好的。\r\n 也作“矮子队里选将军”、“矮子里头拔 大个”。"
  },
  {
    "STT": 28,
    "CHỮ": "A",
    "CỤM": "矮子面前说矬话",
    "PINYIN": "ǎi zi miàn qián shuō cuó huà",
    "NGHĨA": "矬:cuó,(身体)短小,短。\r\n 指说话不注意对象,触到了听者的 短处。\r\n 也作“矮子面前说短话”、“当着矮子说 矮话”。"
  },
  {
    "STT": 29,
    "CHỮ": "A",
    "CỤM": "安本分",
    "PINYIN": "ān běn fèn",
    "NGHĨA": "指做事遵规守矩,不敢违反相关的 规定。"
  },
  {
    "STT": 30,
    "CHỮ": "A",
    "CỤM": "安翅膀",
    "PINYIN": "ān chì bǎng",
    "NGHĨA": "喻指在原来的基础上,凭借某种有利 或优越的条件得到迅速的发展。\r\n 也作“插翅膀”。"
  },
  {
    "STT": 31,
    "CHỮ": "A",
    "CỤM": "安钉子",
    "PINYIN": "ān dīng zi",
    "NGHĨA": "安:安设。\r\n 比喻给对手设置障碍或在对手内部安 插自己的人进行监视。"
  },
  {
    "STT": 32,
    "CHỮ": "A",
    "CỤM": "安坏心眼",
    "PINYIN": "ān huài xīn yǎn",
    "NGHĨA": "指人心术不正,使坏害人。\r\n 也作“使黑心”。"
  },
  {
    "STT": 33,
    "CHỮ": "A",
    "CỤM": "按老方子吃药",
    "PINYIN": "àn lǎo fāng zi chī yào",
    "NGHĨA": "\"方子:处方。\r\n 比喻用旧方法处理新问题。\""
  },
  {
    "STT": 34,
    "CHỮ": "A",
    "CỤM": "安乐死",
    "PINYIN": "ān lè sǐ",
    "NGHĨA": "指无痛苦的死亡。现一般指无痛致死 术,即为结束患者的痛苦而采取致死的 措施。比喻让无可挽救的事物自然 了结。"
  },
  {
    "STT": 35,
    "CHỮ": "A",
    "CỤM": "安乐窝",
    "PINYIN": "ān lè wō",
    "NGHĨA": "安逸的生活环境或小巧、温暖、舒适的处所或房间。"
  },
  {
    "STT": 36,
    "CHỮ": "A",
    "CỤM": "安下脚",
    "PINYIN": "ān xià jiǎo",
    "NGHĨA": "安排下住处。喻指站稳脚根。"
  },
  {
    "STT": 37,
    "CHỮ": "B",
    "CỤM": "八辈子",
    "PINYIN": "bā bèi zi",
    "NGHĨA": "指许多代。"
  },
  {
    "STT": 38,
    "CHỮ": "B",
    "CỤM": "把不住关",
    "PINYIN": "bǎ bù zhù guān",
    "NGHĨA": "指不能理智地控制自己的思想和行为。"
  },
  {
    "STT": 39,
    "CHỮ": "B",
    "CỤM": "把关口",
    "PINYIN": "bǎ guān kǒu",
    "NGHĨA": "比喻对人或事物进行严格审核,以确保不\r\n 出差错。"
  },
  {
    "STT": 40,
    "CHỮ": "B",
    "CỤM": "拔了刀子忘了疼",
    "PINYIN": "bá le dāo zi wàng le téng",
    "NGHĨA": "刚把刀拔出来就忘记了疼痛。比喻人 很快就忘记了过去的痛苦或不吸取以前 的教训。"
  },
  {
    "STT": 41,
    "CHỮ": "B",
    "CỤM": "把门槛都踩低了",
    "PINYIN": "bǎ mén kǎn dōu cǎi dī le",
    "NGHĨA": "形容来的人极多或人来的次数极多。"
  },
  {
    "STT": 42,
    "CHỮ": "B",
    "CỤM": "八面不着底儿",
    "PINYIN": "bā miàn bù zhuó dǐ er",
    "NGHĨA": "\"底儿:物体的最下部分。\r\n 指由于无法预计事情会有什么样的结 果而心中不安。\""
  },
  {
    "STT": 43,
    "CHỮ": "B",
    "CỤM": "把晴天说下雨来",
    "PINYIN": "bǎ qíng tiān shuō xià yǔ lái",
    "NGHĨA": "形容人嘴巴灵活,能言善辩。 也作“把死蛤蟆说出尿来”。"
  },
  {
    "STT": 44,
    "CHỮ": "B",
    "CỤM": "白费蜡",
    "PINYIN": "bái fèi là",
    "NGHĨA": "比喻白费力气，没有效果。"
  },
  {
    "STT": 45,
    "CHỮ": "B",
    "CỤM": "败家子",
    "PINYIN": "bài jiā zǐ",
    "NGHĨA": "指不务正业、挥霍家产的子弟。"
  },
  {
    "STT": 46,
    "CHỮ": "B",
    "CỤM": "摆架子",
    "PINYIN": "bǎi jià zi",
    "NGHĨA": "比喻故意显示资格、地位的高傲态度。自高自大、装腔作势。也说 \r\n “拿架子”、“端着架子”。"
  },
  {
    "STT": 47,
    "CHỮ": "B",
    "CỤM": "白眼狼",
    "PINYIN": "bái yǎn láng",
    "NGHĨA": "忘恩负义的人。"
  },
  {
    "STT": 48,
    "CHỮ": "B",
    "CỤM": "摆开手",
    "PINYIN": "bǎi kāi shǒu",
    "NGHĨA": "指分手,断绝关系。\r\n 指对某事不管或作罢。"
  },
  {
    "STT": 49,
    "CHỮ": "B",
    "CỤM": "半边天",
    "PINYIN": "bàn biān tiān",
    "NGHĨA": "形容妇女的地位跟男人一样。"
  },
  {
    "STT": 50,
    "CHỮ": "B",
    "CỤM": "半吊子",
    "PINYIN": "bàn diào zi",
    "NGHĨA": "比喻不通事理、说话随便、举止轻浮的人。"
  },
  {
    "STT": 51,
    "CHỮ": "B",
    "CỤM": "半瓶醋",
    "PINYIN": "bàn pínɡ cùn",
    "NGHĨA": "比喻知识技术只知道一点儿的人。"
  },
  {
    "STT": 52,
    "CHỮ": "B",
    "CỤM": "搬起石头砸自己的脚",
    "PINYIN": "bān qǐ shí tou zá zì jǐ de jiǎo",
    "NGHĨA": "搬起石头准备砸别人却砸了自己的脚。比喻自作自受，害人终害己。"
  },
  {
    "STT": 53,
    "CHỮ": "B",
    "CỤM": "帮倒忙",
    "PINYIN": "bānɡ dào mánɡ",
    "NGHĨA": "形式上帮忙而实际上反添麻烦。"
  },
  {
    "STT": 54,
    "CHỮ": "B",
    "CỤM": "抱粗腿",
    "PINYIN": "bào cū tuǐ",
    "NGHĨA": "比喻投靠有权势的人。"
  },
  {
    "STT": 55,
    "CHỮ": "B",
    "CỤM": "抱佛脚",
    "PINYIN": "bào fó jiǎo",
    "NGHĨA": "谚语: “平时不烧香，急来抱佛脚。”原来比喻平时没有联系，临时慌忙恳求。\r\n 后来多指平时没有准备，临时慌忙应付。也指求助于上天。"
  },
  {
    "STT": 56,
    "CHỮ": "B",
    "CỤM": "保护伞",
    "PINYIN": "bǎo hù sǎn",
    "NGHĨA": "比喻能起到保护作用的人或事物( 含贬义) 。"
  },
  {
    "STT": 57,
    "CHỮ": "B",
    "CỤM": "爆冷门",
    "PINYIN": "bào lěng mén",
    "NGHĨA": "比喻突然出现人们意想不到的情况或结果。冷门，指赌博时很少有人下注的一门。"
  },
  {
    "STT": 58,
    "CHỮ": "B",
    "CỤM": "饱眼福",
    "PINYIN": "bǎo yǎn fú",
    "NGHĨA": "看得很满意。"
  },
  {
    "STT": 59,
    "CHỮ": "B",
    "CỤM": "背包袱",
    "PINYIN": "bēi bāo fu",
    "NGHĨA": "思想或经济上有负担。"
  },
  {
    "STT": 60,
    "CHỮ": "B",
    "CỤM": "背黑锅",
    "PINYIN": "bēi hēi ɡuō",
    "NGHĨA": "比喻代别人承担过错、罪名，泛指受到冤枉。"
  },
  {
    "STT": 61,
    "CHỮ": "B",
    "CỤM": "笨鸟先飞",
    "PINYIN": "bèn niǎo xiān fēi",
    "NGHĨA": "比喻笨的人应该先行动。常用来比喻自己。"
  },
  {
    "STT": 62,
    "CHỮ": "B",
    "CỤM": "不成器",
    "PINYIN": "bù chénɡ qì",
    "NGHĨA": "不能成为有用的器物。后用以比喻不成才，没出息，没有发展前途或志气。也说“不成才”。"
  },
  {
    "STT": 63,
    "CHỮ": "B",
    "CỤM": "不吃那一套",
    "PINYIN": "bù chī nà yī tào",
    "NGHĨA": "那种方法不管用。"
  },
  {
    "STT": 64,
    "CHỮ": "B",
    "CỤM": "不到家",
    "PINYIN": "bú dào jiā",
    "NGHĨA": "比喻技艺没有达到尽善尽美的程度。"
  },
  {
    "STT": 65,
    "CHỮ": "B",
    "CỤM": "不动窝",
    "PINYIN": "bú dònɡ wō",
    "NGHĨA": "比喻不离开原来的地方。窝: 鸟兽、昆虫住的地方，借指人体或物体所占的地方。"
  },
  {
    "STT": 66,
    "CHỮ": "B",
    "CỤM": "不对头",
    "PINYIN": "bú duì tóu",
    "NGHĨA": "不正常，不正确，不合理。"
  },
  {
    "STT": 67,
    "CHỮ": "B",
    "CỤM": "不感冒",
    "PINYIN": "bù ɡǎn mào",
    "NGHĨA": "谑指对某人某事不感兴趣。"
  },
  {
    "STT": 68,
    "CHỮ": "B",
    "CỤM": "不管三七二十一",
    "PINYIN": "bù ɡuǎn sān qī èr shí yī",
    "NGHĨA": "比喻不顾一切，不问是非情由。"
  },
  {
    "STT": 69,
    "CHỮ": "B",
    "CỤM": "不见得",
    "PINYIN": "bú jiàn dé",
    "NGHĨA": "不一定。"
  },
  {
    "STT": 70,
    "CHỮ": "B",
    "CỤM": "不景气",
    "PINYIN": "bù jǐnɡ qì",
    "NGHĨA": "指经济不繁荣的景象，泛指事业不兴旺。"
  },
  {
    "STT": 71,
    "CHỮ": "B",
    "CỤM": "不买账",
    "PINYIN": "bù mǎi zhànɡ",
    "NGHĨA": "比喻不承认对方的长处或力量，不佩服或不服从。"
  },
  {
    "STT": 72,
    "CHỮ": "B",
    "CỤM": "不起眼",
    "PINYIN": "bù qǐ yǎn",
    "NGHĨA": "不值得重视; 不引人注目。又作“不显眼”。"
  },
  {
    "STT": 73,
    "CHỮ": "B",
    "CỤM": "不清不白",
    "PINYIN": "bù qīnɡ bù bái",
    "NGHĨA": "比喻关系暧昧，不正当。或者比喻不纯洁，有污点。"
  },
  {
    "STT": 74,
    "CHỮ": "B",
    "CỤM": "不认账",
    "PINYIN": "bú rèn zhànɡ",
    "NGHĨA": "不承认多欠的账，比喻不承认所说过的话或做过的事。"
  },
  {
    "STT": 75,
    "CHỮ": "B",
    "CỤM": "不是个儿",
    "PINYIN": "bú shì gèr",
    "NGHĨA": "不是对手。"
  },
  {
    "STT": 76,
    "CHỮ": "B",
    "CỤM": "不是个事儿",
    "PINYIN": "bú shì ɡe shìr",
    "NGHĨA": "指不正常。"
  },
  {
    "STT": 77,
    "CHỮ": "B",
    "CỤM": "不是玩儿的",
    "PINYIN": "bú shì wǎnr de",
    "NGHĨA": "不是儿戏; 不能轻视。"
  },
  {
    "STT": 78,
    "CHỮ": "B",
    "CỤM": "不是滋味",
    "PINYIN": "bú shì zī wèi",
    "NGHĨA": "心里感到不好受。"
  },
  {
    "STT": 79,
    "CHỮ": "B",
    "CỤM": "不顺眼",
    "PINYIN": "bú shùn yǎn",
    "NGHĨA": "看不惯，看着不舒服。"
  },
  {
    "STT": 80,
    "CHỮ": "B",
    "CỤM": "不忘本",
    "PINYIN": "bú wànɡ běn",
    "NGHĨA": "境遇变好后不忘掉自己原来的情况和所以得到幸福的根源。"
  },
  {
    "STT": 81,
    "CHỮ": "B",
    "CỤM": "不问青红皂白",
    "PINYIN": "bù wèn qīng hónɡ zào bái",
    "NGHĨA": "比喻不分辨事情的是非、情由。"
  },
  {
    "STT": 82,
    "CHỮ": "B",
    "CỤM": "不像话",
    "PINYIN": "bú xiànɡ huà",
    "NGHĨA": "比喻言语、行动不合情理。也说“不成话”。"
  },
  {
    "STT": 83,
    "CHỮ": "C",
    "CỤM": "差不离儿",
    "PINYIN": "chà bù lír",
    "NGHĨA": "差不多。"
  },
  {
    "STT": 84,
    "CHỮ": "C",
    "CỤM": "拆穿西洋镜",
    "PINYIN": "chāi chuān xī yánɡ jìnɡ",
    "NGHĨA": "西洋镜，亦作“西洋景”。民间一种供娱乐用的装置﹐匣子里装100着画片﹐匣子上有放大镜﹐可以放大画面。因最初画片多西洋画﹐故名。\r\n 比喻故弄玄虚借以骗人的行为或手法。拆穿西洋镜就是将用来骗人的事实真相揭露出来。"
  },
  {
    "STT": 85,
    "CHỮ": "C",
    "CỤM": "拆台",
    "PINYIN": "chāi tái",
    "NGHĨA": "有意破坏使人倒台或办不成事。"
  },
  {
    "STT": 86,
    "CHỮ": "C",
    "CỤM": "唱对台戏",
    "PINYIN": "chàng duì tái xì",
    "NGHĨA": "比喻采取与对方相反的行动，或有意搞垮对方。"
  },
  {
    "STT": 87,
    "CHỮ": "C",
    "CỤM": "长舌妇",
    "PINYIN": "cháng shé fù",
    "NGHĨA": "爱扯闲话、搬弄是非的女人。"
  },
  {
    "STT": 88,
    "CHỮ": "C",
    "CỤM": "唱白脸",
    "PINYIN": "chànɡ bái liǎn",
    "NGHĨA": "京剧中的反派角色。指扮演反面的角色，对事情采取尖酸苛刻的态度。"
  },
  {
    "STT": 89,
    "CHỮ": "C",
    "CỤM": "唱反调",
    "PINYIN": "chànɡ fǎn diào",
    "NGHĨA": "发表完全对立的言论; 采取对立的举措。"
  },
  {
    "STT": 90,
    "CHỮ": "C",
    "CỤM": "唱高调",
    "PINYIN": "chànɡ ɡāo diào",
    "NGHĨA": "发表似乎高明但脱离实际的论调，说得很好听而不实际去做。"
  },
  {
    "STT": 91,
    "CHỮ": "C",
    "CỤM": "唱红脸",
    "PINYIN": "chànɡ hónɡ liǎn",
    "NGHĨA": "就是装好人。比喻在批评或争斗中担当劝导、抚慰、缓冲等任务的角色。"
  },
  {
    "STT": 92,
    "CHỮ": "C",
    "CỤM": "唱空城计",
    "PINYIN": "chànɡ kōnɡ chénɡ jì",
    "NGHĨA": "比喻掩饰自己力量空虚、骗过对方的方法; 比喻某单位的人员全部或大部分不在; 形容肚子饿。"
  },
  {
    "STT": 93,
    "CHỮ": "C",
    "CỤM": "唱老调",
    "PINYIN": "chànɡ lǎo diào",
    "NGHĨA": "谈不新鲜的话题。"
  },
  {
    "STT": 94,
    "CHỮ": "C",
    "CỤM": "唱双簧",
    "PINYIN": "chànɡ shuānɡ huánɡ",
    "NGHĨA": "双簧，曲艺的一种。由一人在前面表演动作，另一个人藏在后面或说或唱，紧密配合。现在常把两人一唱一和比喻为唱双簧，有讽刺意味。"
  },
  {
    "STT": 95,
    "CHỮ": "C",
    "CỤM": "尝甜头",
    "PINYIN": "chánɡ tián tou",
    "NGHĨA": "比喻得到好处、利益。"
  },
  {
    "STT": 96,
    "CHỮ": "C",
    "CỤM": "炒冷饭",
    "PINYIN": "chǎo lěnɡ fàn",
    "NGHĨA": "比喻重复已经说过的话或做过的事，没有新的内容。也说“炒剩饭”。"
  },
  {
    "STT": 97,
    "CHỮ": "C",
    "CỤM": "炒螺蛳",
    "PINYIN": "chǎo luó sī",
    "NGHĨA": "螺蛳: 淡水螺的通称,一般较小。\r\n 比喻指故意找茬、吵闹。也作“炒螺丝”。"
  },
  {
    "STT": 98,
    "CHỮ": "C",
    "CỤM": "炒虾等不得红",
    "PINYIN": "chǎo xiā děng bù dé hóng",
    "NGHĨA": "生虾呈透明色,熟虾呈红色。虾很快会熟,却等不得。形容人性子急。"
  },
  {
    "STT": 99,
    "CHỮ": "C",
    "CỤM": "炒下豆子自己吃，打破砂锅让人赔",
    "PINYIN": "chǎo xià dòu zi zì jǐ chī, dǎ pò shā guō ràng rén péi",
    "NGHĨA": "比喻占了利益、成绩都归自己,出了问题却把责任推给别人。"
  },
  {
    "STT": 100,
    "CHỮ": "C",
    "CỤM": "炒鱿鱼",
    "PINYIN": "chǎo yóu yú",
    "NGHĨA": "鱿鱼一炒就会卷起来,转指卷铺盖走人。\r\n 比喻被解雇或主动辞职。"
  },
  {
    "STT": 101,
    "CHỮ": "C",
    "CỤM": "扯簸箕",
    "PINYIN": "chě bò ji",
    "NGHĨA": "比喻到处张扬、散播。"
  },
  {
    "STT": 102,
    "CHỮ": "C",
    "CỤM": "扯长绊",
    "PINYIN": "chě cháng bàn",
    "NGHĨA": "指无休止地说话或哭闹。"
  },
  {
    "STT": 103,
    "CHỮ": "C",
    "CỤM": "扯大旗",
    "PINYIN": "chě dà qí",
    "NGHĨA": "喻指借某个大名义办事。"
  },
  {
    "STT": 104,
    "CHỮ": "C",
    "CỤM": "扯淡话",
    "PINYIN": "chě dàn huà",
    "NGHĨA": "指说的一些没用的话。"
  },
  {
    "STT": 105,
    "CHỮ": "C",
    "CỤM": "扯东边,顾不得西首",
    "PINYIN": "chě dōng biān，gù bù dé xī shǒu",
    "NGHĨA": "形容手忙脚乱,顾了这头,顾不了那头。"
  },
  {
    "STT": 106,
    "CHỮ": "C",
    "CỤM": "车动铃铛响",
    "PINYIN": "chē dòng líng dāng xiǎng",
    "NGHĨA": "比喻为首的人一行动,大家就立即跟着行动。 形容行动时声势和影响大。"
  },
  {
    "STT": 107,
    "CHỮ": "C",
    "CỤM": "扯反线",
    "PINYIN": "chě fǎn xiàn",
    "NGHĨA": "比喻采取与某人相反的态度或做法。"
  },
  {
    "STT": 108,
    "CHỮ": "C",
    "CỤM": "车干水捉鱼",
    "PINYIN": "chē gān shuǐ zhuō yú",
    "NGHĨA": "用水车把水抽干了再捉鱼。\r\n 比喻把对手彻底消灭或把问题彻底解决。"
  },
  {
    "STT": 109,
    "CHỮ": "C",
    "CỤM": "扯公脚婆脚",
    "PINYIN": "chě gōng jiǎo pó jiǎo",
    "NGHĨA": "比喻拿错了薪柴来偿还旧债。"
  },
  {
    "STT": 110,
    "CHỮ": "C",
    "CỤM": "扯瓜蔓",
    "PINYIN": "chě guā màn",
    "NGHĨA": "比喻几方互相牵扯。"
  },
  {
    "STT": 111,
    "CHỮ": "C",
    "CỤM": "扯后腿",
    "PINYIN": "chě hòu tuǐ",
    "NGHĨA": "见“拉后腿”。"
  },
  {
    "STT": 112,
    "CHỮ": "C",
    "CỤM": "扯葫芦倒秧",
    "PINYIN": "chě hú lú dào yāng",
    "NGHĨA": "秧:某些植物的茎。 把葫芦拽下来,再把茎拔掉。形容说话东拉西扯,没完没了。"
  },
  {
    "STT": 113,
    "CHỮ": "C",
    "CỤM": "扯话把子",
    "PINYIN": "chě huà bà zi",
    "NGHĨA": "指漫无边际地闲扯。"
  },
  {
    "STT": 114,
    "CHỮ": "C",
    "CỤM": "扯了龙袍也是死，打了太子也是死",
    "PINYIN": "chě le lóng páo yě shì sǐ, dǎ le tài zǐ yě shì sǐ",
    "NGHĨA": "龙袍:皇帝穿的衣服。太子:皇帝的儿子中已确定为继承皇位的。\r\n 指反正不会有什么好结果,干脆就无所顾忌,什么都不怕了。\r\n 也作“撕了龙袍也是死,打死太子也是死”。"
  },
  {
    "STT": 115,
    "CHỮ": "C",
    "CỤM": "扯破天",
    "PINYIN": "chě pò tiān",
    "NGHĨA": "讽刺人吹牛、说大话过了头。"
  },
  {
    "STT": 116,
    "CHỮ": "C",
    "CỤM": "扯舌头",
    "PINYIN": "chě shé tou",
    "NGHĨA": "指胡乱说话闲话,发议论。"
  },
  {
    "STT": 117,
    "CHỮ": "C",
    "CỤM": "扯顺风旗",
    "PINYIN": "chě shùn fēng qí",
    "NGHĨA": "见“打顺风旗”。"
  },
  {
    "STT": 118,
    "CHỮ": "C",
    "CỤM": "扯下水",
    "PINYIN": "chě xià shuǐ",
    "NGHĨA": "见“拉下水”。"
  },
  {
    "STT": 119,
    "CHỮ": "C",
    "CỤM": "扯闲篇",
    "PINYIN": "chě xián piān",
    "NGHĨA": "指没事瞎聊,说闲话。也作“扯闲条”。"
  },
  {
    "STT": 120,
    "CHỮ": "C",
    "CỤM": "扯羊角疯",
    "PINYIN": "chě yáng jiǎo fēng",
    "NGHĨA": "羊角疯:癫痫病的俗称。斥责人胡闹。"
  },
  {
    "STT": 121,
    "CHỮ": "C",
    "CỤM": "扯硬弓",
    "PINYIN": "chě yìng gōng",
    "NGHĨA": "比喻故意摆谱儿,显示自己的威风与气势。"
  },
  {
    "STT": 122,
    "CHỮ": "C",
    "CỤM": "扯着耳朵腮动弹",
    "PINYIN": "chě zhe ěr duo sāi dòng tán",
    "NGHĨA": "比喻双方关系密切,一有问题就会互相牵连。也作“扯着耳朵腮帮动”。"
  },
  {
    "STT": 123,
    "CHỮ": "C",
    "CỤM": "扯着老虎尾巴抖威风",
    "PINYIN": "chě zhe lǎo hǔ wěi ba dǒu wēi fēng",
    "NGHĨA": "比喻依仗强者的威势横行霸道,胡作非为。"
  },
  {
    "STT": 124,
    "CHỮ": "C",
    "CỤM": "扯着藤数瓜动",
    "PINYIN": "chě zhe téng shǔ guā dòng",
    "NGHĨA": "比喻相互之间联系紧密,有问题就互相牵扯。"
  },
  {
    "STT": 125,
    "CHỮ": "C",
    "CỤM": "车子不动铃先响",
    "PINYIN": "chē zi bù dòng líng xiān xiǎng",
    "NGHĨA": "比喻还未开始行动,就因声势太大而走漏了消息。也作“车轮没转,铃铛先响”。"
  },
  {
    "STT": 126,
    "CHỮ": "C",
    "CỤM": "车走车路，马走马路",
    "PINYIN": "chē zǒu chē lù, mǎ zǒu mǎ lù",
    "NGHĨA": "比喻各自管好自己的事,互不干扰。 \r\n 比喻各奔前程。"
  },
  {
    "STT": 127,
    "CHỮ": "C",
    "CỤM": "陈谷子，烂麻子",
    "PINYIN": "chén gǔ zi, làn má zi",
    "NGHĨA": "比喻陈旧的、无关紧要的往事或话题。也作“陈芝麻烂谷子”、“陈糠烂谷子”、“陈年烂芝麻”。"
  },
  {
    "STT": 128,
    "CHỮ": "C",
    "CỤM": "趁火添把柴",
    "PINYIN": "chèn huǒ tiān bǎ chái",
    "NGHĨA": "比喻趁机把事态扩大,使问题更严重或矛盾更激化。"
  },
  {
    "STT": 129,
    "CHỮ": "C",
    "CỤM": "沉了一船芝麻，水面上撒花",
    "PINYIN": "chén le yī chuán zhī ma, shuǐ miàn shàng sā huā",
    "NGHĨA": "见“大篓撒油,满地捡芝麻”。"
  },
  {
    "STT": 130,
    "CHỮ": "C",
    "CỤM": "陈猫古老鼠",
    "PINYIN": "chén māo gǔ lǎo shǔ",
    "NGHĨA": "比喻陈旧过时的东西。"
  },
  {
    "STT": 131,
    "CHỮ": "C",
    "CỤM": "趁热打火",
    "PINYIN": "chèn rè dǎ huǒ",
    "NGHĨA": "趁着灶还热着再加火升温比较容易。\r\n 比喻利用有利时机办事。也作“趁热劲”、“趁热灶”。"
  },
  {
    "STT": 132,
    "CHỮ": "C",
    "CỤM": "趁打铁",
    "PINYIN": "chèn rè dǎ tiě",
    "NGHĨA": "指凑热闹。也作“趁打哄”。"
  },
  {
    "STT": 133,
    "CHỮ": "C",
    "CỤM": "陈世美",
    "PINYIN": "chén shì měi",
    "NGHĨA": "舍弃老婆或忘恩负义的人。"
  },
  {
    "STT": 134,
    "CHỮ": "C",
    "CỤM": "趁台阶下驴",
    "PINYIN": "chèn tái jiē xià lǘ",
    "NGHĨA": "比喻借机摆脱某种尴尬、难堪的局面。"
  },
  {
    "STT": 135,
    "CHỮ": "C",
    "CỤM": "趁眼错",
    "PINYIN": "chèn yǎn cuò",
    "NGHĨA": "见“眨眼错”。"
  },
  {
    "STT": 136,
    "CHỮ": "C",
    "CỤM": "趁着浑水摸泥鳅",
    "PINYIN": "chèn zhe hún shuǐ mō ní qiū",
    "NGHĨA": "比喻趁混乱之机捞取好处。也作“趁浑水捞虾”、“趁混水打野鸡”。"
  },
  {
    "STT": 137,
    "CHỮ": "C",
    "CỤM": "趁着火候补漏锅",
    "PINYIN": "chèn zhe huǒ hòu bǔ lòu guō",
    "NGHĨA": "比喻抓住有利时机,趁势做事。"
  },
  {
    "STT": 138,
    "CHỮ": "C",
    "CỤM": "撑场面",
    "PINYIN": "chēng chǎng miàn",
    "NGHĨA": "维持表面的排场。也说“撑门面”。"
  },
  {
    "STT": 139,
    "CHỮ": "C",
    "CỤM": "成大器",
    "PINYIN": "chéng dà qì",
    "NGHĨA": "指有大成就、大作为。"
  },
  {
    "STT": 140,
    "CHỮ": "C",
    "CỤM": "撑的撑死，饿的饿死",
    "PINYIN": "chēng de chēng sǐ, è de è sǐ",
    "NGHĨA": "形容分配不均。"
  },
  {
    "STT": 141,
    "CHỮ": "C",
    "CỤM": "成风气",
    "PINYIN": "chéng fēng qì",
    "NGHĨA": "指成为一种潮流或流行习惯。"
  },
  {
    "STT": 142,
    "CHỮ": "C",
    "CỤM": "成画饼",
    "PINYIN": "chéng huà bǐng",
    "NGHĨA": "画的饼子不能充饥。比喻理想或愿望没有实现。"
  },
  {
    "STT": 143,
    "CHỮ": "C",
    "CỤM": "城隍老爷上了小鬼的当",
    "PINYIN": "chéng huáng lǎo yé shàng le xiǎo guǐ de dàng",
    "NGHĨA": "城隍老爷:迷信传说指主管某个城的神。比喻大人物被小人物所欺骗、吃了亏。"
  },
  {
    "STT": 144,
    "CHỮ": "C",
    "CỤM": "撑空架子",
    "PINYIN": "chēng kōng jià zi",
    "NGHĨA": "喻指内里已经虚空,只能勉强支撑。"
  },
  {
    "STT": 145,
    "CHỮ": "C",
    "CỤM": "城里也败了，乡里也耽了",
    "PINYIN": "chéng lǐ yě bài le, xiāng lǐ yě dān le",
    "NGHĨA": "指两头都耽赶上,什么也没办成。"
  },
  {
    "STT": 146,
    "CHỮ": "C",
    "CỤM": "撑门户",
    "PINYIN": "chēng mén hù",
    "NGHĨA": "喻指支撑起一个家庭。"
  },
  {
    "STT": 147,
    "CHỮ": "C",
    "CỤM": "撑门面",
    "PINYIN": "chēng mén miàn",
    "NGHĨA": "喻指勉强维持表面的排场与体面。也作“撑场面”。"
  },
  {
    "STT": 148,
    "CHỮ": "C",
    "CỤM": "成泡影",
    "PINYIN": "chéng pào yǐng",
    "NGHĨA": "喻指计划或希望落空。"
  },
  {
    "STT": 149,
    "CHỮ": "C",
    "CỤM": "成气候",
    "PINYIN": "chéng qì hòu",
    "NGHĨA": "比喻有出息,有成就或有发展前途。\r\n 比喻成为一种趋势或潮流。"
  },
  {
    "STT": 150,
    "CHỮ": "C",
    "CỤM": "逞强梁",
    "PINYIN": "chěng qiáng liáng",
    "NGHĨA": "指争强好胜,要强逞能。"
  },
  {
    "STT": 151,
    "CHỮ": "C",
    "CỤM": "成事不足，败事有余",
    "PINYIN": "chéng shì bù zú, bài shì yǒu yú",
    "NGHĨA": "嘲讽或指责人无能,办不成事还坏了事。"
  },
  {
    "STT": 152,
    "CHỮ": "C",
    "CỤM": "撑顺风船",
    "PINYIN": "chēng shùn fēng chuán",
    "NGHĨA": "比喻借助有利时机或形势办事。也作“开顺风船”。"
  },
  {
    "STT": 153,
    "CHỮ": "C",
    "CỤM": "撑死眼，饿死嘴",
    "PINYIN": "chēng sǐ yǎn, è sǐ zuǐ",
    "NGHĨA": "撑:吃得太多,肚子容不下了。指能看到却吃不到。也作“饿死嘴,撑死眼”。"
  },
  {
    "STT": 154,
    "CHỮ": "C",
    "CỤM": "成体统",
    "PINYIN": "chéng tǐ tǒng",
    "NGHĨA": "体统:指体制、格局、规矩等。指符合规范或规矩。"
  },
  {
    "STT": 155,
    "CHỮ": "C",
    "CỤM": "秤砣放在定盘星上",
    "PINYIN": "chèng tuó fàng zài dìng pán xīng shàng",
    "NGHĨA": "定盘星:秤杆上标志起算点(重量为零)的星儿。比喻拿定主意,不再更改。"
  },
  {
    "STT": 156,
    "CHỮ": "C",
    "CỤM": "乘兴而来，败兴而去",
    "PINYIN": "chéng xìng ér lái, bài xìng ér qù",
    "NGHĨA": "指兴致勃勃而来,却受到了打击或拒绝,只得扫兴而归。也作“乘兴而去,败兴而归”。"
  },
  {
    "STT": 157,
    "CHỮ": "C",
    "CỤM": "撑腰板",
    "PINYIN": "chēng yāo bǎn",
    "NGHĨA": "比喻给予支持或鼓励。也作“撑腰杆”。"
  },
  {
    "STT": 158,
    "CHỮ": "C",
    "CỤM": "成也萧何，败也萧何",
    "PINYIN": "chéng yě xiāo hé, bài yě xiāo hé",
    "NGHĨA": "指事情的成败、好坏都由同一个人或同样原因造成。"
  },
  {
    "STT": 159,
    "CHỮ": "C",
    "CỤM": "撑硬船",
    "PINYIN": "chēng yìng chuán",
    "NGHĨA": "比喻态度强硬,不肯迁就或让步。"
  },
  {
    "STT": 160,
    "CHỮ": "C",
    "CỤM": "逞英雄",
    "PINYIN": "chěng yīng xióng",
    "NGHĨA": "指显示自己勇敢无畏,不怕事。"
  },
  {
    "STT": 161,
    "CHỮ": "C",
    "CỤM": "成正果",
    "PINYIN": "chéng zhèng guǒ",
    "NGHĨA": "佛教称修行得道为成正果。比喻取得成功或改邪归正。"
  },
  {
    "STT": 162,
    "CHỮ": "C",
    "CỤM": "撑场面",
    "PINYIN": "chēnɡ chǎnɡ miàn",
    "NGHĨA": "维持表面的排场。也说“撑门面”。"
  },
  {
    "STT": 163,
    "CHỮ": "C",
    "CỤM": "吃八方",
    "PINYIN": "chī bā fāng",
    "NGHĨA": "指自己不劳动,靠各方面的人养活。也作“吃四方”。"
  },
  {
    "STT": 164,
    "CHỮ": "C",
    "CỤM": "吃白板",
    "PINYIN": "chī bái bǎn",
    "NGHĨA": "指被拒绝。 指没生意或没收入。"
  },
  {
    "STT": 165,
    "CHỮ": "C",
    "CỤM": "吃白饭",
    "PINYIN": "chī bái fàn",
    "NGHĨA": "指白吃饭,不做事。"
  },
  {
    "STT": 166,
    "CHỮ": "C",
    "CỤM": "吃白酒",
    "PINYIN": "chī bái jiǔ",
    "NGHĨA": "指白吃酒席不掏钱。"
  },
  {
    "STT": 167,
    "CHỮ": "C",
    "CỤM": "吃白食",
    "PINYIN": "chī bái shí",
    "NGHĨA": "指不付出任何代价而占有事物或钱财。"
  },
  {
    "STT": 168,
    "CHỮ": "C",
    "CỤM": "吃白眼",
    "PINYIN": "chī bái yǎn",
    "NGHĨA": "指受到歧视或冷遇。"
  },
  {
    "STT": 169,
    "CHỮ": "C",
    "CỤM": "吃白斋",
    "PINYIN": "chī bái zhāi",
    "NGHĨA": "信仰宗教的人所吃的素食。指吃素菜。"
  },
  {
    "STT": 170,
    "CHỮ": "C",
    "CỤM": "吃板刀面",
    "PINYIN": "chī bǎn dāo miàn",
    "NGHĨA": "江湖隐语,指被砍杀。也作“吃刀头面”。"
  },
  {
    "STT": 171,
    "CHỮ": "C",
    "CỤM": "吃板子",
    "PINYIN": "chī bǎn zi",
    "NGHĨA": "见“挨板子”。"
  },
  {
    "STT": 172,
    "CHỮ": "C",
    "CỤM": "吃饱饭骂厨子",
    "PINYIN": "chī bǎo fàn mà chúzi",
    "NGHĨA": "比喻达到目的以后就打击有功的人。也作“吃饱了骂厨子”、“酒足饭饱骂厨子”。"
  },
  {
    "STT": 173,
    "CHỮ": "C",
    "CỤM": "吃饱了肚子不叫娘",
    "PINYIN": "chī bǎo le dùzi bù jiào niáng",
    "NGHĨA": "指人忘恩负义,要求或目的达到了就不认恩人。"
  },
  {
    "STT": 174,
    "CHỮ": "C",
    "CỤM": "吃饱了就不认得大铁勺",
    "PINYIN": "chī bǎo le jiù bù rènde dà tiěsháo",
    "NGHĨA": "比喻情况好转就把有恩于己的人忘了。"
  },
  {
    "STT": 175,
    "CHỮ": "C",
    "CỤM": "吃饱了一家不饿,锁住门不悄锁死板凳",
    "PINYIN": "chī bǎo le yījiā bù è, suǒzhù mén bù qiāo suǒ sǐ bǎndèng",
    "NGHĨA": "指家里只有孤身一人(光棍汉)。也作“出了门不怕家里饿死小板凳”。"
  },
  {
    "STT": 176,
    "CHỮ": "C",
    "CỤM": "吃豹子胆",
    "PINYIN": "chī bào zi dǎn",
    "NGHĨA": "比喻人的胆量非常大。"
  },
  {
    "STT": 177,
    "CHỮ": "C",
    "CỤM": "吃闭门羹",
    "PINYIN": "chī bì mén gēnɡ",
    "NGHĨA": "比喻串门时，主人不在家，被拒绝进门或受其他冷遇。"
  },
  {
    "STT": 178,
    "CHỮ": "C",
    "CỤM": "吃瘪子",
    "PINYIN": "chī biězi",
    "NGHĨA": "指遭受挫折或打击,处境窘迫、难堪。"
  },
  {
    "STT": 179,
    "CHỮ": "C",
    "CỤM": "吃弊喽蟹，还嫌蟹不体贴",
    "PINYIN": "chī bìlou xiè, hái xián xiè bù tǐtiē",
    "NGHĨA": "甲鱼,俗称王八。常用来骂人。比喻从他人身上谋了利还要抱怨(含嘲讽义)。"
  },
  {
    "STT": 180,
    "CHỮ": "C",
    "CỤM": "吃不饱，穿不暖",
    "PINYIN": "chī bù bǎo, chuān bù nuǎn",
    "NGHĨA": "形容生活困难,温饱都无法解决。"
  },
  {
    "STT": 181,
    "CHỮ": "C",
    "CỤM": "吃不饱，饿不死",
    "PINYIN": "chī bù bǎo, è bù sǐ",
    "NGHĨA": "见“饿不死也撑不着”。"
  },
  {
    "STT": 182,
    "CHỮ": "C",
    "CỤM": "吃不好睡不好",
    "PINYIN": "chī bù hǎo shuì bù hǎo",
    "NGHĨA": "形容极度焦虑、担忧。也作“吃不好睡不香”。"
  },
  {
    "STT": 183,
    "CHỮ": "C",
    "CỤM": "吃不开",
    "PINYIN": "chī bu kāi",
    "NGHĨA": "不被周围的人接受或欢迎。"
  },
  {
    "STT": 184,
    "CHỮ": "C",
    "CỤM": "吃不了兜着走",
    "PINYIN": "chī bu liǎo dōu zhe zǒu",
    "NGHĨA": "指出了问题，要承担一切后果。"
  },
  {
    "STT": 185,
    "CHỮ": "C",
    "CỤM": "吃不上葡萄说葡萄酸",
    "PINYIN": "chī bù shàng pútao shuō pútao suān",
    "NGHĨA": "比喻得不到某人(或物)就开始说人家坏话。"
  },
  {
    "STT": 186,
    "CHỮ": "C",
    "CỤM": "吃不透包的是什么馅",
    "PINYIN": "chī bù tòu bāo de shì shénme xiàn",
    "NGHĨA": "比喻弄不清对方的用意是什么。"
  },
  {
    "STT": 187,
    "CHỮ": "C",
    "CỤM": "吃不消",
    "PINYIN": "chī bu xiāo",
    "NGHĨA": "指经受不住; 难以承受; 忍耐不了。"
  },
  {
    "STT": 188,
    "CHỮ": "C",
    "CỤM": "吃不着肉有骨头啃",
    "PINYIN": "chī bù zháo ròu yǒu gǔtou kěn",
    "NGHĨA": "比喻虽然没有大利可图,但也得可得一些。"
  },
  {
    "STT": 189,
    "CHỮ": "C",
    "CỤM": "吃不准",
    "PINYIN": "chī bu zhǔn",
    "NGHĨA": "感到没有把握。"
  },
  {
    "STT": 190,
    "CHỮ": "C",
    "CỤM": "吃醋",
    "PINYIN": "chī cù",
    "NGHĨA": "比喻因嫉妒而引起的不快情绪，形容爱嫉妒别人。多指因男女关系而妒忌、争吵。"
  },
  {
    "STT": 191,
    "CHỮ": "C",
    "CỤM": "吃错药",
    "PINYIN": "chī cuò yào",
    "NGHĨA": "比喻说话办事有违常理。"
  },
  {
    "STT": 192,
    "CHỮ": "C",
    "CỤM": "吃大锅饭",
    "PINYIN": "chī dà ɡuō fàn",
    "NGHĨA": "比喻企业不论盈亏，个人不分勤懒，全由国家包干的办法。"
  },
  {
    "STT": 193,
    "CHỮ": "C",
    "CỤM": "吃得消",
    "PINYIN": "chī de xiāo",
    "NGHĨA": "能经受得住。"
  },
  {
    "STT": 194,
    "CHỮ": "C",
    "CỤM": "吃独食",
    "PINYIN": "chī dú shí",
    "NGHĨA": "有东西自己一个人吃，不给别人。比喻有好处自己一个人享用，不与别人分享。"
  },
  {
    "STT": 195,
    "CHỮ": "C",
    "CỤM": "吃官司",
    "PINYIN": "chī ɡuān si",
    "NGHĨA": "旧时指被控告、受处罚或者关进监狱。"
  },
  {
    "STT": 196,
    "CHỮ": "C",
    "CỤM": "吃后悔药",
    "PINYIN": "chī hòu huǐ yào",
    "NGHĨA": "比喻事后懊悔。"
  },
  {
    "STT": 197,
    "CHỮ": "C",
    "CỤM": "吃皇粮",
    "PINYIN": "chī huánɡ liánɡ",
    "NGHĨA": "比喻为国家工作，依靠国家给予薪俸生活。"
  },
  {
    "STT": 198,
    "CHỮ": "C",
    "CỤM": "吃老本",
    "PINYIN": "chī lǎo běn",
    "NGHĨA": "比喻依赖原有的知识﹑本领或功劳过日子，没有新的贡献。"
  },
  {
    "STT": 199,
    "CHỮ": "C",
    "CỤM": "吃枪药",
    "PINYIN": "chī qiānɡ yào",
    "NGHĨA": "比喻说话时态度生硬或火气大。"
  },
  {
    "STT": 200,
    "CHỮ": "C",
    "CỤM": "吃青春饭",
    "PINYIN": "chī qīnɡ chūn fàn",
    "NGHĨA": "从事只能给年轻人做的职业。"
  },
  {
    "STT": 201,
    "CHỮ": "C",
    "CỤM": "吃透",
    "PINYIN": "chī tòu",
    "NGHĨA": "捉摸透; 了解透彻。"
  },
  {
    "STT": 202,
    "CHỮ": "C",
    "CỤM": "吃西北风",
    "PINYIN": "chī xī běi fēnɡ",
    "NGHĨA": "比喻没有东西吃，挨饿; 或者闲着没事干，没有收入。也叫喝西北风。"
  },
  {
    "STT": 203,
    "CHỮ": "C",
    "CỤM": "吃香",
    "PINYIN": "chī xiānɡ",
    "NGHĨA": "指受重视; 到处受人欢迎。"
  },
  {
    "STT": 204,
    "CHỮ": "C",
    "CỤM": "吃小灶",
    "PINYIN": "chī xiǎo zào",
    "NGHĨA": "比喻享受到特殊照顾。"
  },
  {
    "STT": 205,
    "CHỮ": "C",
    "CỤM": "吃一堑，长一智",
    "PINYIN": "chī yī qiàn，zhǎnɡ yī zhì",
    "NGHĨA": "受一次挫折，增长一分见识。"
  },
  {
    "STT": 206,
    "CHỮ": "C",
    "CỤM": "丑八怪",
    "PINYIN": "chǒu bā ɡuài",
    "NGHĨA": "指非常难看的人。"
  },
  {
    "STT": 207,
    "CHỮ": "C",
    "CỤM": "丑小鸭",
    "PINYIN": "chǒu xiǎo yā",
    "NGHĨA": "不为人知的人，或不被别人重视的人。"
  },
  {
    "STT": 208,
    "CHỮ": "C",
    "CỤM": "出岔子",
    "PINYIN": "chū chà zi",
    "NGHĨA": "比喻发生差错或事故。"
  },
  {
    "STT": 209,
    "CHỮ": "C",
    "CỤM": "出风头",
    "PINYIN": "chū fēnɡ tóu",
    "NGHĨA": "比喻出头露面，显示自己。"
  },
  {
    "STT": 210,
    "CHỮ": "C",
    "CỤM": "出花样",
    "PINYIN": "chū huā yàng",
    "NGHĨA": "耍花招迷惑或欺骗人。"
  },
  {
    "STT": 211,
    "CHỮ": "C",
    "CỤM": "出乱子",
    "PINYIN": "chū luàn zi",
    "NGHĨA": "出现事故、差错或纠纷。"
  },
  {
    "STT": 212,
    "CHỮ": "C",
    "CỤM": "出难题",
    "PINYIN": "chū nán tí",
    "NGHĨA": "给学生出不容易解答的问题。比喻提出使人为难或难办的事情。"
  },
  {
    "STT": 213,
    "CHỮ": "C",
    "CỤM": "出气筒",
    "PINYIN": "chū qì tǒnɡ",
    "NGHĨA": "比喻无故做别人发泄怨愤对象的人。"
  },
  {
    "STT": 214,
    "CHỮ": "C",
    "CỤM": "出洋相",
    "PINYIN": "chū yánɡ xiànɡ",
    "NGHĨA": "(1) 指因粗心大意或缺乏知识或经验而发生可笑的错误。\r\n (2) 捉弄耍笑使人露出丑相，使人难堪、丢脸。"
  },
  {
    "STT": 215,
    "CHỮ": "C",
    "CỤM": "穿连裆裤",
    "PINYIN": "chuān lián dānɡ kù",
    "NGHĨA": "比喻臭味相投的人联合在一起。也说“穿一条裤子”。"
  },
  {
    "STT": 216,
    "CHỮ": "C",
    "CỤM": "穿小鞋",
    "PINYIN": "chuān xiǎo xié",
    "NGHĨA": "比喻故意刁难。"
  },
  {
    "STT": 217,
    "CHỮ": "C",
    "CỤM": "闯红灯",
    "PINYIN": "chuǎnɡ hónɡ dēnɡ",
    "NGHĨA": "比喻无视纪律、制度、原则的限制，做不该做的事情。"
  },
  {
    "STT": 218,
    "CHỮ": "C",
    "CỤM": "闯江湖",
    "PINYIN": "chuǎnɡ jiānɡ hú",
    "NGHĨA": "旧时指奔走四方，流浪谋生，从事算卦、表演杂\r\n 耍、卖药治病等职业。江湖，泛指四方各地。\r\n 也说“闯荡江湖”。"
  },
  {
    "STT": 219,
    "CHỮ": "C",
    "CỤM": "吹胡子瞪眼",
    "PINYIN": "chuī hú zi dènɡ yǎn",
    "NGHĨA": "比喻人发脾气时凶狠的样子。"
  },
  {
    "STT": 220,
    "CHỮ": "C",
    "CỤM": "吹牛皮",
    "PINYIN": "chuī niú pí",
    "NGHĨA": "指吹牛，说大话。"
  },
  {
    "STT": 221,
    "CHỮ": "D",
    "CỤM": "打白条",
    "PINYIN": "dǎ bái tiáo",
    "NGHĨA": "特指只给欠条、不给现金的做法。"
  },
  {
    "STT": 222,
    "CHỮ": "D",
    "CỤM": "打板子",
    "PINYIN": "dǎ bǎn zi",
    "NGHĨA": "比喻打屁股。"
  },
  {
    "STT": 223,
    "CHỮ": "D",
    "CỤM": "打包票",
    "PINYIN": "dǎ bāo piào",
    "NGHĨA": "比喻保证。也说“打保票”"
  },
  {
    "STT": 224,
    "CHỮ": "D",
    "CỤM": "大草包",
    "PINYIN": "dà cǎo bāo",
    "NGHĨA": "比喻没有才能的人。"
  },
  {
    "STT": 225,
    "CHỮ": "D",
    "CỤM": "打第一炮",
    "PINYIN": "dǎ dì yī pào",
    "NGHĨA": "就是第一个发言，第一个讲话。也说“打头阵”、“打头炮”。"
  },
  {
    "STT": 226,
    "CHỮ": "D",
    "CỤM": "打掉牙齿往肚里咽",
    "PINYIN": "dǎ diào yá chǐ wǎnɡ dù lǐ yàn",
    "NGHĨA": "因理亏等原因，受委屈，而不声张。"
  },
  {
    "STT": 227,
    "CHỮ": "D",
    "CỤM": "打底子",
    "PINYIN": "dǎ dǐzi",
    "NGHĨA": "比喻打好基础，做好准备。"
  },
  {
    "STT": 228,
    "CHỮ": "D",
    "CỤM": "打腹稿",
    "PINYIN": "dǎ fù ɡǎo",
    "NGHĨA": "比喻在心里先形成一个提纲。"
  },
  {
    "STT": 229,
    "CHỮ": "D",
    "CỤM": "打官腔",
    "PINYIN": "dǎ guān qiāng",
    "NGHĨA": "比喻利用规章、手续等来推托或责备，不解决实际问题。官腔，指旧 时官场中说的门面话。"
  },
  {
    "STT": 230,
    "CHỮ": "D",
    "CỤM": "打光棍",
    "PINYIN": "dǎ ɡuānɡ ɡùn",
    "NGHĨA": "指男人不结婚。"
  },
  {
    "STT": 231,
    "CHỮ": "D",
    "CỤM": "打哈哈",
    "PINYIN": "dǎ hā hā",
    "NGHĨA": "比喻顾左右而言他，故意说别的事情。"
  },
  {
    "STT": 232,
    "CHỮ": "D",
    "CỤM": "打黑枪",
    "PINYIN": "dǎ hēi qiāng",
    "NGHĨA": "比喻暗里使坏，乘人不备时突然开枪。比喻暗中对人进行突然袭击。也说“打冷枪”。"
  },
  {
    "STT": 233,
    "CHỮ": "D",
    "CỤM": "大红人",
    "PINYIN": "dà hóng rén",
    "NGHĨA": "指受到领导信任、重用的人。"
  },
  {
    "STT": 234,
    "CHỮ": "D",
    "CỤM": "打交道",
    "PINYIN": "dǎ jiāo dào",
    "NGHĨA": "指交往。"
  },
  {
    "STT": 235,
    "CHỮ": "D",
    "CỤM": "大老粗",
    "PINYIN": "dà lǎo cū",
    "NGHĨA": "粗人一个。"
  },
  {
    "STT": 236,
    "CHỮ": "D",
    "CỤM": "打擂台",
    "PINYIN": "dǎ lèi tái",
    "NGHĨA": "比喻上台比武，当面竞争。"
  },
  {
    "STT": 237,
    "CHỮ": "D",
    "CỤM": "打落水狗",
    "PINYIN": "dǎ luò shuǐ gǒu",
    "NGHĨA": "痛打落入水中的狗。比喻彻底打垮已经失势了的\r\n 坏人。"
  },
  {
    "STT": 238,
    "CHỮ": "D",
    "CỤM": "打马虎眼",
    "PINYIN": "dǎ mǎ hǔ yǎn",
    "NGHĨA": "比喻故意掩饰、装糊涂蒙骗人。"
  },
  {
    "STT": 239,
    "CHỮ": "D",
    "CỤM": "打埋伏",
    "PINYIN": "dǎ mái fú",
    "NGHĨA": "原指军事用语，指预先隐蔽起来，待机行动。比喻隐瞒某些事实或不 \r\n 暴露情况。"
  },
  {
    "STT": 240,
    "CHỮ": "D",
    "CỤM": "打破铁饭碗",
    "PINYIN": "dǎ pò tiě fàn wǎn",
    "NGHĨA": "指放弃固定的工作。"
  },
  {
    "STT": 241,
    "CHỮ": "D",
    "CỤM": "大气候",
    "PINYIN": "dà qì hòu",
    "NGHĨA": "大环境。"
  },
  {
    "STT": 242,
    "CHỮ": "D",
    "CỤM": "打前站",
    "PINYIN": "dǎ qián zhàn",
    "NGHĨA": "指行军或集体出发前，先派人到将要去的地点\r\n 联系或安排有关事务。"
  },
  {
    "STT": 243,
    "CHỮ": "D",
    "CỤM": "搭鹊桥",
    "PINYIN": "dā què qiáo",
    "NGHĨA": "指为男女牵线、撮合。"
  },
  {
    "STT": 244,
    "CHỮ": "D",
    "CỤM": "打入冷宫",
    "PINYIN": "dǎ rù lěng gōng",
    "NGHĨA": "放到一边，不予理睬。"
  },
  {
    "STT": 245,
    "CHỮ": "D",
    "CỤM": "打入十八层地狱",
    "PINYIN": "dǎ rù shí bā céng dì yù",
    "NGHĨA": "比喻境况十分困苦。"
  },
  {
    "STT": 246,
    "CHỮ": "D",
    "CỤM": "打如意算盘",
    "PINYIN": "dǎ rú yì suàn pán",
    "NGHĨA": "比喻做美梦，只从好的一方面去考虑、打算。"
  },
  {
    "STT": 247,
    "CHỮ": "D",
    "CỤM": "打时间差",
    "PINYIN": "dǎ shí jiān chā",
    "NGHĨA": "比喻利用时间上的差数来实现某种目的。"
  },
  {
    "STT": 248,
    "CHỮ": "D",
    "CỤM": "打水漂",
    "PINYIN": "dǎ shuǐ piào",
    "NGHĨA": "比喻没有了，白费。"
  },
  {
    "STT": 249,
    "CHỮ": "D",
    "CỤM": "打死老虎",
    "PINYIN": "dǎ sǐ lǎo hǔ",
    "NGHĨA": "比喻只能打死了的老虎，可是对活老虎却没有办法。"
  },
  {
    "STT": 250,
    "CHỮ": "D",
    "CỤM": "打太极拳",
    "PINYIN": "dǎ tài jí quán",
    "NGHĨA": "比喻遇事推托敷衍。常指政府各部门间把需解决的问题推给别的 部门，结果是效率低下，谁也不解决。"
  },
  {
    "STT": 251,
    "CHỮ": "D",
    "CỤM": "打天下",
    "PINYIN": "dǎ tiān xià",
    "NGHĨA": "比喻闯天下，创业。"
  },
  {
    "STT": 252,
    "CHỮ": "D",
    "CỤM": "打头阵",
    "PINYIN": "dǎ tóu zhèn",
    "NGHĨA": "比喻第一个上场。"
  },
  {
    "STT": 253,
    "CHỮ": "D",
    "CỤM": "打退堂鼓",
    "PINYIN": "dǎ tuì táng gǔ",
    "NGHĨA": "原指旧时官吏坐堂问事完了，打退堂鼓。比喻中途退缩，不想参加了。"
  },
  {
    "STT": 254,
    "CHỮ": "D",
    "CỤM": "打下手",
    "PINYIN": "dǎ xià shǒu",
    "NGHĨA": "比喻给别人做辅助性的工作。"
  },
  {
    "STT": 255,
    "CHỮ": "D",
    "CỤM": "打小报告",
    "PINYIN": "dǎ xiǎo bào gào",
    "NGHĨA": "不怀好意地把别人的言行反映给领导。"
  },
  {
    "STT": 256,
    "CHỮ": "D",
    "CỤM": "打牙祭",
    "PINYIN": "dǎ yá jì",
    "NGHĨA": "就是解馋。"
  },
  {
    "STT": 257,
    "CHỮ": "D",
    "CỤM": "打哑谜",
    "PINYIN": "dǎ yǎ mí",
    "NGHĨA": "故意不说出事情的真实情况而又让人难以猜测。"
  },
  {
    "STT": 258,
    "CHỮ": "D",
    "CỤM": "打掩护",
    "PINYIN": "dǎ yǎn hù",
    "NGHĨA": "比喻掩饰某种行为。"
  },
  {
    "STT": 259,
    "CHỮ": "D",
    "CỤM": "打游击",
    "PINYIN": "dǎ yóu jī",
    "NGHĨA": "到处跑，无固定的地方。"
  },
  {
    "STT": 260,
    "CHỮ": "D",
    "CỤM": "打预防针",
    "PINYIN": "dǎ yù fáng zhēn",
    "NGHĨA": "指提前提醒。也说“打防疫针”。"
  },
  {
    "STT": 261,
    "CHỮ": "D",
    "CỤM": "打圆场",
    "PINYIN": "dǎ yuán chǎng",
    "NGHĨA": "比喻为打开僵局而从中调解或提出折中办法。大事化小，小事化了。给别人一个台阶。"
  },
  {
    "STT": 262,
    "CHỮ": "D",
    "CỤM": "打照面",
    "PINYIN": "dǎ zhào miàn",
    "NGHĨA": "指见面、不期而遇。"
  },
  {
    "STT": 263,
    "CHỮ": "D",
    "CỤM": "打折扣",
    "PINYIN": "dǎ zhé kòu",
    "NGHĨA": "原为商业用语，即降低商品价格。\r\n (1) 比喻达不到预定的标准。\r\n (2) 比喻不完全按规矩来做。\r\n (3)比喻不能完全相信某种言论或做法。"
  },
  {
    "STT": 264,
    "CHỮ": "D",
    "CỤM": "打肿脸充胖子",
    "PINYIN": "dǎ zhǒng liǎn chōng pàng zi",
    "NGHĨA": "没有那么大的能力却硬要装作有这样的能力。"
  },
  {
    "STT": 265,
    "CHỮ": "D",
    "CỤM": "打主意",
    "PINYIN": "dǎ zhǔ yì",
    "NGHĨA": "就是想主意。"
  },
  {
    "STT": 266,
    "CHỮ": "D",
    "CỤM": "大嘴巴",
    "PINYIN": "dà zuǐ ba",
    "NGHĨA": "不能保守秘密的人。"
  },
  {
    "STT": 267,
    "CHỮ": "D",
    "CỤM": "带头羊",
    "PINYIN": "dài tóu yáng",
    "NGHĨA": "指带头的人。也说“领头羊”。"
  },
  {
    "STT": 268,
    "CHỮ": "D",
    "CỤM": "担风险",
    "PINYIN": "dān fēng xiǎn",
    "NGHĨA": "指承当可能发生的危险。"
  },
  {
    "STT": 269,
    "CHỮ": "D",
    "CỤM": "担干系",
    "PINYIN": "dān gān xì",
    "NGHĨA": "比喻承担责任。"
  },
  {
    "STT": 270,
    "CHỮ": "D",
    "CỤM": "单身贵族",
    "PINYIN": "dān shēn guì zú",
    "NGHĨA": "快乐的单身者。"
  },
  {
    "STT": 271,
    "CHỮ": "D",
    "CỤM": "当红娘",
    "PINYIN": "dāng hóng niáng",
    "NGHĨA": "指充当为男女婚姻或其他事情牵线搭桥的人。"
  },
  {
    "STT": 272,
    "CHỮ": "D",
    "CỤM": "挡箭牌",
    "PINYIN": "dǎng jiàn pái",
    "NGHĨA": "即盾牌，古代用来防护身体、遮挡刀箭的武器。比喻推脱责任的借\r\n 口。或者比喻起遮掩、保护作用的人。"
  },
  {
    "STT": 273,
    "CHỮ": "D",
    "CỤM": "倒打一耙",
    "PINYIN": "dào dǎ yī pá",
    "NGHĨA": "现在多用来比喻自己干了坏事不承认，反而对检举人反咬一口;\r\n 或者是不接受别人的批评，反而指责批评的人。"
  },
  {
    "STT": 274,
    "CHỮ": "D",
    "CỤM": "倒苦水",
    "PINYIN": "dào kǔ shuǐ",
    "NGHĨA": "向别人诉说自己的痛苦或委屈。也说“吐苦水”。"
  },
  {
    "STT": 275,
    "CHỮ": "D",
    "CỤM": "倒胃口",
    "PINYIN": "dǎo wèi kǒu",
    "NGHĨA": "指因为腻味而不想再吃。比喻讲话、文章或演出等没有意思，令人腻烦，使人不愿听，不愿看。"
  },
  {
    "STT": 276,
    "CHỮ": "D",
    "CỤM": "倒吸一口冷气",
    "PINYIN": "dào xī yī kǒu lěng qì",
    "NGHĨA": "表示恐惧，或躲过灾难，但想想仍害怕。"
  },
  {
    "STT": 277,
    "CHỮ": "D",
    "CỤM": "倒栽葱",
    "PINYIN": "dào zāi cōng",
    "NGHĨA": "栽葱时不是根先入土，而是头先入土，倒着栽。比喻摔跟斗时头先着地。\r\n 或比喻从高处或空中头朝下摔下来。"
  },
  {
    "STT": 278,
    "CHỮ": "D",
    "CỤM": "刀子嘴",
    "PINYIN": "dāo zi zuǐ",
    "NGHĨA": "嘴巴凌厉尖刻。"
  },
  {
    "STT": 279,
    "CHỮ": "D",
    "CỤM": "等到驴年马月",
    "PINYIN": "děng dào lǘ nián mǎ yuè",
    "NGHĨA": "形容期望的时间太长，不知何时才能实现。"
  },
  {
    "STT": 280,
    "CHỮ": "D",
    "CỤM": "等到日头从西出",
    "PINYIN": "děng dào rì tou cóng xī chū",
    "NGHĨA": "太阳不可能从西边升起。指事情永远不可能实现。"
  },
  {
    "STT": 281,
    "CHỮ": "D",
    "CỤM": "等米下锅",
    "PINYIN": "děng mǐ xià guō",
    "NGHĨA": "形容家庭贫困，没粮食吃。\r\n 比喻急需得到原材料或素材。"
  },
  {
    "STT": 282,
    "CHỮ": "D",
    "CỤM": "瞪眼吹胡子",
    "PINYIN": "dèng yǎn chuī hú zi",
    "NGHĨA": "见“吹胡子瞪眼”。"
  },
  {
    "STT": 283,
    "CHỮ": "D",
    "CỤM": "等于零",
    "PINYIN": "děng yú líng",
    "NGHĨA": "指完全不起作用。"
  },
  {
    "STT": 284,
    "CHỮ": "D",
    "CỤM": "蹬着鼻子撒尿",
    "PINYIN": "dēng zhe bí zi sā niào",
    "NGHĨA": "形容欺人太甚。"
  },
  {
    "STT": 285,
    "CHỮ": "D",
    "CỤM": "蹬着鼻子上脸",
    "PINYIN": "dēng zhe bí zi shàng liǎn",
    "NGHĨA": "形容人得寸进尺，越来越过分。"
  },
  {
    "STT": 286,
    "CHỮ": "D",
    "CỤM": "等着天上掉馅饼",
    "PINYIN": "děng zhe tiān shàng diào xiàn bing",
    "NGHĨA": "比喻不肯努力就想白白获取。"
  },
  {
    "STT": 287,
    "CHỮ": "D",
    "CỤM": "瞪着眼挨饿",
    "PINYIN": "dèng zhe yǎn āi è",
    "NGHĨA": "指于饿肚子,想不出解决的办法。"
  },
  {
    "STT": 288,
    "CHỮ": "D",
    "CỤM": "瞪着眼扯谎",
    "PINYIN": "dèng zhe yǎn chě huǎng",
    "NGHĨA": "讽刺人不顾事实，胡说骗人。"
  },
  {
    "STT": 289,
    "CHỮ": "D",
    "CỤM": "瞪着眼瞅着",
    "PINYIN": "dèng zhe yǎn chǒu zhe",
    "NGHĨA": "指冷眼旁观，不愿插手或不施以援助。"
  },
  {
    "STT": 290,
    "CHỮ": "D",
    "CỤM": "瞪着眼粗了筋",
    "PINYIN": "dèng zhe yǎn cū le jīn",
    "NGHĨA": "形容人发脾气时青筋暴起，怒目圆睁的样子。"
  },
  {
    "STT": 291,
    "CHỮ": "D",
    "CỤM": "地不栽，天不盖",
    "PINYIN": "dì bù zāi，tiān bù gài",
    "NGHĨA": "形容人身世孤单，连天地间再无庇护他。"
  },
  {
    "STT": 292,
    "CHỮ": "D",
    "CỤM": "底儿朝天",
    "PINYIN": "dǐ er cháo tiān",
    "NGHĨA": "用光、见底，形容完全、彻底没有了。"
  },
  {
    "STT": 293,
    "CHỮ": "D",
    "CỤM": "递和气",
    "PINYIN": "dì hé qì",
    "NGHĨA": "指主动与人接近，想把关系搞好。"
  },
  {
    "STT": 294,
    "CHỮ": "D",
    "CỤM": "递门包",
    "PINYIN": "dì mén bāo",
    "NGHĨA": "指给看门人或通报人送礼。"
  },
  {
    "STT": 295,
    "CHỮ": "D",
    "CỤM": "低门户",
    "PINYIN": "dī mén hù",
    "NGHĨA": "指出身卑微或家庭贫寒。"
  },
  {
    "STT": 296,
    "CHỮ": "D",
    "CỤM": "地面硬",
    "PINYIN": "dì miàn yìng",
    "NGHĨA": "比喻某地的人难以管理。"
  },
  {
    "STT": 297,
    "CHỮ": "D",
    "CỤM": "低三下四",
    "PINYIN": "dī sān xià sì",
    "NGHĨA": "指条件或身份等不如他人。"
  },
  {
    "STT": 298,
    "CHỮ": "D",
    "CỤM": "第三者插足",
    "PINYIN": "dì sān zhě chā zú",
    "NGHĨA": "指夫妻某一方的感情中出现了另外的人,干扰正常的家庭生活。"
  },
  {
    "STT": 299,
    "CHỮ": "D",
    "CỤM": "地上往来人金子",
    "PINYIN": "dì shàng wǎng lái rén jīn zi",
    "NGHĨA": "指意外获得财富。"
  },
  {
    "STT": 300,
    "CHỮ": "D",
    "CỤM": "地生不熟",
    "PINYIN": "dì shēng bù shú",
    "NGHĨA": "指对某地的环境和道路不熟悉。"
  },
  {
    "STT": 301,
    "CHỮ": "D",
    "CỤM": "递条子",
    "PINYIN": "dì tiáo zi",
    "NGHĨA": "指为私事写蜜密信说情。"
  },
  {
    "STT": 302,
    "CHỮ": "D",
    "CỤM": "低头不见抬头见",
    "PINYIN": "dī tóu bù jiàn tái tóu jiàn",
    "NGHĨA": "见“抬头不见低头见”。"
  },
  {
    "STT": 303,
    "CHỮ": "D",
    "CỤM": "低头而进，仰面而出",
    "PINYIN": "dī tóu ér jìn, yǎng miàn ér chū",
    "NGHĨA": "指虽然处于一室，但谁都不理谁。"
  },
  {
    "STT": 304,
    "CHỮ": "D",
    "CỤM": "低头进，低头出",
    "PINYIN": "dī tóu jìn, dī tóu chū",
    "NGHĨA": "形容为人谦逊，讲求礼数。"
  },
  {
    "STT": 305,
    "CHỮ": "D",
    "CỤM": "地头蛇",
    "PINYIN": "dì tóu shé",
    "NGHĨA": "指在当地很有势力的人。"
  },
  {
    "STT": 306,
    "CHỮ": "D",
    "CỤM": "地无三尺，山无一寸",
    "PINYIN": "dì wú sān chǐ, shān wú yī cùn",
    "NGHĨA": "形容极端贫困，一无所有。"
  },
  {
    "STT": 307,
    "CHỮ": "D",
    "CỤM": "地下冒出来",
    "PINYIN": "dì xià mào chū lái",
    "NGHĨA": "指凭空出现。"
  },
  {
    "STT": 308,
    "CHỮ": "D",
    "CỤM": "递眼色",
    "PINYIN": "dì yǎn sè",
    "NGHĨA": "指用眼神示意。"
  },
  {
    "STT": 309,
    "CHỮ": "D",
    "CỤM": "低着脑袋过日子",
    "PINYIN": "dī zhe nǎo dai guò rì zi",
    "NGHĨA": "指过一种忍让、屈从的生活。"
  },
  {
    "STT": 310,
    "CHỮ": "D",
    "CỤM": "低着头吃哑巴亏",
    "PINYIN": "dī zhe tóu chī yǎ ba kuī",
    "NGHĨA": "指甘愿受欺负，吃了亏却不反抗。"
  },
  {
    "STT": 311,
    "CHỮ": "D",
    "CỤM": "底子薄",
    "PINYIN": "dǐ zi báo",
    "NGHĨA": "指物质基础或文化水平太差。"
  },
  {
    "STT": 312,
    "CHỮ": "D",
    "CỤM": "底子厚",
    "PINYIN": "dǐ zi hòu",
    "NGHĨA": "指物质基础或文化基础良好。"
  },
  {
    "STT": 313,
    "CHỮ": "D",
    "CỤM": "点半截灯",
    "PINYIN": "diǎn bàn jié dēng",
    "NGHĨA": "比喻说话语中透露一点儿真意，但不挑明。"
  },
  {
    "STT": 314,
    "CHỮ": "D",
    "CỤM": "垫刀背",
    "PINYIN": "diàn dāo bèi",
    "NGHĨA": "比喻替人辩解或替人承担责任、罪名。"
  },
  {
    "STT": 315,
    "CHỮ": "D",
    "CỤM": "点得着火的运气",
    "PINYIN": "diǎn de zhe huǒ de yùn qì",
    "NGHĨA": "形容运气非常好。"
  },
  {
    "STT": 316,
    "CHỮ": "D",
    "CỤM": "垫底子",
    "PINYIN": "diàn dǐ zi",
    "NGHĨA": "比喻打基础。"
  },
  {
    "STT": 317,
    "CHỮ": "D",
    "CỤM": "垫肚子",
    "PINYIN": "diàn dù zi",
    "NGHĨA": "指胡乱吃点东西暂时解饿。\r\n 指代人受过或陪人受死。"
  },
  {
    "STT": 318,
    "CHỮ": "D",
    "CỤM": "掂分量",
    "PINYIN": "diān fèn liàng",
    "NGHĨA": "指估量人能力的大小。\r\n 比喻内心反复考虑、斟酌。"
  },
  {
    "STT": 319,
    "CHỮ": "D",
    "CỤM": "点根香，怕出烟",
    "PINYIN": "diǎn gēn xiāng, pà chū yān",
    "NGHĨA": "形容人胆小怕事或过于谨慎小心。"
  },
  {
    "STT": 320,
    "CHỮ": "D",
    "CỤM": "垫棺材底",
    "PINYIN": "diàn guān cai dǐ",
    "NGHĨA": "指陪人一起死。"
  },
  {
    "STT": 321,
    "CHỮ": "D",
    "CỤM": "点鬼火",
    "PINYIN": "diǎn guǐ huǒ",
    "NGHĨA": "比喻鼓动别人做坏事。"
  },
  {
    "STT": 322,
    "CHỮ": "D",
    "CỤM": "掂过子",
    "PINYIN": "diān guò zi",
    "NGHĨA": "指反复提起。"
  },
  {
    "STT": 323,
    "CHỮ": "D",
    "CỤM": "垫脚根儿",
    "PINYIN": "diàn jiǎo gēn er",
    "NGHĨA": "比喻给人家垫底，供人向上爬。"
  },
  {
    "STT": 324,
    "CHỮ": "D",
    "CỤM": "掂斤拨两",
    "PINYIN": "diān jīn bō liǎng",
    "NGHĨA": "比喻试探人的水平、本领。\r\n 比喻内心反复权衡、考虑。 \r\n 比喻和人打交道过分计较或过分在意得失。"
  },
  {
    "STT": 325,
    "CHỮ": "D",
    "CỤM": "点迷津",
    "PINYIN": "diǎn mí jīn",
    "NGHĨA": "指为他人指明疑难的方法、途径。"
  },
  {
    "STT": 326,
    "CHỮ": "D",
    "CỤM": "掂人分量放小菜碟儿",
    "PINYIN": "diān rén fèn liàng fàng xiǎo cài dié er",
    "NGHĨA": "比喻根据对方身份、地位的不同而采取不同的态度。"
  },
  {
    "STT": 327,
    "CHỮ": "D",
    "CỤM": "垫舌根",
    "PINYIN": "diàn shé gēn",
    "NGHĨA": "比喻被人背后指责、议论。"
  },
  {
    "STT": 328,
    "CHỮ": "D",
    "CỤM": "点天灯",
    "PINYIN": "diǎn tiān dēng",
    "NGHĨA": "旧时一种酷刑。把人吊起来，身上浇油活活烧死。"
  },
  {
    "STT": 329,
    "CHỮ": "D",
    "CỤM": "点邪火",
    "PINYIN": "diǎn xié huǒ",
    "NGHĨA": "见“放邪火”。"
  },
  {
    "STT": 330,
    "CHỮ": "D",
    "CỤM": "点子多",
    "PINYIN": "diǎn zi duō",
    "NGHĨA": "指人思维灵活，主意或计谋多。"
  },
  {
    "STT": 331,
    "CHỮ": "D",
    "CỤM": "吊膀子",
    "PINYIN": "diào bǎng zi",
    "NGHĨA": "比喻人说话、做事反复无常,一会儿一个样儿。"
  },
  {
    "STT": 332,
    "CHỮ": "D",
    "CỤM": "钓大鱼",
    "PINYIN": "diào dà yú",
    "NGHĨA": "比喻获得极大的利益。"
  },
  {
    "STT": 333,
    "CHỮ": "D",
    "CỤM": "吊到喉咙的心放下",
    "PINYIN": "diào dào hóu lóng de xīn fàng xià",
    "NGHĨA": "指不再担忧、惊恐。"
  },
  {
    "STT": 334,
    "CHỮ": "D",
    "CỤM": "掉到黄河也洗不清",
    "PINYIN": "diào dào huáng hé yě xǐ bù qīng",
    "NGHĨA": "比喻永远无法向人澄清事实，洗刷冤屈。"
  },
  {
    "STT": 335,
    "CHỮ": "D",
    "CỤM": "掉个灰堆也怕碰破头",
    "PINYIN": "diào gè huī duī yě pà pèng pò tóu",
    "NGHĨA": "讽刺人胆小怕事或过分谨慎。"
  },
  {
    "STT": 336,
    "CHỮ": "D",
    "CỤM": "掉海不泛泡",
    "PINYIN": "diào hǎi bù fàn pào",
    "NGHĨA": "掉进海里都不会泛起泡沫。咒人不得好死。"
  },
  {
    "STT": 337,
    "CHỮ": "D",
    "CỤM": "掉花枪",
    "PINYIN": "diào huā qiāng",
    "NGHĨA": "喻指玩弄技巧，卖弄小聪明。"
  },
  {
    "STT": 338,
    "CHỮ": "D",
    "CỤM": "掉架子",
    "PINYIN": "diào jià zi",
    "NGHĨA": "指有失身份，尊严。"
  },
  {
    "STT": 339,
    "CHỮ": "D",
    "CỤM": "钓金龟婿",
    "PINYIN": "diào jīn guī xù",
    "NGHĨA": "比喻找有钱或有前途的好女婿。"
  },
  {
    "STT": 340,
    "CHỮ": "D",
    "CỤM": "掉进葫芦里",
    "PINYIN": "diào jìn hú lú lǐ",
    "NGHĨA": "葫芦：上窄下宽。东西掉进去很难出来。比喻有进无出。"
  },
  {
    "STT": 341,
    "CHỮ": "D",
    "CỤM": "掉进火坑里",
    "PINYIN": "diào jìn huǒ kēng lǐ",
    "NGHĨA": "比喻处于危险或痛苦的境地。"
  },
  {
    "STT": 342,
    "CHỮ": "D",
    "CỤM": "掉链子",
    "PINYIN": "diào liàn zi",
    "NGHĨA": "比喻关键时刻出了问题。"
  },
  {
    "STT": 343,
    "CHỮ": "D",
    "CỤM": "掉脸子",
    "PINYIN": "diào liǎn zi",
    "NGHĨA": "指因生气而把脸沉下来。"
  },
  {
    "STT": 344,
    "CHỮ": "D",
    "CỤM": "掉脑袋",
    "PINYIN": "diào nǎo dai",
    "NGHĨA": "指失去性命。"
  },
  {
    "STT": 345,
    "CHỮ": "D",
    "CỤM": "吊起铁锅当钟敲",
    "PINYIN": "diào qǐ tiě guō dāng zhōng qiāo",
    "NGHĨA": "吊起锅来不能做饭。形容生活贫困，无米下锅。"
  },
  {
    "STT": 346,
    "CHỮ": "D",
    "CỤM": "吊起下巴乱说话",
    "PINYIN": "diào qǐ xià bā luàn shuō huà",
    "NGHĨA": "指不顾事实，不计后果胡乱说话。"
  },
  {
    "STT": 347,
    "CHỮ": "D",
    "CỤM": "掉三寸之舌",
    "PINYIN": "diào sān cùn zhī shé",
    "NGHĨA": "指巧言辩解。"
  },
  {
    "STT": 348,
    "CHỮ": "D",
    "CỤM": "掉书袋",
    "PINYIN": "diào shū dài",
    "NGHĨA": "形容说话,做事非常认真,一点儿也不马虎。"
  },
  {
    "STT": 349,
    "CHỮ": "D",
    "CỤM": "吊桶落在井里",
    "PINYIN": "diào tǒng luò zài jǐng lǐ",
    "NGHĨA": "比喻使人落空，无法摆脱。"
  },
  {
    "STT": 350,
    "CHỮ": "D",
    "CỤM": "吊胃口",
    "PINYIN": "diào wèi kǒu",
    "NGHĨA": "比喻诱使人产生兴趣、欲望。"
  },
  {
    "STT": 351,
    "CHỮ": "D",
    "CỤM": "掉眼线",
    "PINYIN": "diào yǎn xiàn",
    "NGHĨA": "指暗地里探听消息。"
  },
  {
    "STT": 352,
    "CHỮ": "D",
    "CỤM": "吊油嘴",
    "PINYIN": "diào yóu zuǐ",
    "NGHĨA": "指说些无聊的或开玩笑的话。"
  },
  {
    "STT": 353,
    "CHỮ": "D",
    "CỤM": "钓鱼跑了鱼钩，卖面翻了笸箩",
    "PINYIN": "diào yú pǎo le yú gōu, mài miàn fān le pǒ luo",
    "NGHĨA": "形容倒霉透顶，事事不顺。"
  },
  {
    "STT": 354,
    "CHỮ": "D",
    "CỤM": "掉在地上摔三截",
    "PINYIN": "diào zài dì shàng shuāi sān jié",
    "NGHĨA": "形容人喝醉后摇摇晃晃。"
  },
  {
    "STT": 355,
    "CHỮ": "D",
    "CỤM": "掉在井里没人问，丢在道上没人捡",
    "PINYIN": "diào zài jǐng lǐ méi rén wèn, diū zài dào shàng méi rén jiǎn",
    "NGHĨA": "指没人管，没人关心或没人愿意搭理。"
  },
  {
    "STT": 356,
    "CHỮ": "D",
    "CỤM": "掉在面糊盆内",
    "PINYIN": "diào zài miàn hú pén nèi",
    "NGHĨA": "形容人头脑糊涂,请不请是非。"
  },
  {
    "STT": 357,
    "CHỮ": "D",
    "CỤM": "掉在脑后",
    "PINYIN": "diào zài nǎo hòu",
    "NGHĨA": "见“撇在脑后”。"
  },
  {
    "STT": 358,
    "CHỮ": "D",
    "CỤM": "掉在泥坑里头",
    "PINYIN": "diào zài ní kēng lǐ tou",
    "NGHĨA": "比喻遭遇困境。"
  },
  {
    "STT": 359,
    "CHỮ": "D",
    "CỤM": "掉在自己挖的坑子里",
    "PINYIN": "diào zài zì jǐ wā de kēng zi lǐ",
    "NGHĨA": "比喻害人不成终害己。"
  },
  {
    "STT": 360,
    "CHỮ": "D",
    "CỤM": "吊着老虎胡子打秋千",
    "PINYIN": "diào zhe lǎo hǔ hú zi dǎ qiū qiān",
    "NGHĨA": "比喻临死前极度享乐。"
  },
  {
    "STT": 361,
    "CHỮ": "D",
    "CỤM": "跌眼镜",
    "PINYIN": "diē yǎn jìng",
    "NGHĨA": "比喻与预想的出入很大，事情出乎意料，让人吃惊。"
  },
  {
    "STT": 362,
    "CHỮ": "D",
    "CỤM": "顶半边天",
    "PINYIN": "dǐng bàn biān tiān",
    "NGHĨA": "指新社会妇女能起重要作用。"
  },
  {
    "STT": 363,
    "CHỮ": "D",
    "CỤM": "定不住锤",
    "PINYIN": "dìng bù zhù chuí",
    "NGHĨA": "比喻心里没底,拿不定主意。"
  },
  {
    "STT": 364,
    "CHỮ": "D",
    "CỤM": "定雌雄",
    "PINYIN": "dìng cí xióng",
    "NGHĨA": "比喻决出胜负,高下。"
  },
  {
    "STT": 365,
    "CHỮ": "D",
    "CỤM": "定调子",
    "PINYIN": "dìng diào zi",
    "NGHĨA": "比喻事先确定观点和做法。"
  },
  {
    "STT": 366,
    "CHỮ": "D",
    "CỤM": "钉对钉，铆对钢铆",
    "PINYIN": "dīng duì dīng, mǎo duì gāng mǎo",
    "NGHĨA": "形容做事认真,丝毫不差。"
  },
  {
    "STT": 367,
    "CHỮ": "D",
    "CỤM": "顶风臭四十里",
    "PINYIN": "dǐng fēng chòu sì shí lǐ",
    "NGHĨA": "见“打个喷嚏,顶风臭十里”。"
  },
  {
    "STT": 368,
    "CHỮ": "D",
    "CỤM": "顶风上",
    "PINYIN": "dǐng fēng shàng",
    "NGHĨA": "指迎着困难做工作。 \r\n 指违反有关的政策、法规行事。"
  },
  {
    "STT": 369,
    "CHỮ": "D",
    "CỤM": "顶杠子",
    "PINYIN": "dǐng gàng zi",
    "NGHĨA": "指林人接受批评,处罚。"
  },
  {
    "STT": 370,
    "CHỮ": "D",
    "CỤM": "顶黑锅",
    "PINYIN": "dǐng hēi guō",
    "NGHĨA": "见“背黑锅”。"
  },
  {
    "STT": 371,
    "CHỮ": "D",
    "CỤM": "顶梁柱",
    "PINYIN": "dǐng liáng zhù",
    "NGHĨA": "支撑房梁的柱子。比喻起主要作用的骨干力量。"
  },
  {
    "STT": 372,
    "CHỮ": "D",
    "CỤM": "丢在脖子后头",
    "PINYIN": "diū zài bó zi hòu tou",
    "NGHĨA": "见”仍在脖子后边”。"
  },
  {
    "STT": 373,
    "CHỮ": "D",
    "CỤM": "丢在九霄云外",
    "PINYIN": "diū zài jiǔ xiāo yún wài",
    "NGHĨA": "形容事情忘得一干二净。"
  },
  {
    "STT": 374,
    "CHỮ": "D",
    "CỤM": "丢在水里",
    "PINYIN": "diū zài shuǐ lǐ",
    "NGHĨA": "比喻把财物扔掉,没有一点回报。"
  },
  {
    "STT": 375,
    "CHỮ": "D",
    "CỤM": "东不成,西不就",
    "PINYIN": "dōng bù chéng, xī bù jiù",
    "NGHĨA": "什么样的都不合适。多指选择配偶时的窘境,好的高攀不上,差的又不想要。"
  },
  {
    "STT": 376,
    "CHỮ": "D",
    "CỤM": "冬不论三九，夏不论三伏",
    "PINYIN": "dōng bù lùn sān jiǔ, xià bù lùn sān fú",
    "NGHĨA": "形容工作非常辛苦,在气候最恶劣的时候都得坚持。指只说嘴而不行动。"
  },
  {
    "STT": 377,
    "CHỮ": "D",
    "CỤM": "东不是,西不是",
    "PINYIN": "dōng bù shì, xī bù shì",
    "NGHĨA": "形容对人或环境要求苛刻,怎么都不满意。"
  },
  {
    "STT": 378,
    "CHỮ": "D",
    "CỤM": "动不着一根毫毛",
    "PINYIN": "dòng bù zháo yī gēn háo máo",
    "NGHĨA": "比喻不能对某人造成极微小的伤害。"
  },
  {
    "STT": 379,
    "CHỮ": "D",
    "CỤM": "东扯葫芦西扯瓢",
    "PINYIN": "dōng chě hú lú xī chě piáo",
    "NGHĨA": "比喻说话东拉西扯,不着边际,没有主题。"
  },
  {
    "STT": 380,
    "CHỮ": "D",
    "CỤM": "动醋火",
    "PINYIN": "dòng cù huǒ",
    "NGHĨA": "指因嫉妒而发愁。"
  },
  {
    "STT": 381,
    "CHỮ": "D",
    "CỤM": "东倒吃猪头，西倒吃羊头",
    "PINYIN": "dōng dǎo chī zhū tóu, xī dǎo chī yáng tóu",
    "NGHĨA": "向东倒可以吃到猪头,向西倒可以吃到羊头。比喻做事两边倒,哪边有利投向哪边。"
  },
  {
    "STT": 382,
    "CHỮ": "D",
    "CỤM": "动恶念",
    "PINYIN": "dòng è niàn",
    "NGHĨA": "指产生邪恶的念头或想法。"
  },
  {
    "STT": 383,
    "CHỮ": "D",
    "CỤM": "东耳朵进，西耳朵出",
    "PINYIN": "dōng ěr duo jìn, xī ěr duo chū",
    "NGHĨA": "见“这个耳朵进来,那个耳朵出去”。"
  },
  {
    "STT": 384,
    "CHỮ": "D",
    "CỤM": "东房凉儿没有了，到西房凉里歇",
    "PINYIN": "dōng fáng liáng er méi yǒu le, dào xī fáng liáng lǐ xiē",
    "NGHĨA": "比喻哪边有利就到哪边去。"
  },
  {
    "STT": 385,
    "CHỮ": "D",
    "CỤM": "东风吹来往西倒,西风吹来往东倒",
    "PINYIN": "dōng fēng chuī lái wǎng xī dǎo, xī fēng chuī lái wǎng dōng dǎo",
    "NGHĨA": "比喻人做事没主见,常随着情势的发展改变态度和立场。"
  },
  {
    "STT": 386,
    "CHỮ": "D",
    "CỤM": "东风压倒西风",
    "PINYIN": "dōng fēng yā dǎo xī fēng",
    "NGHĨA": "比喻一方的势力压倒另一方。"
  },
  {
    "STT": 387,
    "CHỮ": "D",
    "CỤM": "动干戈",
    "PINYIN": "dòng gān gē",
    "NGHĨA": "指发生武力冲突或战争。"
  },
  {
    "STT": 388,
    "CHỮ": "D",
    "CỤM": "动肝火",
    "PINYIN": "dòng gān huǒ",
    "NGHĨA": "指动怒生气,发泄不满。"
  },
  {
    "STT": 389,
    "CHỮ": "D",
    "CỤM": "东沟犁，西沟杷",
    "PINYIN": "dōng gōu lí, xī gōu pá",
    "NGHĨA": "形容说话或做事没有条理。"
  },
  {
    "STT": 390,
    "CHỮ": "D",
    "CỤM": "冬瓜拉到茄子地里",
    "PINYIN": "dōng guā lā dào qié zi dì lǐ",
    "NGHĨA": "比喻说话或做事胡牵亂扯。"
  },
  {
    "STT": 391,
    "CHỮ": "D",
    "CỤM": "冬瓜推在葫芦帐上",
    "PINYIN": "dōng guā tuī zài hú lú zhàng shàng",
    "NGHĨA": "比喻把责任推给别人,自己不愿承担。"
  },
  {
    "STT": 392,
    "CHỮ": "D",
    "CỤM": "东海起了灰尘，西天出了太阳",
    "PINYIN": "dōng hǎi qǐ le huī chén, xī tiān chū le tài yáng",
    "NGHĨA": "海里不可能起灰尘,太阳也不可能从西边出来,指事情永远不可能发生。"
  },
  {
    "STT": 393,
    "CHỮ": "D",
    "CỤM": "东葫芦爬西架",
    "PINYIN": "dōng hú lú pá xī jià",
    "NGHĨA": "比喻两者相距太远,沾不上边。"
  },
  {
    "STT": 394,
    "CHỮ": "D",
    "CỤM": "东集赶到西集",
    "PINYIN": "dōng jí gǎn dào xī jí",
    "NGHĨA": "指人不务正业,到处乱跑。"
  },
  {
    "STT": 395,
    "CHỮ": "D",
    "CỤM": "东家瓷，西家短",
    "PINYIN": "dōng jiā cháng, xī jiā duǎn",
    "NGHĨA": "见“张家长,李家短”。"
  },
  {
    "STT": 396,
    "CHỮ": "D",
    "CỤM": "东家点灯，西家暗坐",
    "PINYIN": "dōng jiā diǎn dēng, xī jiā àn zuò",
    "NGHĨA": "比喻双方互不相干。"
  },
  {
    "STT": 397,
    "CHỮ": "D",
    "CỤM": "东家子摘，西家子借",
    "PINYIN": "dōng jiā zi zhāi, xī jiā zi jiè",
    "NGHĨA": "指四处向人伸手求借。"
  },
  {
    "STT": 398,
    "CHỮ": "D",
    "CỤM": "动了豆腐、白菜，便是开斋",
    "PINYIN": "dòng le dòu fu、bái cài, biàn shì kāi zhāi",
    "NGHĨA": "形容生活非常穷困。"
  },
  {
    "STT": 399,
    "CHỮ": "D",
    "CỤM": "懂门道",
    "PINYIN": "dǒng mén dào",
    "NGHĨA": "指掌握做事的技巧和达到目的的途径。"
  },
  {
    "STT": 400,
    "CHỮ": "D",
    "CỤM": "东庙里烧香，西庙里许愿",
    "PINYIN": "dōng miào lǐ shāo xiāng，xī miào lǐ xǔ yuàn",
    "NGHĨA": "比喻到处请客送礼,求人办事。"
  },
  {
    "STT": 401,
    "CHỮ": "D",
    "CỤM": "动脑筋",
    "PINYIN": "dòng nǎo jīn",
    "NGHĨA": "指仔细考虑问题。"
  },
  {
    "STT": 402,
    "CHỮ": "D",
    "CỤM": "东跑西钻，横搂竖扒",
    "PINYIN": "dōng pǎo xī zuān，héng lōu shù bā",
    "NGHĨA": "形容想尽办法,用尽手段。"
  },
  {
    "STT": 403,
    "CHỮ": "D",
    "CỤM": "东墙拆块砖，西墙揭片瓦",
    "PINYIN": "dōng qiáng chāi kuài zhuān，xī qiáng jiē piàn wǎ",
    "NGHĨA": "比喻为解燃眉之急而到处拼凑或挪借"
  },
  {
    "STT": 404,
    "CHỮ": "D",
    "CỤM": "东墙缺了西墙补",
    "PINYIN": "dōng qiáng quē le xī qiáng bǔ",
    "NGHĨA": "见“拆东墙补西墙”。"
  },
  {
    "STT": 405,
    "CHỮ": "D",
    "CỤM": "东山口头多似树叶",
    "PINYIN": "dōng shān kǒu tóu duō sì shù yè",
    "NGHĨA": "形容日子还很长,时间还很多。"
  },
  {
    "STT": 406,
    "CHỮ": "D",
    "CỤM": "动手脚",
    "PINYIN": "dòng shǒu jiǎo",
    "NGHĨA": "指暗中采取行动。"
  },
  {
    "STT": 407,
    "CHỮ": "D",
    "CỤM": "东手接钱西手送",
    "PINYIN": "dōng shǒu jiē qián xī shǒu sòng",
    "NGHĨA": "一只手接过来,只手送出去。指棒人转手钱财。"
  },
  {
    "STT": 408,
    "CHỮ": "D",
    "CỤM": "动手术",
    "PINYIN": "dòng shǒu shù",
    "NGHĨA": "比喻对某个机构进行体制、制度或人三平等方面的改革或对文章进行修改。"
  },
  {
    "STT": 409,
    "CHỮ": "D",
    "CỤM": "东说东有理，西说西有理",
    "PINYIN": "dōng shuō dōng yǒu lǐ, xī shuō xī yǒu lǐ",
    "NGHĨA": "见“反说反有理,正说正有理”。"
  },
  {
    "STT": 410,
    "CHỮ": "D",
    "CỤM": "东说向东，西说向西",
    "PINYIN": "dōng shuō xiàng dōng, xī shuō xiàng xī",
    "NGHĨA": "形容人没有主见,任人指使。"
  },
  {
    "STT": 411,
    "CHỮ": "D",
    "CỤM": "冻死迎风站，饿死不折腰",
    "PINYIN": "dòng sǐ yíng fēng zhàn, è sǐ bù zhé yāo",
    "NGHĨA": "形容人意志坚定、性格刚强,决不屈服。"
  },
  {
    "STT": 412,
    "CHỮ": "D",
    "CỤM": "东踢一脚，西踢一脚",
    "PINYIN": "dōng tī yī jiǎo, xī tī yī jiǎo",
    "NGHĨA": "比喻手忙脚乱、打着应付、处理各种事情。"
  },
  {
    "STT": 413,
    "CHỮ": "D",
    "CỤM": "东托人，西送礼",
    "PINYIN": "dōng tuō rén, xī sòng lǐ",
    "NGHĨA": "指到处找关系,请人帮忙。"
  },
  {
    "STT": 414,
    "CHỮ": "D",
    "CỤM": "东下来，西手去",
    "PINYIN": "dōng xià lái, xī shǒu qù",
    "NGHĨA": "见“这下来,那下去”。"
  },
  {
    "STT": 415,
    "CHỮ": "D",
    "CỤM": "动一根毫毛",
    "PINYIN": "dòng yī gēn háo máo",
    "NGHĨA": "比喻对人或事物造成轻微的损伤。"
  },
  {
    "STT": 416,
    "CHỮ": "D",
    "CỤM": "东一句，西一句",
    "PINYIN": "dōng yī jù, xī yī jù",
    "NGHĨA": "形容人说话东拉西扯,没有逻辑。"
  },
  {
    "STT": 417,
    "CHỮ": "D",
    "CỤM": "东一榔头，西一棒子",
    "PINYIN": "dōng yī láng tóu, xī yī bàng zi",
    "NGHĨA": "比喻说话东拉西扯、不着边际,或做事没有计划。"
  },
  {
    "STT": 418,
    "CHỮ": "D",
    "CỤM": "动嘴皮子",
    "PINYIN": "dòng zuǐ pí zi",
    "NGHĨA": "指只说嘴而不行动。"
  },
  {
    "STT": 419,
    "CHỮ": "D",
    "CỤM": "斗不过鸭斗鸡",
    "PINYIN": "dòu bù guò yā duì jī",
    "NGHĨA": "比喻斗不过厉害的,就来欺负软弱的。"
  },
  {
    "STT": 420,
    "CHỮ": "D",
    "CỤM": "兜不上下颏",
    "PINYIN": "dōu bù shàng xià kē",
    "NGHĨA": "形容人高兴得合不拢嘴。"
  },
  {
    "STT": 421,
    "CHỮ": "D",
    "CỤM": "斗大的字不识一升",
    "PINYIN": "dǒu dà de zì bù shí yī shēng",
    "NGHĨA": "形容人文化水平低,识字少或不识字。"
  },
  {
    "STT": 422,
    "CHỮ": "D",
    "CỤM": "豆腐拌成了肉价钱",
    "PINYIN": "dòu fu bàn chéng le ròu jià qián",
    "NGHĨA": "比喻由于某种原因,本来价值很小的商品价格一下子提高了很多。"
  },
  {
    "STT": 423,
    "CHỮ": "D",
    "CỤM": "豆腐块",
    "PINYIN": "dòu fu kuài",
    "NGHĨA": "比喻指小文章。"
  },
  {
    "STT": 424,
    "CHỮ": "D",
    "CỤM": "豆腐里挑出骨头来",
    "PINYIN": "dòu fu lǐ tiāo chū gǔ tou lái",
    "NGHĨA": "形容对人或物过分挑剔。\r\n 形容检查得特别仔细、严格。"
  },
  {
    "STT": 425,
    "CHỮ": "D",
    "CỤM": "豆腐一碗，一碗豆腐",
    "PINYIN": "dòu fu yī wǎn, yī wǎn dòu fu",
    "NGHĨA": "比喻两者一样,没有区别。"
  },
  {
    "STT": 426,
    "CHỮ": "D",
    "CỤM": "豆腐账",
    "PINYIN": "dòu fu zhàng",
    "NGHĨA": "比喻很琐碎的账目。"
  },
  {
    "STT": 427,
    "CHỮ": "D",
    "CỤM": "豆腐嘴，刀子心",
    "PINYIN": "dòu fu zuǐ, dāo zi xīn",
    "NGHĨA": "指嘴上说得动听,内心却阴险毒辣。"
  },
  {
    "STT": 428,
    "CHỮ": "D",
    "CỤM": "抖搂包袱底儿",
    "PINYIN": "dǒu lou bāo fu dǐ er",
    "NGHĨA": "比喻全部拿出来,毫无保留。"
  },
  {
    "STT": 429,
    "CHỮ": "D",
    "CỤM": "兜圈子",
    "PINYIN": "dōu quān zi",
    "NGHĨA": "见“绕圈子”。"
  },
  {
    "STT": 430,
    "CHỮ": "D",
    "CỤM": "兜头一盆冷水",
    "PINYIN": "dōu tóu yī pén lěng shuǐ",
    "NGHĨA": "比喻在正高兴、得意的时候遭到打击。"
  },
  {
    "STT": 431,
    "CHỮ": "D",
    "CỤM": "抖威风",
    "PINYIN": "dǒu wēi fēng",
    "NGHĨA": "指故意在人前显示自己不凡的气派、威势,让人敬畏。"
  },
  {
    "STT": 432,
    "CHỮ": "D",
    "CỤM": "斗闲气",
    "PINYIN": "dòu xián qì",
    "NGHĨA": "指双方在毫无意义的事情上计较、 争执。"
  },
  {
    "STT": 433,
    "CHỮ": "D",
    "CỤM": "斗心眼儿",
    "PINYIN": "dòu xīn yǎn ér",
    "NGHĨA": "指动心计、用计谋和別人较量。"
  },
  {
    "STT": 434,
    "CHỮ": "D",
    "CỤM": "兜着底儿来",
    "PINYIN": "dōu zhe dǐ er lái",
    "NGHĨA": "比喻从根上把问题彻底解决。"
  },
  {
    "STT": 435,
    "CHỮ": "D",
    "CỤM": "斗嘴皮子",
    "PINYIN": "dòu zuǐ pí zi",
    "NGHĨA": "指互相开玩笑或争论。"
  },
  {
    "STT": 436,
    "CHỮ": "D",
    "CỤM": "肚饱眼里馋",
    "PINYIN": "dù bǎo yǎn lǐ chán",
    "NGHĨA": "形容人贪吃。\r\n 形容人贪心不足。"
  },
  {
    "STT": 437,
    "CHỮ": "D",
    "CỤM": "赌风凉咒",
    "PINYIN": "dǔ fēng liáng zhòu",
    "NGHĨA": "指发一些毫无意义的毒誓。"
  },
  {
    "STT": 438,
    "CHỮ": "D",
    "CỤM": "堵后门儿",
    "PINYIN": "dǔ hòu mén ér",
    "NGHĨA": "比喻杜绝办事中的不正当途径或通融、舞弊的渠道。"
  },
  {
    "STT": 439,
    "CHỮ": "D",
    "CỤM": "堵窟窿",
    "PINYIN": "dǔ kū long",
    "NGHĨA": "见“补前降”。"
  },
  {
    "STT": 440,
    "CHỮ": "D",
    "CỤM": "肚里有什么就掏什么",
    "PINYIN": "dù lǐ yǒu shén me jiù tāo shén me",
    "NGHĨA": "形容人心直口快,性格直爽。"
  },
  {
    "STT": 441,
    "CHỮ": "D",
    "CỤM": "肚里装不下一口气",
    "PINYIN": "dù lǐ zhuāng bù xià yī kǒu qì",
    "NGHĨA": "形容人肚量狹小,忍耐不住或不能容人。"
  },
  {
    "STT": 442,
    "CHỮ": "D",
    "CỤM": "肚量大",
    "PINYIN": "dù liàng dà",
    "NGHĨA": "形容人心胸宽广,能容人和事。"
  },
  {
    "STT": 443,
    "CHỮ": "D",
    "CỤM": "堵门子",
    "PINYIN": "dǔ mén zi",
    "NGHĨA": "比喻事先放话,让人放弃向其通融的念头。"
  },
  {
    "STT": 444,
    "CHỮ": "D",
    "CỤM": "独木桥",
    "PINYIN": "dú mù qiáo",
    "NGHĨA": "一根木头的桥，形容路窄。"
  },
  {
    "STT": 445,
    "CHỮ": "D",
    "CỤM": "肚皮里存不下一句话",
    "PINYIN": "dù pí lǐ cún bù xià yī jù huà",
    "NGHĨA": "指心里藏不住事,有点儿事就想说出来。"
  },
  {
    "STT": 446,
    "CHỮ": "D",
    "CỤM": "肚皮里打鼓",
    "PINYIN": "dù pí lǐ dǎ gǔ",
    "NGHĨA": "指饿得肚子直叫。"
  },
  {
    "STT": 447,
    "CHỮ": "D",
    "CỤM": "肚皮里打官司",
    "PINYIN": "dù pí lǐ dǎ guān sī",
    "NGHĨA": "比喻有话或有意见不明说,心里暗自谋划。"
  },
  {
    "STT": 448,
    "CHỮ": "D",
    "CỤM": "毒蛇黄鳝分不清",
    "PINYIN": "dú shé huáng shàn fēn bù qīng",
    "NGHĨA": "比喻辨不清是非真假,分不清好人坏人。"
  },
  {
    "STT": 449,
    "CHỮ": "D",
    "CỤM": "毒蛇口中吐莲花",
    "PINYIN": "dú shé kǒu zhōng tǔ lián huā",
    "NGHĨA": "比喻阴险凶残的人假装善良,冒充好人。"
  },
  {
    "STT": 450,
    "CHỮ": "D",
    "CỤM": "读死书",
    "PINYIN": "dú sǐ shū",
    "NGHĨA": "指人只会死记硬背书中的知识,而不会灵活运用。"
  },
  {
    "STT": 451,
    "CHỮ": "D",
    "CỤM": "肚痛埋怨灶司",
    "PINYIN": "dù tòng mái yuàn zào sī",
    "NGHĨA": "比喻自身出了问题,却埋怨、责备他人。"
  },
  {
    "STT": 452,
    "CHỮ": "D",
    "CỤM": "堵窝掏螃蟹",
    "PINYIN": "dǔ wō tāo páng xiè",
    "NGHĨA": "比喻死守在某地,等待某人出现。"
  },
  {
    "STT": 453,
    "CHỮ": "D",
    "CỤM": "堵着耳朵摇铃铛",
    "PINYIN": "dǔ zhe ěr duo yáo líng dāng",
    "NGHĨA": "自以为别人不知道,其实事情已完全败露。比喻自己欺骗自己。"
  },
  {
    "STT": 454,
    "CHỮ": "D",
    "CỤM": "堵着窝儿要蛋",
    "PINYIN": "dǔ zhe wō ér yào dàn",
    "NGHĨA": "比喻施加压力,逼着别人作决定或想办法。"
  },
  {
    "STT": 455,
    "CHỮ": "D",
    "CỤM": "端金饭碗",
    "PINYIN": "duān jīn fàn wǎn",
    "NGHĨA": "比喻人挣钱多,生活富裕。"
  },
  {
    "STT": 456,
    "CHỮ": "D",
    "CỤM": "端老窝",
    "PINYIN": "duān lǎo wō",
    "NGHĨA": "见“抄老窝”。"
  },
  {
    "STT": 457,
    "CHỮ": "D",
    "CỤM": "端起热饭碗，连自己姓什么都忘了",
    "PINYIN": "duān qǐ rè fàn wǎn, lián zì jǐ xìng shén me dōu wàng le",
    "NGHĨA": "讽刺人得了一点儿好处就忘乎所以。"
  },
  {
    "STT": 458,
    "CHỮ": "D",
    "CỤM": "端起碗来吃肉，放下筷子骂娘",
    "PINYIN": "duān qǐ wǎn lái chī ròu, fàng xià kuài zi mà niáng",
    "NGHĨA": "指在享受过后还要发泄不满。"
  },
  {
    "STT": 459,
    "CHỮ": "D",
    "CỤM": "端起碗来照得见人影",
    "PINYIN": "duān qǐ wǎn lái zhào de jiàn rén yǐng",
    "NGHĨA": "形容饭食十分稀薄。"
  },
  {
    "STT": 460,
    "CHỮ": "D",
    "CỤM": "端铁饭碗",
    "PINYIN": "duān tiě fàn wǎn",
    "NGHĨA": "比喻从事固定职业,有稳定的收入。"
  },
  {
    "STT": 461,
    "CHỮ": "D",
    "CỤM": "断线风筝",
    "PINYIN": "duàn xiàn fēng zhēng",
    "NGHĨA": "喻指一去不返,失去联系。"
  },
  {
    "STT": 462,
    "CHỮ": "D",
    "CỤM": "断香烟",
    "PINYIN": "duàn xiāng yān",
    "NGHĨA": "指家庭中没有男孩子传宗接代。"
  },
  {
    "STT": 463,
    "CHỮ": "D",
    "CỤM": "断烟火",
    "PINYIN": "duàn yān huǒ",
    "NGHĨA": "指家里穷到没法生火做饭 \r\n 指没有子孙后代。"
  },
  {
    "STT": 464,
    "CHỮ": "D",
    "CỤM": "对不上号",
    "PINYIN": "duì bù shàng hào",
    "NGHĨA": "比喻二者不相符合或差距很大。"
  },
  {
    "STT": 465,
    "CHỮ": "D",
    "CỤM": "对痴人说梦",
    "PINYIN": "duì chī rén shuō mèng",
    "NGHĨA": "指胡言乱语。"
  },
  {
    "STT": 466,
    "CHỮ": "D",
    "CỤM": "对了一个吕字",
    "PINYIN": "duì le yī gè lǚ zì",
    "NGHĨA": "“吕”字是两个口相对。指亲了一个嘴。"
  },
  {
    "STT": 467,
    "CHỮ": "E",
    "CỤM": "饿不死也撑不着",
    "PINYIN": "è bù sǐ yě chēng bù zhuó",
    "NGHĨA": "形容收入低,仅够维持最基本的生活。"
  },
  {
    "STT": 468,
    "CHỮ": "E",
    "CỤM": "鹅蛋看不起鸭蛋",
    "PINYIN": "é dàn kàn bù qǐ yā dàn",
    "NGHĨA": "比喻资历、条件相仿的人互相轻视,互不服气。"
  },
  {
    "STT": 469,
    "CHỮ": "E",
    "CỤM": "饿肚皮",
    "PINYIN": "è dù pí",
    "NGHĨA": "指因没有食物吃而挨饿。\r\n 也作“饿肚子”。"
  },
  {
    "STT": 470,
    "CHỮ": "E",
    "CỤM": "饿狗抢骨头",
    "PINYIN": "è gǒu qiǎng gǔ tou",
    "NGHĨA": "形容速度快,行动迅猛。"
  },
  {
    "STT": 471,
    "CHỮ": "E",
    "CỤM": "饿狗闻见屎味",
    "PINYIN": "è gǒu wén jiàn shǐ wèi",
    "NGHĨA": "比喻品行不端的人得到了急需的消息。"
  },
  {
    "STT": 472,
    "CHỮ": "E",
    "CỤM": "饿虎逢羊，苍蝇见血",
    "PINYIN": "è hǔ féng yáng, cāng ying jiàn xuè",
    "NGHĨA": "像饥饿的老虎碰到了羊,嗜血的苍蝇见到了血一样。形容迫不及待的样子。"
  },
  {
    "STT": 473,
    "CHỮ": "E",
    "CỤM": "屙金子呕银子",
    "PINYIN": "ē jīn zi ǒu yín zi",
    "NGHĨA": "喂,吐。比喻凭空生财。"
  },
  {
    "STT": 474,
    "CHỮ": "E",
    "CỤM": "饿老鹰想吃天鹅肉",
    "PINYIN": "è lǎo yīng xiǎng chī tiān é ròu",
    "NGHĨA": "讽刺人痴心妄想。"
  },
  {
    "STT": 475,
    "CHỮ": "E",
    "CỤM": "屙绵花屎",
    "PINYIN": "ē mián huā shǐ",
    "NGHĨA": "比喻做事磨蹭、拖拉。"
  },
  {
    "STT": 476,
    "CHỮ": "E",
    "CỤM": "扼杀在摇篮里",
    "PINYIN": "è shā zài yáo lán lǐ",
    "NGHĨA": "比喻新生事物还未发展,就被遏制在萌芽时期。"
  },
  {
    "STT": 477,
    "CHỮ": "E",
    "CỤM": "屙屎也能捡个金元宝",
    "PINYIN": "ē shǐ yě néng jiǎn gè jīn yuán bǎo",
    "NGHĨA": "形容运气好,事事顺利。"
  },
  {
    "STT": 478,
    "CHỮ": "E",
    "CỤM": "屙屎遇上大马蜂",
    "PINYIN": "ē shǐ yù shàng dà mǎ fēng",
    "NGHĨA": "形容时运差,碰上了倒霉事。"
  },
  {
    "STT": 479,
    "CHỮ": "E",
    "CỤM": "饿死不吃嗟来食",
    "PINYIN": "è sǐ bù chī jiē lái shí",
    "NGHĨA": "形容人有骨气,宁可饿死,也不会为一口食物而丟失做坏事。"
  },
  {
    "STT": 480,
    "CHỮ": "E",
    "CỤM": "饿死嘬，撑死眼",
    "PINYIN": "è sǐ zuō, chēng sǐ yǎn",
    "NGHĨA": "见“撑死眼,饿死嘬”。"
  },
  {
    "STT": 481,
    "CHỮ": "E",
    "CỤM": "屙稀屎",
    "PINYIN": "ē xī shǐ",
    "NGHĨA": "比喻临阵退缩或反悔。"
  },
  {
    "STT": 482,
    "CHỮ": "E",
    "CỤM": "饿眼见瓜皮",
    "PINYIN": "è yǎn jiàn guā pí",
    "NGHĨA": "饿急了看见瓜皮也好吃。讽刺人因急需而不择好坏,连最差的也不嫌弃。"
  },
  {
    "STT": 483,
    "CHỮ": "E",
    "CỤM": "摁倒葫芦瓢起来",
    "PINYIN": "èn dǎo hú lú piáo qǐ lái",
    "NGHĨA": "见“按倒葫芦瓢起来”。"
  },
  {
    "STT": 484,
    "CHỮ": "E",
    "CỤM": "儿大不由娘",
    "PINYIN": "ér dà bù yóu niáng",
    "NGHĨA": "孩子大了,他们的事情不是母亲所能 -决定的。喻指某人、某事一旦成熟、他人对他就没有决定权了。"
  },
  {
    "STT": 485,
    "CHỮ": "E",
    "CỤM": "耳朵不馋，眼不花",
    "PINYIN": "ěr duo bù chán, yǎn bù huā",
    "NGHĨA": "形容老年人身体健康,没有任何衰老的迹象。"
  },
  {
    "STT": 486,
    "CHỮ": "E",
    "CỤM": "耳朵不离腮",
    "PINYIN": "ěr duo bù lí sāi",
    "NGHĨA": "比喻双方关系密切。"
  },
  {
    "STT": 487,
    "CHỮ": "E",
    "CỤM": "耳朵长",
    "PINYIN": "ěr duo cháng",
    "NGHĨA": "形容人消息灵通。"
  },
  {
    "STT": 488,
    "CHỮ": "E",
    "CỤM": "耳朵根软",
    "PINYIN": "ěr duo gēn ruǎn",
    "NGHĨA": "形容没主见,容易听信别人的话。\r\n 也作“耳朵根子缺钙”、“耳朵皮软”、“耳根子软”、“耳朵是棉花做的”。"
  },
  {
    "STT": 489,
    "CHỮ": "E",
    "CỤM": "耳朵尖",
    "PINYIN": "ěr duo jiān",
    "NGHĨA": "指人的听觉灵敏。\r\n 也作“耳朵灵”。"
  },
  {
    "STT": 490,
    "CHỮ": "E",
    "CỤM": "耳朵磨出茧子",
    "PINYIN": "ěr duo mó chū jiǎn zi",
    "NGHĨA": "茧子：手掌或脚掌的某些部位因摩擦而生成的硬皮。\r\n 形容某些话听得太多了。\r\n 也作“耳朵里起茧子”。"
  },
  {
    "STT": 491,
    "CHỮ": "E",
    "CỤM": "耳朵塞鸡毛",
    "PINYIN": "ěr duo sāi jī máo",
    "NGHĨA": "斥责人听不见或听不进别人的话。\r\n 形容人消息不灵通。\r\n 也作“耳朵里塞棉花”、“鸡毛堵着耳朵”。"
  },
  {
    "STT": 492,
    "CHỮ": "E",
    "CỤM": "耳根不得清静",
    "PINYIN": "ěr gēn bù dé qīng jìng",
    "NGHĨA": "指某人身边有人非常聒噪,喋喋不休,让人讨厌。"
  },
  {
    "STT": 493,
    "CHỮ": "E",
    "CỤM": "二两荞麦皮要榨出四两油",
    "PINYIN": "èr liǎng qiáomài pí yào zhà chū sì liǎng yóu",
    "NGHĨA": "比喻对人进行残酷的剥削、压榨。\r\n 也作“四两荞麦也要榨出二两油”。"
  },
  {
    "STT": 494,
    "CHỮ": "E",
    "CỤM": "耳目多",
    "PINYIN": "ěr mù duō",
    "NGHĨA": "指打探消息的人多。\r\n 也作“耳朵多”。"
  },
  {
    "STT": 495,
    "CHỮ": "E",
    "CỤM": "儿女情长，英雄气短",
    "PINYIN": "ér nǚ qíng cháng, yīng xióng qì duǎn",
    "NGHĨA": "指过分看重世间情爱和与人与人之间的感情,而缺乏英雄气概。\r\n 也作“英雄气短,儿女情长”。"
  },
  {
    "STT": 496,
    "CHỮ": "E",
    "CỤM": "耳热眼热",
    "PINYIN": "ěr rè yǎn rè",
    "NGHĨA": "民间认为被别人惦念或背后议论时,当事人耳朵就会发热。"
  },
  {
    "STT": 497,
    "CHỮ": "E",
    "CỤM": "二十年后又是一条好汉",
    "PINYIN": "èr shí nián hòu yòu shì yī tiáo hǎo hàn",
    "NGHĨA": "迷信认为人死后可以投胎转世,二十年后又长大成人。\r\n 常用于面临死亡威胁的场合,形容人不怕死。"
  },
  {
    "STT": 498,
    "CHỮ": "E",
    "CỤM": "二十五里骂知县",
    "PINYIN": "èr shí wǔ lǐ mà zhī xiàn",
    "NGHĨA": "指背地里逞英雄,大骂自己所惧怕的或有权势的人。\r\n 也作“十里路外骂知县”。"
  },
  {
    "STT": 499,
    "CHỮ": "E",
    "CỤM": "二桃杀三士",
    "PINYIN": "èr táo shā sān shì",
    "NGHĨA": "春秋时,公孙接、田开疆、古冶子三人侍奉齐景公,均以勇力闻;\r\n 齐相晏婴课三人之请齐景公以二桃赐予二人;论功而食,结果三人弃桃而自杀。\r\n 比喻用计谋杀人。"
  },
  {
    "STT": 500,
    "CHỮ": "E",
    "CỤM": "耳听八方，眼观六路",
    "PINYIN": "ěr tīng bā fāng, yǎn guān liù lù",
    "NGHĨA": "形容非常警觉,时刻注意周围的情况。"
  },
  {
    "STT": 501,
    "CHỮ": "E",
    "CỤM": "耳听心不听",
    "PINYIN": "ěr tīng xīn bù tīng",
    "NGHĨA": "指表面上应付,实际根本没把别人的话放在心上。"
  },
  {
    "STT": 502,
    "CHỮ": "E",
    "CỤM": "二五等于一十",
    "PINYIN": "èr wǔ děngyú yīshí",
    "NGHĨA": "指二者情况相同,没有区别。"
  },
  {
    "STT": 503,
    "CHỮ": "E",
    "CỤM": "而笑心不笑",
    "PINYIN": "ér xiào xīnbùxiào",
    "NGHĨA": "指人虽面带笑容,其实内心并不高 兴。\r\n 形容人心不在焉的样子。"
  },
  {
    "STT": 504,
    "CHỮ": "E",
    "CỤM": "二一添作五",
    "PINYIN": "èr yī tiān zuò wǔ",
    "NGHĨA": "本是珠算除法的一句口诀,意思是 1/2=0.5。\r\n 指双方平分所得或平均承担责任和任务。"
  },
  {
    "STT": 1,
    "CHỮ": "F",
    "CỤM": "发摆子",
    "PINYIN": "fā bǎi zi",
    "NGHĨA": "见“打摆子”。"
  },
  {
    "STT": 2,
    "CHỮ": "F",
    "CỤM": "发春秋大梦",
    "PINYIN": "fā chūn qiū dà mèng",
    "NGHĨA": "讽刺人痴心妄想。"
  },
  {
    "STT": 3,
    "CHỮ": "F",
    "CỤM": "发醋劲",
    "PINYIN": "fā cù jìn",
    "NGHĨA": "指因嫉妒而发怒。"
  },
  {
    "STT": 4,
    "CHỮ": "F",
    "CỤM": "发高烧",
    "PINYIN": "fā gāo shāo",
    "NGHĨA": "形容人头脑不冷静,做事不理智。"
  },
  {
    "STT": 5,
    "CHỮ": "F",
    "CỤM": "发国难财",
    "PINYIN": "fā guó nàn cái",
    "NGHĨA": "指趁国家危难之际投机倒把,为个人谋私利。"
  },
  {
    "STT": 6,
    "CHỮ": "F",
    "CỤM": "发横财",
    "PINYIN": "fā héng cái",
    "NGHĨA": "指一下子获得大量财物,暴富了。"
  },
  {
    "STT": 7,
    "CHỮ": "F",
    "CỤM": "发酒疯",
    "PINYIN": "fā jiǔ fēng",
    "NGHĨA": "指借着醉意任性胡闹,发泄。"
  },
  {
    "STT": 8,
    "CHỮ": "F",
    "CỤM": "发空头支票",
    "PINYIN": "fā kōng tóu zhī piào",
    "NGHĨA": "见“开空头支票”。"
  },
  {
    "STT": 9,
    "CHỮ": "F",
    "CỤM": "发牢骚",
    "PINYIN": "fā láo sāo",
    "NGHĨA": "指抱怨、发泄心中的不满。"
  },
  {
    "STT": 10,
    "CHỮ": "F",
    "CỤM": "发冷言",
    "PINYIN": "fā lěng yán",
    "NGHĨA": "指用冷言冷语打击人的热情或积极性。"
  },
  {
    "STT": 11,
    "CHỮ": "F",
    "CỤM": "发脾气",
    "PINYIN": "fā pí qì",
    "NGHĨA": "指因生气、不如意而吵闹或向人发火。 也作“发性子”。"
  },
  {
    "STT": 12,
    "CHỮ": "F",
    "CỤM": "发善心",
    "PINYIN": "fā shàn xīn",
    "NGHĨA": "常指坏人突然想做善事。"
  },
  {
    "STT": 13,
    "CHỮ": "F",
    "CỤM": "发神经",
    "PINYIN": "fā shén jīng",
    "NGHĨA": "指人情绪不正常,举止、行为不合常理。 也作“犯神经病”。"
  },
  {
    "STT": 14,
    "CHỮ": "F",
    "CỤM": "发通行证",
    "PINYIN": "fā tōng xíng zhèng",
    "NGHĨA": "比喻批准某人做某事或为某人做事提供方便。"
  },
  {
    "STT": 15,
    "CHỮ": "F",
    "CỤM": "发现新大陆",
    "PINYIN": "fā xiàn xīn dà lù",
    "NGHĨA": "新大陆:美洲的别称,由十五世纪航海家哥伦布最先发现。 比喻发现了新奇、有趣的事物。"
  },
  {
    "STT": 16,
    "CHỮ": "F",
    "CỤM": "发洋财",
    "PINYIN": "fā yáng cái",
    "NGHĨA": "原指与外国人做买卖赚了大量钱财。泛指获得意外钱财。"
  },
  {
    "STT": 17,
    "CHỮ": "F",
    "CỤM": "翻白眼",
    "PINYIN": "fān bái yǎn",
    "NGHĨA": "心中为难、失望、憎恨或不满时眼睛的表情。"
  },
  {
    "STT": 18,
    "CHỮ": "F",
    "CỤM": "翻不过身来",
    "PINYIN": "fān bù guò shēn lái",
    "NGHĨA": "指无法改变被压迫或被打击的悲惨处境。"
  },
  {
    "STT": 19,
    "CHỮ": "F",
    "CỤM": "翻白眼儿",
    "PINYIN": "fān bái yǎn ér",
    "NGHĨA": "黑眼珠偏斜,露出较多部分的眼白,原是病危或濒临死亡的一种症状。 常用这种表情来表示对人的蔑视、不满或厌恶。"
  },
  {
    "STT": 20,
    "CHỮ": "F",
    "CỤM": "翻不透账码",
    "PINYIN": "fān bù tòu zhàng mǎ",
    "NGHĨA": "比喻怎么也想不明白。"
  },
  {
    "STT": 21,
    "CHỮ": "F",
    "CỤM": "犯痴病",
    "PINYIN": "fàn chī bìng",
    "NGHĨA": "犯傻。指发呆或做傻事。"
  },
  {
    "STT": 22,
    "CHỮ": "F",
    "CỤM": "翻的肚衬衫",
    "PINYIN": "fān de dù chèn shān",
    "NGHĨA": "山西方言话“不要翻别人屋里的肚衬衫”演化而来。指揭露别人的隐私。"
  },
  {
    "STT": 23,
    "CHỮ": "F",
    "CỤM": "犯嘀咕",
    "PINYIN": "fàn dí gu",
    "NGHĨA": "指心中产生疑问或感到不踏实。"
  },
  {
    "STT": 24,
    "CHỮ": "F",
    "CỤM": "饭店门口摆粥摊",
    "PINYIN": "fàn diàn mén kǒu bǎi zhōu tān",
    "NGHĨA": "比喻在行家面前卖弄。"
  },
  {
    "STT": 25,
    "CHỮ": "F",
    "CỤM": "翻跟头",
    "PINYIN": "fān gēn tou",
    "NGHĨA": "原指身体向下翻转后恢复原状。比喻遭受失败或挫折。 也作“翻斤斗”、“翻筋头”。"
  },
  {
    "STT": 26,
    "CHỮ": "F",
    "CỤM": "犯急性病",
    "PINYIN": "fàn jí xìng bìng",
    "NGHĨA": "指做事不顾客观实际,急于求成。 也作“害急性病”。"
  },
  {
    "STT": 27,
    "CHỮ": "F",
    "CỤM": "犯口舌",
    "PINYIN": "fàn kǒu shé",
    "NGHĨA": "指发生口角。 也作“犯口角”。"
  },
  {
    "STT": 28,
    "CHỮ": "F",
    "CỤM": "翻苦水",
    "PINYIN": "fān kǔ shuǐ",
    "NGHĨA": "指回忆过去的悲惨生活。"
  },
  {
    "STT": 29,
    "CHỮ": "F",
    "CỤM": "翻来葫芦倒去瓢",
    "PINYIN": "fān lái hú lú dǎo qù piáo",
    "NGHĨA": "瓢由葫芦做成。指说来说去都是一回事。"
  },
  {
    "STT": 30,
    "CHỮ": "F",
    "CỤM": "饭来张口，茶来伸手",
    "PINYIN": "fàn lái zhāng kǒu, chá lái shēn shǒu",
    "NGHĨA": "见“衣来伸手,饭来张口”。"
  },
  {
    "STT": 31,
    "CHỮ": "F",
    "CỤM": "翻烙饼",
    "PINYIN": "fān lào bǐng",
    "NGHĨA": "比喻购买后快速转手倒卖。 比喻工作反复,毫无进展。 比喻翻来覆去,无法入睡。 也作“翻烧饼”。"
  },
  {
    "STT": 32,
    "CHỮ": "F",
    "CỤM": "翻老底",
    "PINYIN": "fān lǎo dǐ",
    "NGHĨA": "指把已经过去的事拿出来重提。"
  },
  {
    "STT": 33,
    "CHỮ": "F",
    "CỤM": "翻老皇历",
    "PINYIN": "fān lǎo huáng lì",
    "NGHĨA": "皇历:历书。比喻重提陈年旧事。 比喻按过时的老规矩、老办法办事。也作“搬老皇历”。"
  },
  {
    "STT": 34,
    "CHỮ": "F",
    "CỤM": "翻老婆舌",
    "PINYIN": "fān lǎo pó shé",
    "NGHĨA": "指在背地里传闲话。"
  },
  {
    "STT": 35,
    "CHỮ": "F",
    "CỤM": "翻老账",
    "PINYIN": "fān lǎo zhàng",
    "NGHĨA": "老账:旧账。 比喻重提令人不愉快的事或重新追究以往的责任与过错。 也作“翻陈账”、“翻旧账”。"
  },
  {
    "STT": 36,
    "CHỮ": "F",
    "CỤM": "反了天",
    "PINYIN": "fǎn le tiān",
    "NGHĨA": "斥责人行为放肆,胆大妄为。"
  },
  {
    "STT": 37,
    "CHỮ": "F",
    "CỤM": "犯冷热病",
    "PINYIN": "fàn lěng rè bìng",
    "NGHĨA": "指工作态度忽冷忽热,不能始终如一。"
  },
  {
    "STT": 38,
    "CHỮ": "F",
    "CỤM": "翻脸不认人",
    "PINYIN": "fān liǎn bù rèn rén",
    "NGHĨA": "翻:掉转。 指态度突然变坏,做事不管交情,不讲情面。 也作“反脸不认人”、“转过脸就不认得人”。"
  },
  {
    "STT": 39,
    "CHỮ": "F",
    "CỤM": "翻脸不认账",
    "PINYIN": "fān liǎn bù rèn zhàng",
    "NGHĨA": "指态度突然转变,拒不承认自己已经做过的事或说过的话(多为过错)。"
  },
  {
    "STT": 40,
    "CHỮ": "F",
    "CỤM": "犯牛脖子",
    "PINYIN": "fàn niú bó zi",
    "NGHĨA": "见“发牛脾气”。"
  },
  {
    "STT": 41,
    "CHỮ": "F",
    "CỤM": "犯牛脾气",
    "PINYIN": "fàn niú pí qì",
    "NGHĨA": "比喻人的脾气很倔强，固执己见。"
  },
  {
    "STT": 42,
    "CHỮ": "F",
    "CỤM": "饭瓢子过河",
    "PINYIN": "fàn piáo zi guò hé",
    "NGHĨA": "饭甑子在河中会顺水漂走。比喻到头来一无所获。"
  },
  {
    "STT": 43,
    "CHỮ": "F",
    "CỤM": "犯神经病",
    "PINYIN": "fàn shén jīng bìng",
    "NGHĨA": "见“发神经”。"
  },
  {
    "STT": 44,
    "CHỮ": "F",
    "CỤM": "翻手为云，覆手为雨",
    "PINYIN": "fān shǒu wéi yún, fù shǒu wéi yǔ",
    "NGHĨA": "比喻人反复无常。 比喻人善于玩弄权术。 也作“翻手是雨,合手是云”、“翻手为云覆手雨”、“翻手作云覆手雨”。"
  },
  {
    "STT": 45,
    "CHỮ": "F",
    "CỤM": "反说反有理，正说正有理",
    "PINYIN": "fǎn shuō fǎn yǒu lǐ, zhèng shuō zhèng yǒu lǐ",
    "NGHĨA": "指无理狡辩,怎么说都显占理。 也作“东说东有理,西说西有理”。"
  },
  {
    "STT": 46,
    "CHỮ": "F",
    "CỤM": "犯通病",
    "PINYIN": "fàn tōng bìng",
    "NGHĨA": "指与大多数人一样,犯同样的错误。"
  },
  {
    "STT": 47,
    "CHỮ": "F",
    "CỤM": "饭碗里撒沙",
    "PINYIN": "fàn wǎn lǐ sā shā",
    "NGHĨA": "比喻暗中搞破坏。"
  },
  {
    "STT": 48,
    "CHỮ": "F",
    "CỤM": "翻小话",
    "PINYIN": "fān xiǎo huà",
    "NGHĨA": "指在背地里传一些鸡毛蒜皮的小事。"
  },
  {
    "STT": 49,
    "CHỮ": "F",
    "CỤM": "犯小性",
    "PINYIN": "fàn xiǎo xìng",
    "NGHĨA": "指为小事而发脾气、使性子。"
  },
  {
    "STT": 50,
    "CHỮ": "F",
    "CỤM": "犯眼馋",
    "PINYIN": "fàn yǎn chán",
    "NGHĨA": "指羡慕、嫉妒别人。"
  },
  {
    "STT": 51,
    "CHỮ": "F",
    "CỤM": "反咬一口",
    "PINYIN": "fǎn yǎo yī kǒu",
    "NGHĨA": "比喻自己做了错事,坏事不悔改,还反过来诬赖他人。 也作“倒咬一口”。"
  },
  {
    "STT": 52,
    "CHỮ": "F",
    "CỤM": "犯夜的倒穿巡夜的",
    "PINYIN": "fàn yè de dào chuān xún yè de",
    "NGHĨA": "犯夜:指夜间犯禁,干坏事。巡夜:指夜间巡逻。 比喻干坏事的人反过来诬陷对其检举揭发的人。"
  },
  {
    "STT": 53,
    "CHỮ": "F",
    "CỤM": "反一遍，正一遍",
    "PINYIN": "fǎn yī biàn, zhèng yī biàn",
    "NGHĨA": "指不断重复同样的事情。"
  },
  {
    "STT": 54,
    "CHỮ": "F",
    "CỤM": "犯疑心",
    "PINYIN": "fàn yí xīn",
    "NGHĨA": "指对人或事产生怀疑。 也作“犯疑影”。"
  },
  {
    "STT": 55,
    "CHỮ": "F",
    "CỤM": "放暗箭",
    "PINYIN": "fàng àn jiàn",
    "NGHĨA": "乘人不备，暗中射箭。比喻暗地里施展害人的 手段。也说“射冷箭”、“放冷箭”。"
  },
  {
    "STT": 56,
    "CHỮ": "F",
    "CỤM": "放白鸽",
    "PINYIN": "fàng bái gē",
    "NGHĨA": "一种敲诈勒索行为。让已婚女人先去勾引其他男人,然后丈夫出现,对他人进行敲诈勒索。"
  },
  {
    "STT": 57,
    "CHỮ": "F",
    "CỤM": "放长线",
    "PINYIN": "fàng cháng xiàn",
    "NGHĨA": "比喻做长远打算。 也作“拉长线”。"
  },
  {
    "STT": 58,
    "CHỮ": "F",
    "CỤM": "放大炮",
    "PINYIN": "fàng dà pào",
    "NGHĨA": "比喻说大话。 比喻发表激烈的言词批评或指责人。"
  },
  {
    "STT": 59,
    "CHỮ": "F",
    "CỤM": "放担子",
    "PINYIN": "fàng dàn zi",
    "NGHĨA": "比喻放下担负的职责、任务。"
  },
  {
    "STT": 60,
    "CHỮ": "F",
    "CỤM": "方的的来圆的",
    "PINYIN": "fāng de de lái yuán de",
    "NGHĨA": "指灵活变换做事的方武和手段。"
  },
  {
    "STT": 61,
    "CHỮ": "F",
    "CỤM": "放第一炮",
    "PINYIN": "fàng dì yī pào",
    "NGHĨA": "比喻第一个发言。 也作“放头炮”。"
  },
  {
    "STT": 62,
    "CHỮ": "F",
    "CỤM": "放掉偷金的，捉打偷针的",
    "PINYIN": "fàng diào tōu jīn de, zhuō dǎ tōu zhēn de",
    "NGHĨA": "比喻放掉了主犯、要犯,却抓住犯小错误的人严惩。"
  },
  {
    "STT": 63,
    "CHỮ": "F",
    "CỤM": "放个屁都是香的",
    "PINYIN": "fàng ge pì dōu shì xiāng de",
    "NGHĨA": "说到有些人对某人盲目崇拜、巴结。也作“放个屁都拿来当枪扛”、“闻着屁也是香的”。"
  },
  {
    "STT": 64,
    "CHỮ": "F",
    "CỤM": "放个屁也要卜一课",
    "PINYIN": "fàng ge pì yě yào bǔ yī kè",
    "NGHĨA": "占卜。讽刺人相信迷信,不管做什么事都要先占卜。"
  },
  {
    "STT": 65,
    "CHỮ": "F",
    "CỤM": "放个屁也有人管",
    "PINYIN": "fàng ge pì yě yǒu rén guǎn",
    "NGHĨA": "形容被管束得很死,没有一点自由。"
  },
  {
    "STT": 66,
    "CHỮ": "F",
    "CỤM": "放个屁，就知道要拉啥屎",
    "PINYIN": "fàng ge pì, jiù zhī dào yào lā shá shǐ",
    "NGHĨA": "形容对某人非常熟悉和了解。"
  },
  {
    "STT": 67,
    "CHỮ": "F",
    "CỤM": "放隔山炮",
    "PINYIN": "fàng gé shān pào",
    "NGHĨA": "比喻不直接出面攻击,而是间接抨击对方。"
  },
  {
    "STT": 68,
    "CHỮ": "F",
    "CỤM": "放狗屁",
    "PINYIN": "fàng gǒupì",
    "NGHĨA": "斥责人说话不讲道理或歪曲事实。也作“放臭狗屁”、“放顶门屁”。"
  },
  {
    "STT": 69,
    "CHỮ": "F",
    "CỤM": "放火白烧身",
    "PINYIN": "fàng huǒ bái shāo shēn",
    "NGHĨA": "比喻本想害别人,谁知害人不成反害己。"
  },
  {
    "STT": 70,
    "CHỮ": "F",
    "CỤM": "放近路不走，偏要绕远",
    "PINYIN": "fàng jìn lù bù zǒu, piān yào rào yuǎn",
    "NGHĨA": "比喻有现成的条件不利用,偏去另找门路。"
  },
  {
    "STT": 71,
    "CHỮ": "F",
    "CỤM": "放开脸皮",
    "PINYIN": "fàng kāi liǎn pí",
    "NGHĨA": "指做事不怕难为情。"
  },
  {
    "STT": 72,
    "CHỮ": "F",
    "CỤM": "放开手脚",
    "PINYIN": "fàng kāi shǒu jiǎo",
    "NGHĨA": "比喻摆脱各种束缚去做事。"
  },
  {
    "STT": 73,
    "CHỮ": "F",
    "CỤM": "放空炮",
    "PINYIN": "fàng kōng pào",
    "NGHĨA": "比喻说内容空洞或不能实现的话。"
  },
  {
    "STT": 74,
    "CHỮ": "F",
    "CỤM": "放口风",
    "PINYIN": "fàng kǒufēng",
    "NGHĨA": "指故意把某种消息透露出去。也作“放风声”。"
  },
  {
    "STT": 75,
    "CHỮ": "F",
    "CỤM": "放了屁儿使千掩",
    "PINYIN": "fàng le pìr shǐ qiān yǎn",
    "NGHĨA": "见“屁出了掩臀”。"
  },
  {
    "STT": 76,
    "CHỮ": "F",
    "CỤM": "放冷风",
    "PINYIN": "fàng lěng fēng",
    "NGHĨA": "见“吹冷风”。"
  },
  {
    "STT": 77,
    "CHỮ": "F",
    "CỤM": "放了屁儿，却使千掩",
    "PINYIN": "fàng le pìr, què shǐ qiān yǎn",
    "NGHĨA": "见“屁出了掩臀”。"
  },
  {
    "STT": 78,
    "CHỮ": "F",
    "CỤM": "放冷箭",
    "PINYIN": "fàng lěng jiàn",
    "NGHĨA": "原指趁人不备暗放一箭。比喻用言语或行为暗中伤人。 也作“射冷箭”。"
  },
  {
    "STT": 79,
    "CHỮ": "F",
    "CỤM": "放冷炮",
    "PINYIN": "fàng lěng pào",
    "NGHĨA": "比喻说话或做事出人意料。"
  },
  {
    "STT": 80,
    "CHỮ": "F",
    "CỤM": "放冷枪",
    "PINYIN": "fàng lěng qiāng",
    "NGHĨA": "比喻说冷言冷语打击别人。"
  },
  {
    "STT": 81,
    "CHỮ": "F",
    "CỤM": "方离狼窝，又逢虎口",
    "PINYIN": "fāng lí láng wō, yòu féng hǔ kǒu",
    "NGHĨA": "喻指刚逃离一处险境,又陷入另一危险当中。"
  },
  {
    "STT": 82,
    "CHỮ": "F",
    "CỤM": "放连珠炮",
    "PINYIN": "fàng lián zhū pào",
    "NGHĨA": "形容说话话中音急促而不晰。"
  },
  {
    "STT": 83,
    "CHỮ": "F",
    "CỤM": "放马后炮",
    "PINYIN": "fàng mǎ hòu pào",
    "NGHĨA": "马后炮:象棋术语,比喻不及时的行动。 比喻事过之后才出主意或采取行动。"
  },
  {
    "STT": 84,
    "CHỮ": "F",
    "CỤM": "放屁都不会放个响的",
    "PINYIN": "fàng pì dōu bù huì fàng gè xiǎng de",
    "NGHĨA": "讽刺人不会说话或说话说不到点上。"
  },
  {
    "STT": 85,
    "CHỮ": "F",
    "CỤM": "放屁怕闪了腰",
    "PINYIN": "fàng pì pà shǎn le yāo",
    "NGHĨA": "闪:指因动作过猛,使身体肌肉受伤而疼痛。 形容人太娇气,干活时不堪出一点儿力气。"
  },
  {
    "STT": 86,
    "CHỮ": "F",
    "CỤM": "放屁咬牙，拉屎攒拳头",
    "PINYIN": "fàng pì yǎo yá, lā shǐ zǎn quán tou",
    "NGHĨA": "捏紧。形容人心狠手辣。"
  },
  {
    "STT": 87,
    "CHỮ": "F",
    "CỤM": "放屁也怕砸了脚后跟",
    "PINYIN": "fàng pì yě pà zá le jiǎo hòu gēn",
    "NGHĨA": "讽刺人过于小心谨慎。"
  },
  {
    "STT": 88,
    "CHỮ": "F",
    "CỤM": "放屁砸了脚后跟",
    "PINYIN": "fàng pì zá le jiǎo hòu gēn",
    "NGHĨA": "形容运气差到极点,做什么都不顺。"
  },
  {
    "STT": 89,
    "CHỮ": "F",
    "CỤM": "放水火",
    "PINYIN": "fàng shuǐ huǒ",
    "NGHĨA": "指监狱中放犯人去大小便。"
  },
  {
    "STT": 90,
    "CHỮ": "F",
    "CỤM": "放秃尾巴鹰",
    "PINYIN": "fàng tū wěi ba yīng",
    "NGHĨA": "比喻东西放出去却收不回来。"
  },
  {
    "STT": 91,
    "CHỮ": "F",
    "CỤM": "放完了始口不要和尚",
    "PINYIN": "fàng wán le shǐ kǒu bù yào hé shang",
    "NGHĨA": "比喻东西放出去却收不回来。"
  },
  {
    "STT": 92,
    "CHỮ": "F",
    "CỤM": "放卫星",
    "PINYIN": "fàng wèi xīng",
    "NGHĨA": "卫星:指人造卫星。比喻突出的成绩、成就。比喻创造出惊人的、突出的成绩。"
  },
  {
    "STT": 93,
    "CHỮ": "F",
    "CỤM": "房无一间，地无一垄",
    "PINYIN": "fáng wú yī jiān, dì wú yī lǒng",
    "NGHĨA": "见“地无一垄,房无一间”。"
  },
  {
    "STT": 94,
    "CHỮ": "F",
    "CỤM": "放下包袱",
    "PINYIN": "fàng xià bāo fu",
    "NGHĨA": "包袱:用布包起来的包儿。 比喻影响思想或行动的负担。比喻解除影响思想或行动的负担和顾虑。"
  },
  {
    "STT": 95,
    "CHỮ": "F",
    "CỤM": "放下架子",
    "PINYIN": "fàng xià jià zi",
    "NGHĨA": "比喻去掉自高自大、装腔作势的作风。"
  },
  {
    "STT": 96,
    "CHỮ": "F",
    "CỤM": "放下耙儿扫帚",
    "PINYIN": "fàng xià pá er sào zhǒu",
    "NGHĨA": "形容家务繁忙。形容人勤快。也作“丢下饭碗就拿扫帚”。"
  },
  {
    "STT": 97,
    "CHỮ": "F",
    "CỤM": "放瞎炮",
    "PINYIN": "fàng xiā pào",
    "NGHĨA": "比喻人说话没有针对性,说不到点子上。"
  },
  {
    "STT": 98,
    "CHỮ": "F",
    "CỤM": "放邪火",
    "PINYIN": "fàng xié huǒ",
    "NGHĨA": "比喻不怀好意地从旁挑拨、怂恿别人。也作“点邪火”。"
  },
  {
    "STT": 99,
    "CHỮ": "F",
    "CỤM": "放鸭子",
    "PINYIN": "fàng yā zi",
    "NGHĨA": "比喻对人不管束,任其自然发展。"
  },
  {
    "STT": 100,
    "CHỮ": "F",
    "CỤM": "放烟幕弹",
    "PINYIN": "fàng yān mù dàn",
    "NGHĨA": "烟幕弹:爆炸时可以形成烟幕的炮弹或炸弹。比喻制造某种舆论或假相来掩盖真相,蒙蔽他人。也作“放烟雾”。"
  },
  {
    "STT": 101,
    "CHỮ": "F",
    "CỤM": "放阎王债",
    "PINYIN": "fàng yán wáng zhài",
    "NGHĨA": "比喻放高利贷进行盘剥。"
  },
  {
    "STT": 102,
    "CHỮ": "F",
    "CỤM": "放野火",
    "PINYIN": "fàng yě huǒ",
    "NGHĨA": "比喻恶意造谣生事,进行破坏活动。"
  },
  {
    "STT": 103,
    "CHỮ": "F",
    "CỤM": "放野马",
    "PINYIN": "fàng yě mǎ",
    "NGHĨA": "比喻不管束,任其胡闹。"
  },
  {
    "STT": 104,
    "CHỮ": "F",
    "CỤM": "放一百二十个心",
    "PINYIN": "fàng yī bǎi èr shí gè xīn",
    "NGHĨA": "指完全可以放心,不用有任何的顾虑和担忧。"
  },
  {
    "STT": 105,
    "CHỮ": "F",
    "CỤM": "放一个屁都会晓得",
    "PINYIN": "fàng yī gè pì dōu huì xiǎo de",
    "NGHĨA": "形容消息传得很快。"
  },
  {
    "STT": 106,
    "CHỮ": "F",
    "CỤM": "放在脑后",
    "PINYIN": "fàng zài nǎo hòu",
    "NGHĨA": "见“抛在脑后”。"
  },
  {
    "STT": 107,
    "CHỮ": "F",
    "CỤM": "放在手里怕热着，放在地下怕吓着",
    "PINYIN": "fàng zài shǒu lǐ pà rè zhe, fàng zài dì xià pà xià zhe",
    "NGHĨA": "形容对人或物非常爱惜。也作“放在地上怕湿了,放在手上怕跌了”。"
  },
  {
    "STT": 108,
    "CHỮ": "F",
    "CỤM": "放在眼里",
    "PINYIN": "fàng zài yǎn lǐ",
    "NGHĨA": "指非常看重某人或某物。"
  },
  {
    "STT": 109,
    "CHỮ": "F",
    "CỤM": "废物点心",
    "PINYIN": "fèi wù diǎn xīn",
    "NGHĨA": "比喻无能、不会办事的人。"
  },
  {
    "STT": 110,
    "CHỮ": "F",
    "CỤM": "费周折",
    "PINYIN": "fèi zhōu zhé",
    "NGHĨA": "指费力，事情办理的过程不顺利。"
  },
  {
    "STT": 111,
    "CHỮ": "F",
    "CỤM": "付东流",
    "PINYIN": "fù dōng liú",
    "NGHĨA": "喻指原先拥有的东西没有了。喻指作出的努力毫无作用。"
  },
  {
    "STT": 112,
    "CHỮ": "F",
    "CỤM": "赴黄泉",
    "PINYIN": "fù huáng quán",
    "NGHĨA": "比喻走向死亡。"
  },
  {
    "STT": 113,
    "CHỮ": "F",
    "CỤM": "父母之命,媒妁之言。",
    "PINYIN": "fù mǔ zhī mìng, méi shuò zhī yán",
    "NGHĨA": "父母的命令,媒人的介绍。指旧时婚 姻由媒人介绍,父母包办。"
  },
  {
    "STT": 114,
    "CHỮ": "F",
    "CỤM": "服软不服硬",
    "PINYIN": "fú ruǎn bù fú yìng",
    "NGHĨA": "见“吃软不吃硬”。"
  },
  {
    "STT": 115,
    "CHỮ": "F",
    "CỤM": "浮上水",
    "PINYIN": "fú shàng shuǐ",
    "NGHĨA": "见“凫上水”。"
  },
  {
    "STT": 116,
    "CHỮ": "F",
    "CỤM": "斧头打钉钉入木",
    "PINYIN": "fǔ tóu dǎ dìng dīng rù mù",
    "NGHĨA": "斧子敲打钉子,钉子插进木头里。比 喻一级一级向下压。"
  },
  {
    "STT": 117,
    "CHỮ": "F",
    "CỤM": "负心郎",
    "PINYIN": "fù xīn láng",
    "NGHĨA": "玩弄爱情、抛弃痴心女子的男人。"
  },
  {
    "STT": 118,
    "CHỮ": "F",
    "CỤM": "付学费",
    "PINYIN": "fù xué fèi",
    "NGHĨA": "见“交学费”。"
  },
  {
    "STT": 119,
    "CHỮ": "F",
    "CỤM": "扶一把",
    "PINYIN": "fú yī bǎ",
    "NGHĨA": "指在困难或危难时刻给予支持和 帮助。"
  },
  {
    "STT": 120,
    "CHỮ": "F",
    "CỤM": "父一辈子一辈",
    "PINYIN": "fù yī bèi zǐ yī bèi",
    "NGHĨA": "指好几代人。"
  },
  {
    "STT": 121,
    "CHỮ": "G",
    "CỤM": "干打雷不下雨",
    "PINYIN": "gān dǎ léi bù xià yǔ",
    "NGHĨA": "比喻光说不动。"
  },
  {
    "STT": 122,
    "CHỮ": "G",
    "CỤM": "干瞪眼",
    "PINYIN": "gān dèng yǎn",
    "NGHĨA": "在一旁着急而又无能为力。"
  },
  {
    "STT": 123,
    "CHỮ": "G",
    "CỤM": "赶鸭子上架",
    "PINYIN": "gǎn yā zi shàng jià",
    "NGHĨA": "比喻去做力不从心的事情。"
  },
  {
    "STT": 124,
    "CHỮ": "G",
    "CỤM": "告黑状",
    "PINYIN": "gào hēi zhuàng",
    "NGHĨA": "歪曲或捏造事实向权力或检查机构控告别人。也指偷偷在上级面前诬告别人或说别人的坏话。"
  },
  {
    "STT": 125,
    "CHỮ": "G",
    "CỤM": "跟风",
    "PINYIN": "gēn fēng",
    "NGHĨA": "追随某种风气或潮流。"
  },
  {
    "STT": 126,
    "CHỮ": "G",
    "CỤM": "跟屁虫",
    "PINYIN": "gēn pì chóng",
    "NGHĨA": "比喻总是跟在人身后的人，多指孩子。"
  },
  {
    "STT": 127,
    "CHỮ": "G",
    "CỤM": "狗头军师",
    "PINYIN": "gǒu tóu jūn shī",
    "NGHĨA": "指给别人出坏主意的人。"
  },
  {
    "STT": 128,
    "CHỮ": "G",
    "CỤM": "狗腿子",
    "PINYIN": "gǒu tuǐ zi",
    "NGHĨA": "指为主子跑腿办事的人。"
  },
  {
    "STT": 129,
    "CHỮ": "G",
    "CỤM": "購上不瞒下",
    "PINYIN": "gòu shàng bù mán xià",
    "NGHĨA": "指瞒哄上面的人,不隐瞒下面的人。"
  },
  {
    "STT": 130,
    "CHỮ": "G",
    "CỤM": "刮地皮",
    "PINYIN": "guā dì pí",
    "NGHĨA": "比喻做官的人搜刮民财。"
  },
  {
    "STT": 131,
    "CHỮ": "G",
    "CỤM": "挂羊头卖狗肉",
    "PINYIN": "guà yáng tóu mài gǒu ròu",
    "NGHĨA": "比喻骗人的买卖。"
  },
  {
    "STT": 132,
    "CHỮ": "G",
    "CỤM": "灌米汤",
    "PINYIN": "guàn mǐ tāng",
    "NGHĨA": "比喻用甜言蜜语奉承人迷惑人。"
  },
  {
    "STT": 133,
    "CHỮ": "G",
    "CỤM": "鬼把戏",
    "PINYIN": "guǐ bǎ xì",
    "NGHĨA": "阴险的手段或计策。"
  },
  {
    "STT": 134,
    "CHỮ": "G",
    "CỤM": "鬼点子",
    "PINYIN": "guǐ diǎn zi",
    "NGHĨA": "比喻坏主意。也可比喻出人意料的好点子。"
  },
  {
    "STT": 135,
    "CHỮ": "G",
    "CỤM": "鬼门关",
    "PINYIN": "guǐ mén guān",
    "NGHĨA": "迷信传说中的阴阳交界的关口，比喻凶险的地方。"
  },
  {
    "STT": 136,
    "CHỮ": "G",
    "CỤM": "滚刀肉",
    "PINYIN": "gǔn dāo ròu",
    "NGHĨA": "死皮赖脸、很难打发的人。"
  },
  {
    "STT": 137,
    "CHỮ": "G",
    "CỤM": "锅不动，瓢不响",
    "PINYIN": "guō bù dòng, piáo bù xiǎng",
    "NGHĨA": "没有粮食,不能开锅做饭。形容家庭非常穷困。"
  },
  {
    "STT": 138,
    "CHỮ": "G",
    "CỤM": "锅里吃，锅里屙",
    "PINYIN": "guō lǐ chī, guō lǐ ē",
    "NGHĨA": "比喻在自己生活的地方横行霸道或搞破坏。"
  },
  {
    "STT": 139,
    "CHỮ": "G",
    "CỤM": "过独木桥",
    "PINYIN": "guò dú mù qiáo",
    "NGHĨA": "比喻通过艰难的途径。"
  },
  {
    "STT": 140,
    "CHỮ": "G",
    "CỤM": "过鬼门关",
    "PINYIN": "guò guǐ mén guān",
    "NGHĨA": "比喻凶险的地方。指经历磨难或艰险。"
  },
  {
    "STT": 141,
    "CHỮ": "H",
    "CỤM": "哈巴狗",
    "PINYIN": "hǎ ba gǒu",
    "NGHĨA": "指点头哈腰、溜须拍马的人。"
  },
  {
    "STT": 142,
    "CHỮ": "H",
    "CỤM": "喝倒彩",
    "PINYIN": "hè dào cǎi",
    "NGHĨA": "看到别人失误时起哄。"
  },
  {
    "STT": 143,
    "CHỮ": "H",
    "CỤM": "喝黄汤",
    "PINYIN": "hē huáng tāng",
    "NGHĨA": "泛指饮酒，黄汤指黄酒。"
  },
  {
    "STT": 144,
    "CHỮ": "H",
    "CỤM": "和事佬",
    "PINYIN": "hé shì lǎo",
    "NGHĨA": "指调停争端的人，特指无原则地进行调解的人。"
  },
  {
    "STT": 145,
    "CHỮ": "H",
    "CỤM": "黑社会",
    "PINYIN": "hēi shè huì",
    "NGHĨA": "从事非法活动( 如走私、贩毒、赌博等) 的场所或组织。"
  },
  {
    "STT": 146,
    "CHỮ": "H",
    "CỤM": "黑心肠",
    "PINYIN": "hēi xīn cháng",
    "NGHĨA": "比喻用心阴险毒辣。也说“黑心肝”。"
  },
  {
    "STT": 147,
    "CHỮ": "H",
    "CỤM": "恨铁不成钢",
    "PINYIN": "hèn tiě bù chéng gāng",
    "NGHĨA": "比喻对人要求严格，希望他更好。"
  },
  {
    "STT": 148,
    "CHỮ": "H",
    "CỤM": "鸿门宴",
    "PINYIN": "hóng mén yàn",
    "NGHĨA": "喻指加害客人的宴会。"
  },
  {
    "STT": 149,
    "CHỮ": "H",
    "CỤM": "红眼病",
    "PINYIN": "hóng yǎn bìng",
    "NGHĨA": "严重嫉妒的情绪。"
  },
  {
    "STT": 150,
    "CHỮ": "H",
    "CỤM": "后遗症",
    "PINYIN": "hòu yí zhèng",
    "NGHĨA": "受伤后遗留病症，常指处理不干净，留麻烦。"
  },
  {
    "STT": 151,
    "CHỮ": "H",
    "CỤM": "狐狸精",
    "PINYIN": "hú lí jīng",
    "NGHĨA": "传说中狐狸变成的精灵，极其狡猾，善于迷惑人。比喻诡计多端，极其狡猾的人， 也说“老狐狸”。也比喻作风轻浮、善于用迷惑手段勾引人的女人，特指勾引、迷惑 男子的女人。"
  },
  {
    "STT": 152,
    "CHỮ": "H",
    "CỤM": "花花肠子",
    "PINYIN": "huā hua cháng zi",
    "NGHĨA": "比喻淫邪的念头或坏主意。"
  },
  {
    "STT": 153,
    "CHỮ": "H",
    "CỤM": "花架子",
    "PINYIN": "huā jià zi",
    "NGHĨA": "指只能在舞台上耍的一种架势，看起来虽然很美，但真的打起来却没有什么用处。 比喻表面上好看、而实际上无用的事物或人。"
  },
  {
    "STT": 154,
    "CHỮ": "H",
    "CỤM": "怀鬼胎",
    "PINYIN": "huái guǐ tāi",
    "NGHĨA": "有坏心思。"
  },
  {
    "STT": 155,
    "CHỮ": "H",
    "CỤM": "黄昏恋",
    "PINYIN": "huáng hūn liàn",
    "NGHĨA": "比喻丧偶或离异的老人再次恋爱。含褒义。"
  },
  {
    "STT": 156,
    "CHỮ": "H",
    "CỤM": "黄粱梦",
    "PINYIN": "huáng liáng mèng",
    "NGHĨA": "比喻想实现的好事落空或幻想破灭。"
  },
  {
    "STT": 157,
    "CHỮ": "H",
    "CỤM": "黄毛丫头",
    "PINYIN": "huáng máo yā tou",
    "NGHĨA": "指年幼的女孩子。含戏谑或轻侮意。"
  },
  {
    "STT": 158,
    "CHỮ": "H",
    "CỤM": "混世魔王",
    "PINYIN": "hùn shì mó wáng",
    "NGHĨA": "魔王的一种，比喻什么都不怕的人。"
  },
  {
    "STT": 159,
    "CHỮ": "H",
    "CỤM": "活不见人，死不见尸",
    "PINYIN": "huó bù jiàn rén, sǐ bù jiàn shī",
    "NGHĨA": "见“生不见人,死不见尸”。"
  },
  {
    "STT": 160,
    "CHỮ": "H",
    "CỤM": "活打嘴",
    "PINYIN": "huó dǎ zuǐ",
    "NGHĨA": "指刚夸下口,当场就出了丑。指做了有违自己身份的事而出了丑。"
  },
  {
    "STT": 161,
    "CHỮ": "H",
    "CỤM": "活得不耐烦",
    "PINYIN": "huó dé bù nài fán",
    "NGHĨA": "斥责人自己找死、惹祸。\r\n\r\n也作“活腻味”。"
  },
  {
    "STT": 162,
    "CHỮ": "H",
    "CỤM": "活的能说死,死的能说活",
    "PINYIN": "huó de néng shuō sǐ, sǐ de néng shuō huó",
    "NGHĨA": "形容人嘴巴灵活,善于狡辩。"
  },
  {
    "STT": 163,
    "CHỮ": "H",
    "CỤM": "活见鬼",
    "PINYIN": "huó jiàn guǐ",
    "NGHĨA": "形容事情离奇,不可思议。"
  },
  {
    "STT": 164,
    "CHỮ": "H",
    "CỤM": "活雷锋",
    "PINYIN": "huó léi fēng",
    "NGHĨA": "像雷锋一样乐于做好事的人。"
  },
  {
    "STT": 165,
    "CHỮ": "H",
    "CỤM": "活埋人",
    "PINYIN": "huó mái rén",
    "NGHĨA": "比喻毫无缘由地冤枉、陷害人。"
  },
  {
    "STT": 166,
    "CHỮ": "H",
    "CỤM": "活菩萨",
    "PINYIN": "huó pú sà",
    "NGHĨA": "菩萨，佛教中修行到一定程度、地位，仅次于佛的人。活菩萨是比喻心肠慈善或救人 出苦难的人。"
  },
  {
    "STT": 167,
    "CHỮ": "H",
    "CỤM": "活人让尿憋死",
    "PINYIN": "huó rén ràng niào biē sǐ",
    "NGHĨA": "形容人头脑不灵活,面对困难毫无 办法。"
  },
  {
    "STT": 168,
    "CHỮ": "H",
    "CỤM": "活人往死门上送",
    "PINYIN": "huó rén wǎng sǐ mén shàng sòng",
    "NGHĨA": "指把人放到不利的或没有活路的 环境中。"
  },
  {
    "STT": 169,
    "CHỮ": "H",
    "CỤM": "和稀泥",
    "PINYIN": "huò xī ní",
    "NGHĨA": "比喻为了化解矛盾、纷争,无原则地调 停或折中。"
  },
  {
    "STT": 170,
    "CHỮ": "H",
    "CỤM": "活阎王",
    "PINYIN": "huó yán wɑnɡ",
    "NGHĨA": "比喻残害民众、极其凶恶的人。"
  },
  {
    "STT": 171,
    "CHỮ": "J",
    "CỤM": "给点颜色看",
    "PINYIN": "jǐ diǎn yán sè kàn",
    "NGHĨA": "把难看的脸色或做出某种严厉的行动给人看，以示警告或惩罚。"
  },
  {
    "STT": 172,
    "CHỮ": "J",
    "CỤM": "几斤几两",
    "PINYIN": "jǐ jīn jǐ liǎnɡ",
    "NGHĨA": "比喻底细。"
  },
  {
    "STT": 173,
    "CHỮ": "J",
    "CỤM": "机灵鬼",
    "PINYIN": "jī línɡ ɡuǐ",
    "NGHĨA": "很机灵的人。"
  },
  {
    "STT": 174,
    "CHỮ": "J",
    "CỤM": "及时雨",
    "PINYIN": "jí shí yǔ",
    "NGHĨA": "正赶上时候、适合需要的人或事。"
  },
  {
    "STT": 175,
    "CHỮ": "J",
    "CỤM": "急先锋",
    "PINYIN": "jí xiān fēnɡ",
    "NGHĨA": "打仗时冲锋在前的人。比喻积极领头的人。"
  },
  {
    "STT": 176,
    "CHỮ": "J",
    "CỤM": "挤牙膏",
    "PINYIN": "jǐ yá ɡāo",
    "NGHĨA": "说话不痛快，或施加一点压力，说出一点情况。"
  },
  {
    "STT": 177,
    "CHỮ": "J",
    "CỤM": "夹生饭",
    "PINYIN": "jiā shēnɡ fàn",
    "NGHĨA": "本意为半生不熟的饭，比喻开始没做好再做也很难做好的事情，或开 头没解决以后也很难解决的问题。"
  },
  {
    "STT": 178,
    "CHỮ": "J",
    "CỤM": "夹着尾巴做人",
    "PINYIN": "jiā zhe wěi bā zuò rén",
    "NGHĨA": "谨小慎微，不敢轻举妄动的样子。"
  },
  {
    "STT": 179,
    "CHỮ": "J",
    "CỤM": "交白卷",
    "PINYIN": "jiāo bái juàn",
    "NGHĨA": "比喻承担的任务一点没完成。"
  },
  {
    "STT": 180,
    "CHỮ": "J",
    "CỤM": "交红运",
    "PINYIN": "jiāo hónɡ yùn",
    "NGHĨA": "多指遇上涉及名利之类的好事。"
  },
  {
    "STT": 181,
    "CHỮ": "J",
    "CỤM": "叫花子",
    "PINYIN": "jiào huā zi",
    "NGHĨA": "生活没有着落而专靠向人要饭要钱过活的人。也叫“叫化子”。"
  },
  {
    "STT": 182,
    "CHỮ": "J",
    "CỤM": "嚼舌根",
    "PINYIN": "jiáo shé ɡēn",
    "NGHĨA": "比喻说是非，或者说废话。又作“嚼舌头”"
  },
  {
    "STT": 183,
    "CHỮ": "J",
    "CỤM": "接班人",
    "PINYIN": "jiē bān rén",
    "NGHĨA": "接替上一级工作的人。比喻接替上一辈继续从事某种事业的人。"
  },
  {
    "STT": 184,
    "CHỮ": "J",
    "CỤM": "揭疮疤",
    "PINYIN": "jiē chuānɡ bā",
    "NGHĨA": "指提及别人的痛处。"
  },
  {
    "STT": 185,
    "CHỮ": "J",
    "CỤM": "节骨眼",
    "PINYIN": "jié ɡǔ yǎn",
    "NGHĨA": "比喻紧要的、能起决定作用的环节或时机。"
  },
  {
    "STT": 186,
    "CHỮ": "J",
    "CỤM": "揭老底",
    "PINYIN": "jiē lǎo dǐ",
    "NGHĨA": "不愿被人知道的内情被揭露。"
  },
  {
    "STT": 187,
    "CHỮ": "J",
    "CỤM": "揭谜底",
    "PINYIN": "jiē mí dǐ",
    "NGHĨA": "公布谜语的结果。"
  },
  {
    "STT": 188,
    "CHỮ": "J",
    "CỤM": "揭开了脸",
    "PINYIN": "jiēkāi le liǎn",
    "NGHĨA": "指处事不留情面。"
  },
  {
    "STT": 189,
    "CHỮ": "J",
    "CỤM": "近视眼",
    "PINYIN": "jìn shì yǎn",
    "NGHĨA": "目光短浅"
  },
  {
    "STT": 190,
    "CHỮ": "J",
    "CỤM": "救世主",
    "PINYIN": "jiù shì zhǔ",
    "NGHĨA": "比喻拯救别人的人。"
  },
  {
    "STT": 1,
    "CHỮ": "L",
    "CỤM": "姥姥不疼，舅舅不爱",
    "PINYIN": "lǎo lǎo bù téng, jiù jìu bù ài",
    "NGHĨA": "指无人疼爱、关心。"
  },
  {
    "STT": 2,
    "CHỮ": "L",
    "CỤM": "老天爷睁开眼",
    "PINYIN": "lǎo tiān yé zhēng kāi yǎn",
    "NGHĨA": "见“天开眼”。"
  },
  {
    "STT": 3,
    "CHỮ": "L",
    "CỤM": "老鸦嫌猪黑",
    "PINYIN": "lǎo yā xián zhū hēi",
    "NGHĨA": "比喻无视自己的缺点,只知嫌恶他人的毛病。"
  },
  {
    "STT": 4,
    "CHỮ": "L",
    "CỤM": "老鸦占了凤凰巢",
    "PINYIN": "lǎo yā zhàn le fèng huáng cháo",
    "NGHĨA": "比喻卑贱者强占了高贵之物。含感累死没人买棺材叹、讥讽之意。"
  },
  {
    "STT": 5,
    "CHỮ": "L",
    "CỤM": "老鹰捉小鸡",
    "PINYIN": "lǎo yīng zhuō xiǎo jī",
    "NGHĨA": "形容来势凶猛,手到擒来。"
  },
  {
    "STT": 6,
    "CHỮ": "L",
    "CỤM": "老子天下第一",
    "PINYIN": "lǎo zi tiān xià dì yī",
    "NGHĨA": "老子:自高自大的人自称。\r\n形容人自负,日空一切。"
  },
  {
    "STT": 7,
    "CHỮ": "L",
    "CỤM": "雷公打，雷婆救",
    "PINYIN": "léi gōng dǎ, léi pó jiù",
    "NGHĨA": "雷公:神话中管打雷的男性神。\r\n指父亲严管子女,母亲却一味宽计。"
  },
  {
    "STT": 8,
    "CHỮ": "L",
    "CỤM": "勒紧裤腰带",
    "PINYIN": "lēi jǐn kù yāo dài",
    "NGHĨA": "指竭力节俭着过日子。"
  },
  {
    "STT": 9,
    "CHỮ": "L",
    "CỤM": "垒山头",
    "PINYIN": "lěi shān tóu",
    "NGHĨA": "比喻结成小集团搞分裂。"
  },
  {
    "STT": 10,
    "CHỮ": "L",
    "CỤM": "雷声大，雨点小",
    "PINYIN": "léi shēng dà, yǔ diǎn xiǎo",
    "NGHĨA": "比喻声势大,行动小,有虚张声势。"
  },
  {
    "STT": 11,
    "CHỮ": "L",
    "CỤM": "累死没人买棺材",
    "PINYIN": "lèi sǐ méi rén mǎi guān cai",
    "NGHĨA": "指付出艰辛的劳动却得不到他人的理解与感激。"
  },
  {
    "STT": 12,
    "CHỮ": "L",
    "CỤM": "勒住脖子扎上嘴",
    "PINYIN": "lēi zhù bó zi zhā shàng zuǐ",
    "NGHĨA": "形容人十分节俭地过日子。"
  },
  {
    "STT": 13,
    "CHỮ": "L",
    "CỤM": "冷处理",
    "PINYIN": "lěng chù lǐ",
    "NGHĨA": "金属工件淬火后放入冷空气中,以此 提高机械性能。\r\n比喻某些事情发生后等 到适当时机再作处理。"
  },
  {
    "STT": 14,
    "CHỮ": "L",
    "CỤM": "冷锅中豆儿爆",
    "PINYIN": "lěng guō zhōng dòu er bào",
    "NGHĨA": "比喻事情平白无故突然发生。\r\n比喻已平息的事情突然又发作起来。\r\n也作“冷锅里爆豆”、“冷锅中爆出一个 热栗子来”。"
  },
  {
    "STT": 15,
    "CHỮ": "L",
    "CỤM": "冷灰里爆出热火星",
    "PINYIN": "lěng huī lǐ bào chū rè huǒ xīng",
    "NGHĨA": "比喻已经平息的事情又意外重生事 端,引出麻烦。"
  },
  {
    "STT": 16,
    "CHỮ": "L",
    "CỤM": "冷了半截",
    "PINYIN": "lěng le bàn jié",
    "NGHĨA": "指因受到打击而泄气,丧失信心。 也作“凉了半截”。"
  },
  {
    "STT": 17,
    "CHỮ": "L",
    "CỤM": "冷手抓热馒头",
    "PINYIN": "lěng shǒu zhuā rè mán tou",
    "NGHĨA": "比喻人不费力就得到意外的收获。 \r\n比喻下手解决棘手的难题。\r\n也作“冷手抓个热煎堆”。"
  },
  {
    "STT": 18,
    "CHỮ": "L",
    "CỤM": "冷眼看螃蟹",
    "PINYIN": "lěng yǎn kàn páng xiè",
    "NGHĨA": "指对横行霸道的人表示鄙视。"
  },
  {
    "STT": 19,
    "CHỮ": "L",
    "CỤM": "冷一把，热一把",
    "PINYIN": "lěng yī bǎ, rè yī bǎ",
    "NGHĨA": "比喻待人厚此薄彼。"
  },
  {
    "STT": 20,
    "CHỮ": "L",
    "CỤM": "冷一句，热一句",
    "PINYIN": "lěng yī jù, rè yī jù",
    "NGHĨA": "指委婉地影射、中伤人。\r\n也作“热一句,冷一句”。"
  },
  {
    "STT": 21,
    "CHỮ": "L",
    "CỤM": "冷灶着一把，热灶着一把",
    "PINYIN": "lěng zào zhuó yī bǎ, rè zào zhuó yī bǎ",
    "NGHĨA": "在冷灶上点一把火,在热灶上点一把 火。比喻一视同仁,不趋炎附势。"
  },
  {
    "STT": 22,
    "CHỮ": "L",
    "CỤM": "立定脚",
    "PINYIN": "lì dìng jiǎo",
    "NGHĨA": "见“站得住脚”。"
  },
  {
    "STT": 23,
    "CHỮ": "L",
    "CỤM": "离见阎王爷就剩一层纸",
    "PINYIN": "lí jiàn yán wáng yé jiù shèng yī céng zhǐ",
    "NGHĨA": "形容生命即将结束。"
  },
  {
    "STT": 24,
    "CHỮ": "L",
    "CỤM": "立军令状",
    "PINYIN": "lì jūn lìng zhuàng",
    "NGHĨA": "军令状:接受命令后写的保证书;表示 不能完成任务,愿受严厉处分。\r\n指立下完成任务的保证。"
  },
  {
    "STT": 25,
    "CHỮ": "L",
    "CỤM": "离了马尿河也涨",
    "PINYIN": "lí le mǎ niào hé yě zhǎng",
    "NGHĨA": "比喻离了某人不会影响大局。"
  },
  {
    "STT": 26,
    "CHỮ": "L",
    "CỤM": "离了这块云，天也照样下雨",
    "PINYIN": "lí le zhè kuài yún, tiān yě zhào yàng xià yǔ",
    "NGHĨA": "比喻没有某人,事情照样能办成。"
  },
  {
    "STT": 27,
    "CHỮ": "L",
    "CỤM": "离笼之鸟，脱网之鱼",
    "PINYIN": "lí lóng zhī niǎo, tuō wǎng zhī yú",
    "NGHĨA": "比喻逃脱羁绊或险境的人。\r\n也作“漏网之鱼,出笼之鸟”、“脱网的 鱼,离笼的鸟”。"
  },
  {
    "STT": 28,
    "CHỮ": "L",
    "CỤM": "里三层，外三层",
    "PINYIN": "lǐ sān céng, wài sān céng",
    "NGHĨA": "形容围拢的人很多。"
  },
  {
    "STT": 29,
    "CHỮ": "L",
    "CỤM": "离天远，挨地近",
    "PINYIN": "lí tiān yuǎn, āi dì jìn",
    "NGHĨA": "形容人快死了。"
  },
  {
    "STT": 30,
    "CHỮ": "L",
    "CỤM": "里外不是人",
    "PINYIN": "lǐ wài bù shì rén",
    "NGHĨA": "指到处遭埋怨,落不是。"
  },
  {
    "STT": 31,
    "CHỮ": "L",
    "CỤM": "立下马威",
    "PINYIN": "lì xià mǎ wēi",
    "NGHĨA": "指一开始便立威,震慑别人。"
  },
  {
    "STT": 32,
    "CHỮ": "L",
    "CỤM": "连根烂",
    "PINYIN": "lián gēn làn",
    "NGHĨA": "比喻彻底坏掉。"
  },
  {
    "STT": 33,
    "CHỮ": "L",
    "CỤM": "连半个人影也没有",
    "PINYIN": "lián bàn gè rén yǐng yě méi yǒu",
    "NGHĨA": "指根本没有人。\r\n也作“连个鬼影子都没有”、“连个人影 也没有”。"
  },
  {
    "STT": 34,
    "CHỮ": "L",
    "CỤM": "脸不变色心不跳",
    "PINYIN": "liǎn bù biàn sè xīn bù tiào",
    "NGHĨA": "形容遇事不慌乱,镇定自若。"
  },
  {
    "STT": 35,
    "CHỮ": "L",
    "CỤM": "脸朝黄土背朝天",
    "PINYIN": "liǎn cháo huáng tǔ bèi cháo tiān",
    "NGHĨA": "见“面朝黄土背朝天”。"
  },
  {
    "STT": 36,
    "CHỮ": "L",
    "CỤM": "脸丑怪镜子",
    "PINYIN": "liǎn chǒu guài jìng zi",
    "NGHĨA": "比喻自己不好却埋怨别人。"
  },
  {
    "STT": 37,
    "CHỮ": "L",
    "CỤM": "连出气都不敢张大嘴巴",
    "PINYIN": "lián chū qì dōu bù gǎn zhāng dà zuǐ ba",
    "NGHĨA": "形容非常胆小害怕,谨小慎微。"
  },
  {
    "STT": 38,
    "CHỮ": "L",
    "CỤM": "连放个屁也得有人管",
    "PINYIN": "lián fàng gè pì yě děi yǒu rén guǎn",
    "NGHĨA": "形容受人约束,没有一点自由。"
  },
  {
    "STT": 39,
    "CHỮ": "L",
    "CỤM": "连个屁都不敢放",
    "PINYIN": "lián gè pì dōu bù gǎn fàng",
    "NGHĨA": "指连一句话也不敢说。形容人十分 害怕。\r\n也作“连个屁都没敢放”、“连个屁也不 敢放”。"
  },
  {
    "STT": 40,
    "CHỮ": "L",
    "CỤM": "连根拔",
    "PINYIN": "lián gēn bá",
    "NGHĨA": "比喻彻底铲除,全部解决。"
  },
  {
    "STT": 41,
    "CHỮ": "L",
    "CỤM": "连锅端",
    "PINYIN": "lián guō duān",
    "NGHĨA": "比喻全部除掉,彻底解决。\r\n比喻"
  },
  {
    "STT": 42,
    "CHỮ": "L",
    "CỤM": "脸皮扒下来能当鞋底穿",
    "PINYIN": "liǎn pí bā xià lái néng dāng xié dǐ chuān",
    "NGHĨA": "形容人脸皮厚,做事不顾羞耻。"
  },
  {
    "STT": 43,
    "CHỮ": "L",
    "CỤM": "脸皮儿薄得像灯花纸",
    "PINYIN": "liǎn pí er báo de xiàng dēng huā zhǐ",
    "NGHĨA": "形容人过于顾及颜面。"
  },
  {
    "STT": 44,
    "CHỮ": "L",
    "CỤM": "脸皮厚",
    "PINYIN": "liǎn pí hòu",
    "NGHĨA": "形容人不顾颜面,不知羞耻。"
  },
  {
    "STT": 45,
    "CHỮ": "L",
    "CỤM": "脸让黑瞎子舔了",
    "PINYIN": "liǎn ràng hēi xiā zi tiǎn le",
    "NGHĨA": "黑瞎子:黑熊。\r\n斥骂人没皮没脸。"
  },
  {
    "STT": 46,
    "CHỮ": "L",
    "CỤM": "脸上带笑,袖里藏刀",
    "PINYIN": "liǎn shàng dài xiào，xiù lǐ cáng dāo",
    "NGHĨA": "指表面和善,内心歹毒。"
  },
  {
    "STT": 47,
    "CHỮ": "L",
    "CỤM": "脸上飞红云",
    "PINYIN": "liǎn shàng fēi hóng yún",
    "NGHĨA": "形容女子害羞时的样子。"
  },
  {
    "STT": 48,
    "CHỮ": "L",
    "CỤM": "脸上挂不住",
    "PINYIN": "liǎn shàng guà bù zhù",
    "NGHĨA": "指没脸面,不光彩。\r\n也作“脸上支不住”。"
  },
  {
    "STT": 49,
    "CHỮ": "L",
    "CỤM": "脸上贴金",
    "PINYIN": "liǎn shàng tiē jīn",
    "NGHĨA": "喻指美化自己或他人。"
  },
  {
    "STT": 50,
    "CHỮ": "L",
    "CỤM": "脸上下不来",
    "PINYIN": "liǎn shàng xià bù lái",
    "NGHĨA": "指当下面子上过不去,在人前受窘 难堪。\r\n也作“脸上磨不开”、“脸上下不去”。"
  },
  {
    "STT": 51,
    "CHỮ": "L",
    "CỤM": "脸往哪里放",
    "PINYIN": "liǎn wǎng nǎ lǐ fàng",
    "NGHĨA": "指失了体面,不好意思。\r\n也作“老脸往哪儿搁”、“脸都没处搁”、 “脸搁在啥地方”。"
  },
  {
    "STT": 52,
    "CHỮ": "L",
    "CỤM": "连轴转",
    "PINYIN": "lián zhóu zhuàn",
    "NGHĨA": "比喻夜以继日不停地工作或做事。"
  },
  {
    "STT": 53,
    "CHỮ": "L",
    "CỤM": "连做梦也没有想到",
    "PINYIN": "lián zuò mèng yě méi yǒu xiǎng dào",
    "NGHĨA": "见“做梦也想不到”。"
  },
  {
    "STT": 54,
    "CHỮ": "L",
    "CỤM": "凉白菜干",
    "PINYIN": "liáng bái cài gān",
    "NGHĨA": "比喻人受到冷落。"
  },
  {
    "STT": 55,
    "CHỮ": "L",
    "CỤM": "两边倒",
    "PINYIN": "liǎng biān dǎo",
    "NGHĨA": "形容摇摆不定,无自己的主见和坚定 的立场。"
  },
  {
    "STT": 56,
    "CHỮ": "L",
    "CỤM": "两步并作一步",
    "PINYIN": "liǎng bù bìng zuò yī bù",
    "NGHĨA": "见“三步并作两步”。"
  },
  {
    "STT": 57,
    "CHỮ": "L",
    "CỤM": "量柴头，数米粒",
    "PINYIN": "liáng chái tou, shǔ mǐ lì",
    "NGHĨA": "形容持家非常节俭、仔细。\r\n也作“量柴头,数米角”。"
  },
  {
    "STT": 58,
    "CHỮ": "L",
    "CỤM": "亮底牌",
    "PINYIN": "liàng dǐ pái",
    "NGHĨA": "底牌:扑克牌游戏中最后亮出来的牌, 比喻底细、内情。\r\n喻指最终揭示事情的真相或底细。"
  },
  {
    "STT": 59,
    "CHỮ": "L",
    "CỤM": "两个肩膀扛张嘴",
    "PINYIN": "liǎng gè jiān bǎng káng zhe zhāng zuǐ",
    "NGHĨA": "形容十分贫穷,光身一人,别无他 物。\r\n讥讽人两手空空来吃白食。\r\n也作“肩膀头子扛一张嘴”、“两个肩膀 担着一张嘴”、“两肩膀抬着张嘴”。"
  },
  {
    "STT": 60,
    "CHỮ": "L",
    "CỤM": "两个拳头打人",
    "PINYIN": "liǎng gè quán tou dǎ rén",
    "NGHĨA": "指战术上分散使用兵力。"
  },
  {
    "STT": 61,
    "CHỮ": "L",
    "CỤM": "亮红灯",
    "PINYIN": "liàng hóng dēng",
    "NGHĨA": "喻指拒绝某人或禁止某事。"
  },
  {
    "STT": 62,
    "CHỮ": "L",
    "CỤM": "亮红牌",
    "PINYIN": "liàng hóng pái",
    "NGHĨA": "指取消做某事的资格或提出严重警告。"
  },
  {
    "STT": 63,
    "CHỮ": "L",
    "CỤM": "亮黄牌",
    "PINYIN": "liàng huáng pái",
    "NGHĨA": "借指提出警告。黄牌是体育比赛中裁判用来警告违规运动员的黄色标志。"
  },
  {
    "STT": 64,
    "CHỮ": "L",
    "CỤM": "两脚踏住平川地",
    "PINYIN": "liǎng jiǎo tà zhù píng chuān dì",
    "NGHĨA": "比喻平安无事了。"
  },
  {
    "STT": 65,
    "CHỮ": "L",
    "CỤM": "凉了半截",
    "PINYIN": "liáng le bàn jié",
    "NGHĨA": "失望，心灰意冷。"
  },
  {
    "STT": 66,
    "CHỮ": "L",
    "CỤM": "两面刀",
    "PINYIN": "liǎng miàn dāo",
    "NGHĨA": "指人表面一套背地一套,11是心非。"
  },
  {
    "STT": 67,
    "CHỮ": "L",
    "CỤM": "两面光",
    "PINYIN": "liǎng miàn guāng",
    "NGHĨA": "见“面面光”。"
  },
  {
    "STT": 68,
    "CHỮ": "L",
    "CỤM": "亮牌子",
    "PINYIN": "liàng pái zi",
    "NGHĨA": "指说明身份,挑明事情。"
  },
  {
    "STT": 69,
    "CHỮ": "L",
    "CỤM": "两手捧着个刺猬",
    "PINYIN": "liǎng shǒu pěng zhe gè cì wèi",
    "NGHĨA": "比喻人左右为难,进退两难。"
  },
  {
    "STT": 70,
    "CHỮ": "L",
    "CỤM": "两手抓",
    "PINYIN": "liǎng shǒu zhuā",
    "NGHĨA": "比喻做事重视从多个方面着手,使各 项工作齐头并进。"
  },
  {
    "STT": 71,
    "CHỮ": "L",
    "CỤM": "两手攥空拳",
    "PINYIN": "liǎng shǒu zuàn kōng quán",
    "NGHĨA": "形容人很穷,一无所有。\r\n也作“两手握空拳”、“两手攥空拳头”。"
  },
  {
    "STT": 72,
    "CHỮ": "L",
    "CỤM": "两条腿走路",
    "PINYIN": "liǎng tiáo tuǐ zǒu lù",
    "NGHĨA": "比喻以多种途径办事。"
  },
  {
    "STT": 73,
    "CHỮ": "L",
    "CỤM": "两条心",
    "PINYIN": "liǎng tiáo xīn",
    "NGHĨA": "喻指不忠实,有二心。"
  },
  {
    "STT": 74,
    "CHỮ": "L",
    "CỤM": "两头摸不着缰",
    "PINYIN": "liǎng tóu mō bù zháo jiāng",
    "NGHĨA": "比喻对发生的事无从下手解决。"
  },
  {
    "STT": 75,
    "CHỮ": "L",
    "CỤM": "良心背在背上",
    "PINYIN": "liáng xīn bèi zài bèi shàng",
    "NGHĨA": "指责人心不正,没良心。\r\n也作“良心长到肋条上”。"
  },
  {
    "STT": 76,
    "CHỮ": "L",
    "CỤM": "良心别在裤腰里",
    "PINYIN": "liáng xīn bié zài kù yāo lǐ",
    "NGHĨA": "指违心下背叛忤逆等坏事。"
  },
  {
    "STT": 77,
    "CHỮ": "L",
    "CỤM": "良心叫狗吃了",
    "PINYIN": "liáng xīn jiào gǒu chī le",
    "NGHĨA": "斥责人卑鄙,丧尽天良。\r\n也作“良心叫狗给叼走了”。"
  },
  {
    "STT": 78,
    "CHỮ": "L",
    "CỤM": "两眼煤黑子",
    "PINYIN": "liǎng yǎn méi hēi zi",
    "NGHĨA": "形容人一字不识。"
  },
  {
    "STT": 79,
    "CHỮ": "L",
    "CỤM": "两眼一摸黑",
    "PINYIN": "liǎng yǎn yī mō hēi",
    "NGHĨA": "比喻底细、内情。\r\n喻指最终揭示事情的真相或底细。"
  },
  {
    "STT": 80,
    "CHỮ": "L",
    "CỤM": "两张皮",
    "PINYIN": "liǎng zhāng pí",
    "NGHĨA": "比喻各说各的，或各做各的。"
  },
  {
    "STT": 81,
    "CHỮ": "L",
    "CỤM": "两只船合使一篷风",
    "PINYIN": "liǎng zhī chuán hé shǐ yī péng fēng",
    "NGHĨA": "比喻两人同受惠于一人。"
  },
  {
    "STT": 82,
    "CHỮ": "L",
    "CỤM": "撩虎须",
    "PINYIN": "liáo hǔ xū",
    "NGHĨA": "见“拔虎须”。"
  },
  {
    "STT": 83,
    "CHỮ": "L",
    "CỤM": "临渴才打井",
    "PINYIN": "lín kě cái dǎ jǐng",
    "NGHĨA": "比喻平时不做准备,事到临头才费劲 采取措施。"
  },
  {
    "STT": 84,
    "CHỮ": "L",
    "CỤM": "临上轿才扎耳朵眼儿",
    "PINYIN": "lín shàng jiào cái zhā ěr duo yǎn er",
    "NGHĨA": "比喻事到临头才仓促准备。 也作“临上轿再扎耳朵眼儿”。"
  },
  {
    "STT": 85,
    "CHỮ": "L",
    "CỤM": "临时抱佛脚",
    "PINYIN": "lín shí bào fó jiǎo",
    "NGHĨA": "比喻事到临头才急于想办法应付。"
  },
  {
    "STT": 86,
    "CHỮ": "L",
    "CỤM": "临死还找个垫背的",
    "PINYIN": "lín sǐ hái zhǎo gè diàn bèi de",
    "NGHĨA": "见“死也要拉个垫背的”。"
  },
  {
    "STT": 87,
    "CHỮ": "L",
    "CỤM": "临阵磨枪",
    "PINYIN": "lín zhèn mó qiāng",
    "NGHĨA": "快要打仗的时候才把枪头磨一磨。喻 指平时没准备,事情来了急忙应付也顶 点用。\r\n多用于应付考试——类的事情。"
  },
  {
    "STT": 88,
    "CHỮ": "L",
    "CỤM": "留把柄",
    "PINYIN": "liú bǎ bǐng",
    "NGHĨA": "把柄:喻指凭证,多指进行交涉或要挟 的凭证。\r\n喻指做事有纰漏而留给别人抓短的口 实或要挟的凭证。\r\n也作“落把柄”。"
  },
  {
    "STT": 89,
    "CHỮ": "L",
    "CỤM": "留点口水养牙齿",
    "PINYIN": "liú diǎn kǒu shuǐ yǎng yá chǐ",
    "NGHĨA": "指不再费力地劝人了。"
  },
  {
    "STT": 90,
    "CHỮ": "L",
    "CỤM": "留后路",
    "PINYIN": "liú hòu lù",
    "NGHĨA": "喻指办事以防不测,预留退身之路。"
  },
  {
    "STT": 91,
    "CHỮ": "L",
    "CỤM": "留后手",
    "PINYIN": "liú hòu shǒu",
    "NGHĨA": "指为避免将来被动,采取留有余地的 办法。"
  },
  {
    "STT": 92,
    "CHỮ": "L",
    "CỤM": "留后遗症",
    "PINYIN": "liú hòu yí zhèng",
    "NGHĨA": "后遗症,生病过后遗留下的一些症状。 比喻因事情处理不当而留下一系列消 极影响。"
  },
  {
    "STT": 93,
    "CHỮ": "L",
    "CỤM": "留话柄",
    "PINYIN": "liú huà bǐng",
    "NGHĨA": "指做事有纰漏而给别人留下议论的口实。\r\n也作“落话把”、“落话柄”。"
  },
  {
    "STT": 94,
    "CHỮ": "L",
    "CỤM": "留祸根",
    "PINYIN": "liú huò gēn",
    "NGHĨA": "指留下引发灾难的根源。"
  },
  {
    "STT": 95,
    "CHỮ": "L",
    "CỤM": "留空子",
    "PINYIN": "liú kòng zi",
    "NGHĨA": "指给别人留下可乘之机。"
  },
  {
    "STT": 96,
    "CHỮ": "L",
    "CỤM": "流口水",
    "PINYIN": "liú kǒu shuǐ",
    "NGHĨA": "指看到好吃、好喝的东西又吃不到、喝 不到的时候往肚里咽口水的样子。\r\n喻指 迫切希望得到某人或某物。"
  },
  {
    "STT": 97,
    "CHỮ": "L",
    "CỤM": "流泪眼逢流泪眼，断肠人遇断肠人",
    "PINYIN": "liú lèi yǎn féng liú lèi yǎn, duàn cháng rén yù duàn cháng rén",
    "NGHĨA": "断肠:形容极度思念或悲痛。\r\n指悲痛伤心的人碰在一起。\r\n也作“流泪眼观流泪眼,断肠人伴断肠 人”、“流泪眼观流泪眼,断肠人对断肠人”、“流泪眼观流泪眼,断肠人看断肠人”。"
  },
  {
    "STT": 98,
    "CHỮ": "L",
    "CỤM": "柳树上著刀，桑树上出血",
    "PINYIN": "liǔ shù shàng zhuó dāo, sāng shù shàng chū xuè",
    "NGHĨA": "比喻代人受过。\r\n比喻灾祸牵累 他人。"
  },
  {
    "STT": 99,
    "CHỮ": "L",
    "CỤM": "留余地",
    "PINYIN": "liú yú dì",
    "NGHĨA": "喻指说话做事不走极端,留下回旋的 地步。\r\n也作“留地步”。"
  },
  {
    "STT": 100,
    "CHỮ": "L",
    "CỤM": "六月里下雪",
    "PINYIN": "liù yuè lǐ xià xuě",
    "NGHĨA": "比喻事情发生得蹊跷、稀罕。"
  },
  {
    "STT": 101,
    "CHỮ": "L",
    "CỤM": "龙虎斗",
    "PINYIN": "lóng hǔ dòu",
    "NGHĨA": "比喻强者之间势均力敌的争斗。"
  },
  {
    "STT": 102,
    "CHỮ": "L",
    "CỤM": "笼中之鸟，网内之鱼",
    "PINYIN": "lóng zhōng zhī niǎo, wǎng nèi zhī yú",
    "NGHĨA": "比喻陷入困境,难以逃脱。 \r\n也作“笼中之鸟,釜中之鱼”。"
  },
  {
    "STT": 103,
    "CHỮ": "L",
    "CỤM": "漏风声",
    "PINYIN": "lòu fēng shēng",
    "NGHĨA": "指走漏消息。\r\n也作“露风声”。"
  },
  {
    "STT": 104,
    "CHỮ": "L",
    "CỤM": "驴不跑怨鞍不好",
    "PINYIN": "lǘ bù pǎo yuàn ān bù hǎo",
    "NGHĨA": "比喻出现问题不从自身找原因,却赖 在客观条件上。"
  },
  {
    "STT": 105,
    "CHỮ": "L",
    "CỤM": "露口风",
    "PINYIN": "lòu kǒu fēng",
    "NGHĨA": "指交谈时泄露消息。"
  },
  {
    "STT": 106,
    "CHỮ": "L",
    "CỤM": "露破绽",
    "PINYIN": "lòu pò zhàn",
    "NGHĨA": "指说话、做事出现漏洞或毛病。"
  },
  {
    "STT": 107,
    "CHỮ": "L",
    "CỤM": "漏网之鱼，出笼之鸟",
    "PINYIN": "lòu wǎng zhī yú, chū lóng zhī niǎo",
    "NGHĨA": "见“离笼之鸟,脱网之鱼”。"
  },
  {
    "STT": 108,
    "CHỮ": "L",
    "CỤM": "露一鼻子",
    "PINYIN": "lòu yī bí zi",
    "NGHĨA": "指显露本领。"
  },
  {
    "STT": 109,
    "CHỮ": "L",
    "CỤM": "鲁班门前弄大斧",
    "PINYIN": "lǔ bān mén qián nòng dà fǔ",
    "NGHĨA": "鲁班:我国古代杰出的工匠,传为春秋 时鲁国人,技艺超绝,多有发明,后世被 尊为建筑工匠的祖师。\r\n指在行家面前显示,卖弄自己,说自 己时有自谦之意,说别人时则表示讥讽。\r\n也作“鲁班门前掉大斧”、“鲁班门前玩 锈”。"
  },
  {
    "STT": 110,
    "CHỮ": "L",
    "CỤM": "履薄冰",
    "PINYIN": "lǚ báo bīng",
    "NGHĨA": "形容戒惧谨慎的心理。"
  },
  {
    "STT": 111,
    "CHỮ": "L",
    "CỤM": "路不拾遗，夜不闭户",
    "PINYIN": "lù bù shí yí, yè bù bì hù",
    "NGHĨA": "人们不会把掉在路上的东西捡起来据 为己有;晚上睡觉也不需要关门,没有人 入室偷盗。形容社会风尚好,太平安定。"
  },
  {
    "STT": 112,
    "CHỮ": "L",
    "CỤM": "露出狐狸尾巴",
    "PINYIN": "lù chū hú li wěi ba",
    "NGHĨA": "指露出破绽，被人发现。也说“露马脚”。"
  },
  {
    "STT": 113,
    "CHỮ": "L",
    "CỤM": "驴唇对不着马嘴",
    "PINYIN": "lǘ chún duì bù zháo mǎ zuǐ",
    "NGHĨA": "见“牛头不对马嘴”。"
  },
  {
    "STT": 114,
    "CHỮ": "L",
    "CỤM": "驴打滚",
    "PINYIN": "lǘ dǎ gǔn",
    "NGHĨA": "高利贷的一种。到期还不了,利上加 利,如驴翻身打滚,越滚越多。"
  },
  {
    "STT": 115,
    "CHỮ": "L",
    "CỤM": "驴倒了架子不倒",
    "PINYIN": "lǘ dǎo le jià zi bù dǎo",
    "NGHĨA": "比喻人虽已失势,却还装腔作势,硬撑 着骄矜的姿态。"
  },
  {
    "STT": 116,
    "CHỮ": "L",
    "CỤM": "驴的朝东,马的朝西",
    "PINYIN": "lǘ de cháo dōng，mǎ de cháo xī",
    "NGHĨA": "比喻各走各的路,互不相干。 也作“驴什么朝东,马什么朝西”、“一个马儿头向东,一个驴儿头向西”。"
  },
  {
    "STT": 117,
    "CHỮ": "L",
    "CỤM": "捋虎须",
    "PINYIN": "lǚ hǔ xū",
    "NGHĨA": "捋: 抚摸。比喻触犯有权势的人或冒着很大的风险。"
  },
  {
    "STT": 118,
    "CHỮ": "L",
    "CỤM": "路见不平，拔刀相助",
    "PINYIN": "lù jiàn bù píng, bá dāo xiāng zhù",
    "NGHĨA": "指遇到不平之事,挺身帮助受欺的一方。"
  },
  {
    "STT": 119,
    "CHỮ": "L",
    "CỤM": "路路通",
    "PINYIN": "lù lù tōng",
    "NGHĨA": "比喻办事门路多,交际广。\r\n比喻 事情进展顺利,没有障碍。"
  },
  {
    "STT": 120,
    "CHỮ": "L",
    "CỤM": "驴事未了，马事又发",
    "PINYIN": "lǘ shì wèi liǎo, mǎ shì yòu fā",
    "NGHĨA": "比喻倒霉事—一个接一个发生。\r\n也作“驴事未去,马事到来”。"
  },
  {
    "STT": 121,
    "CHỮ": "L",
    "CỤM": "驴头不对马嘴",
    "PINYIN": "lǘ tóu bù duì mǎ zuǐ",
    "NGHĨA": "见“牛头不对马嘴”。"
  },
  {
    "STT": 122,
    "CHỮ": "L",
    "CỤM": "露头角",
    "PINYIN": "lù tóu jiǎo",
    "NGHĨA": "比喻初次显露才能。"
  },
  {
    "STT": 123,
    "CHỮ": "L",
    "CỤM": "露一手",
    "PINYIN": "lù yī shǒu",
    "NGHĨA": "指在某一方面或某件事上显示本领给 人看。"
  },
  {
    "STT": 124,
    "CHỮ": "L",
    "CỤM": "乱点鸳鸯谱",
    "PINYIN": "luàn diǎn yuān yāng pǔ",
    "NGHĨA": "鸳鸯:鸟,像野鸭,体形较小,雌雄多成 对生活在水边;文学上用来比喻夫妻。\r\n错配婚姻。\r\n喻指无依据地胡乱安 排事情。"
  },
  {
    "STT": 125,
    "CHỮ": "L",
    "CỤM": "乱方寸",
    "PINYIN": "luàn fāng cùn",
    "NGHĨA": "方寸:心。 \r\n指人思想混乱,没有头绪。"
  },
  {
    "STT": 126,
    "CHỮ": "L",
    "CỤM": "乱脚步",
    "PINYIN": "luàn jiǎo bù",
    "NGHĨA": "指出现意外,做事步骤被打乱。"
  },
  {
    "STT": 127,
    "CHỮ": "L",
    "CỤM": "乱手脚",
    "PINYIN": "luàn shǒu jiǎo",
    "NGHĨA": "手忙脚乱。形容人慌乱得不知所措。"
  },
  {
    "STT": 128,
    "CHỮ": "L",
    "CỤM": "落把柄",
    "PINYIN": "luò bǎ bǐng",
    "NGHĨA": "见“留把柄”。"
  },
  {
    "STT": 129,
    "CHỮ": "L",
    "CỤM": "落背弓",
    "PINYIN": "luò bèi gōng",
    "NGHĨA": "见“打背弓”。"
  },
  {
    "STT": 130,
    "CHỮ": "L",
    "CỤM": "萝卜白菜一锅煮",
    "PINYIN": "luó bo bái cài yī guō zhǔ",
    "NGHĨA": "比喻对事物不作具体分析,笼统对待处理。"
  },
  {
    "STT": 131,
    "CHỮ": "L",
    "CỤM": "萝卜弗当小菜",
    "PINYIN": "luó bo fú dāng xiǎo cài",
    "NGHĨA": "比喻瞧不起人,不当人看。"
  },
  {
    "STT": 132,
    "CHỮ": "L",
    "CỤM": "落不是",
    "PINYIN": "luò bù shì",
    "NGHĨA": "指好心做事却招来别人的指责和埋怨。"
  },
  {
    "STT": 133,
    "CHỮ": "L",
    "CỤM": "锣不响，鼓不鸣",
    "PINYIN": "luó bù xiǎng, gǔ bù míng",
    "NGHĨA": "比喻不声不响、悄无声息地进行。"
  },
  {
    "STT": 134,
    "CHỮ": "L",
    "CỤM": "落风尘",
    "PINYIN": "luò fēng chén",
    "NGHĨA": "指沦落为妓女。"
  },
  {
    "STT": 135,
    "CHỮ": "L",
    "CỤM": "落话把",
    "PINYIN": "luò huà bǎ",
    "NGHĨA": "见“留话柄”。"
  },
  {
    "STT": 136,
    "CHỮ": "L",
    "CỤM": "落话柄",
    "PINYIN": "luò huà bǐng",
    "NGHĨA": "见“留话柄”。"
  },
  {
    "STT": 137,
    "CHỮ": "L",
    "CỤM": "落花有意随流水，流水无情恋落花",
    "PINYIN": "luò huā yǒu yì suí liú shuǐ, liú shuǐ wú qíng liàn luò huā",
    "NGHĨA": "比喻一方有情,一方淡漠。常含无奈之意。\r\n也作“落花有意,流水无情”。"
  },
  {
    "STT": 138,
    "CHỮ": "L",
    "CỤM": "落火坑",
    "PINYIN": "luò huǒ kēng",
    "NGHĨA": "比喻落入坏人之手或陷入危难境地。"
  },
  {
    "STT": 139,
    "CHỮ": "L",
    "CỤM": "落旧套",
    "PINYIN": "luò jiù tào",
    "NGHĨA": "喻指没有新意。"
  },
  {
    "STT": 140,
    "CHỮ": "L",
    "CỤM": "落魔掌",
    "PINYIN": "luò mó zhǎng",
    "NGHĨA": "指落入坏人之手。"
  },
  {
    "STT": 141,
    "CHỮ": "L",
    "CỤM": "锣齐鼓不齐",
    "PINYIN": "luó qí gǔ bù qí",
    "NGHĨA": "比喻人心不一致,行动不协调。"
  },
  {
    "STT": 142,
    "CHỮ": "L",
    "CỤM": "落圈套",
    "PINYIN": "luò quān tào",
    "NGHĨA": "见“中圈套”。"
  },
  {
    "STT": 143,
    "CHỮ": "L",
    "CỤM": "骆驼站在羊群里",
    "PINYIN": "luò tuo zhàn zài yáng qún lǐ",
    "NGHĨA": "形容人或物体高大,非常显眼。"
  },
  {
    "STT": 144,
    "CHỮ": "L",
    "CỤM": "拉帮结伙",
    "PINYIN": "lā bānɡ jié huǒ",
    "NGHĨA": "组织帮派，搞小集团活动。"
  },
  {
    "STT": 145,
    "CHỮ": "L",
    "CỤM": "拉不下脸",
    "PINYIN": "lā bú xià liǎn",
    "NGHĨA": "碍于情面，不能拒绝或不便开口。"
  },
  {
    "STT": 146,
    "CHỮ": "L",
    "CỤM": "拉长线",
    "PINYIN": "lā cháng xiàn",
    "NGHĨA": "比喻作长远打算。也说“放长线”。"
  },
  {
    "STT": 147,
    "CHỮ": "L",
    "CỤM": "拉长脸",
    "PINYIN": "lā chánɡ liǎn",
    "NGHĨA": "把脸拉长。指不高兴、生气的样子。"
  },
  {
    "STT": 148,
    "CHỮ": "L",
    "CỤM": "拉大旗作虎皮",
    "PINYIN": "lā dà qí zuò hǔ pí",
    "NGHĨA": "用名人的威望抬高或保护自己。"
  },
  {
    "STT": 149,
    "CHỮ": "L",
    "CỤM": "拉关系",
    "PINYIN": "lā ɡuān xi",
    "NGHĨA": "指为了达到某种目的，跟关系疏远的人或单位联系、拉拢，建立某种关系。"
  },
  {
    "STT": 150,
    "CHỮ": "L",
    "CỤM": "拉家常",
    "PINYIN": "lā jiā chánɡ",
    "NGHĨA": "指谈论家庭的日常生活，也泛指随便聊天。也说“扯家常”。"
  },
  {
    "STT": 151,
    "CHỮ": "L",
    "CỤM": "拉交情",
    "PINYIN": "lā jiāo qinɡ",
    "NGHĨA": "拉关系; 套近乎。"
  },
  {
    "STT": 152,
    "CHỮ": "L",
    "CỤM": "拉锯战",
    "PINYIN": "lā jù zhàn",
    "NGHĨA": "比喻双方来回往复。"
  },
  {
    "STT": 153,
    "CHỮ": "L",
    "CỤM": "拉偏架",
    "PINYIN": "lā piān jià",
    "NGHĨA": "指在双方发生冲突时偏袒一方。"
  },
  {
    "STT": 154,
    "CHỮ": "L",
    "CỤM": "拉下脸",
    "PINYIN": "lā xià liǎn",
    "NGHĨA": "露出不高兴的表情。不顾情面。"
  },
  {
    "STT": 155,
    "CHỮ": "L",
    "CỤM": "拉下马",
    "PINYIN": "lā xià mǎ",
    "NGHĨA": "比喻把人从统治地位上拉下来。"
  },
  {
    "STT": 156,
    "CHỮ": "L",
    "CỤM": "拉下水",
    "PINYIN": "lā xià shuǐ",
    "NGHĨA": "使之卷入。把人拉入水中。比喻拉拢人一起去做坏事。也说“拖下水”。"
  },
  {
    "STT": 157,
    "CHỮ": "L",
    "CỤM": "拉闲篇",
    "PINYIN": "lā xián piān",
    "NGHĨA": "谈一些与正事无关的话，闲聊。"
  },
  {
    "STT": 158,
    "CHỮ": "L",
    "CỤM": "拉一把",
    "PINYIN": "lā yì bǎ",
    "NGHĨA": "比喻帮助别人摆脱困境。"
  },
  {
    "STT": 159,
    "CHỮ": "L",
    "CỤM": "癞皮狗",
    "PINYIN": "lài pí ɡǒu",
    "NGHĨA": "骂人的话，指没皮没脸的人，脸皮厚的人。"
  },
  {
    "STT": 160,
    "CHỮ": "L",
    "CỤM": "拦路虎",
    "PINYIN": "lán lù hǔ",
    "NGHĨA": "拦住道路的老虎，过去指拦路抢劫的匪徒。现在多用来比喻前进路 上的障碍或困难。"
  },
  {
    "STT": 161,
    "CHỮ": "L",
    "CỤM": "浪子回头金不换",
    "PINYIN": "lànɡ zi huí tóu jīn bú huàn",
    "NGHĨA": "形容犯错的人改过自新非常难得。"
  },
  {
    "STT": 162,
    "CHỮ": "L",
    "CỤM": "老把戏",
    "PINYIN": "lǎo bǎ xì",
    "NGHĨA": "老旧的一套，多指没有改变的思想、方式、方法。把戏，杂技的节目。"
  },
  {
    "STT": 163,
    "CHỮ": "L",
    "CỤM": "老掉牙",
    "PINYIN": "lǎo diào yá",
    "NGHĨA": "事物、言论等陈旧过时。"
  },
  {
    "STT": 164,
    "CHỮ": "L",
    "CỤM": "老封建",
    "PINYIN": "lǎo fēnɡ jiàn",
    "NGHĨA": "指某人循规蹈矩、传统、保守。"
  },
  {
    "STT": 165,
    "CHỮ": "L",
    "CỤM": "老狐狸",
    "PINYIN": "lǎo hú li",
    "NGHĨA": "指老谋深算的人。"
  },
  {
    "STT": 166,
    "CHỮ": "L",
    "CỤM": "老黄牛",
    "PINYIN": "lǎo huánɡ niú",
    "NGHĨA": "指勤劳肯干的人。"
  },
  {
    "STT": 167,
    "CHỮ": "L",
    "CỤM": "冷血动物",
    "PINYIN": "lěnɡ xuè dònɡ wù",
    "NGHĨA": "比喻没有感情的人，不懂得知恩图报。"
  },
  {
    "STT": 168,
    "CỤM": "冷不丁",
    "PINYIN": "lěnɡ bu dīnɡ",
    "NGHĨA": "没有预料到，突然。也说“冷不防”、“冷孤丁”。"
  },
  {
    "STT": 169,
    "CHỮ": "M",
    "CỤM": "马鞍放在牛背上",
    "PINYIN": "mǎ ān fàng zài niú bèi shàng",
    "NGHĨA": "马鞍:放在马背上供人骑坐的器具。\r\n比喻两者不相匹配或对不上号。"
  },
  {
    "STT": 170,
    "CHỮ": "M",
    "CỤM": "马不停蹄，人不歇气",
    "PINYIN": "mǎ bù tíng tí, rén bù xiē qì",
    "NGHĨA": "见“人不解甲,马不停蹄”。"
  },
  {
    "STT": 171,
    "CHỮ": "M",
    "CỤM": "骂大街",
    "PINYIN": "mà dà jiē",
    "NGHĨA": "指当众粗野地谩骂别人。"
  },
  {
    "STT": 172,
    "CHỮ": "M",
    "CỤM": "马放南山，刀枪入库",
    "PINYIN": "mǎ fàng nán shān, dāo qiāng rù kù",
    "NGHĨA": "见“刀枪入库,马放南山”。"
  },
  {
    "STT": 173,
    "CHỮ": "M",
    "CỤM": "马拉串，驴驾辕",
    "PINYIN": "mǎ lā chuàn, lǘ jià yuán",
    "NGHĨA": "拉串:拉串套,辅助拉车,辕:车前驾牲畜的两根直木。"
  },
  {
    "STT": 174,
    "CHỮ": "M",
    "CỤM": "马屁拍到马腿上",
    "PINYIN": "mǎ pì pāi dào mǎ tuǐ shàng",
    "NGHĨA": "见“拍马拍到马蹄子上”。"
  },
  {
    "STT": 175,
    "CHỮ": "M",
    "CỤM": "马钱少，鞍钱多",
    "PINYIN": "mǎ qián shǎo, ān qián duō",
    "NGHĨA": "见“鞍钱倒比马钱贵”。"
  },
  {
    "STT": 176,
    "CHỮ": "M",
    "CỤM": "马勺碰锅沿",
    "PINYIN": "mǎ sháo pèng guō yán",
    "NGHĨA": "马勺:盛粥或盛饭用的大勺,多用木头 制成。\r\n比喻在一起生活或相处的人发生摩擦 或矛盾。"
  },
  {
    "STT": 177,
    "CHỮ": "M",
    "CỤM": "马死黄金尽",
    "PINYIN": "mǎ sǐ huáng jīn jìn",
    "NGHĨA": "比喻权势、钱财丧失殆尽。"
  },
  {
    "STT": 178,
    "CHỮ": "M",
    "CỤM": "马王爷见了也得让座",
    "PINYIN": "mǎ wáng yé jiàn le yě děi ràng zuò",
    "NGHĨA": "马王爷:神名,相传长着三只眼。\r\n形容恶势力得势猖狂,没人敢得罪(含嘲讽义)。"
  },
  {
    "STT": 179,
    "CHỮ": "M",
    "CỤM": "蚂蚁啃骨头",
    "PINYIN": "mǎ yǐ kěn gǔ tou",
    "NGHĨA": "比喻以微薄之力——点——点地干完大事。"
  },
  {
    "STT": 180,
    "CHỮ": "M",
    "CỤM": "买不起吊死绳",
    "PINYIN": "mǎi bù qǐ diào sǐ shéng",
    "NGHĨA": "形容穷困至极。"
  },
  {
    "STT": 181,
    "CHỮ": "M",
    "CỤM": "卖抄下",
    "PINYIN": "mài chā xià",
    "NGHĨA": "抄着手在一旁站着。\r\n指责人赖在一 旁不劳动。\r\n斥责人见他人有难不 帮忙。"
  },
  {
    "STT": 182,
    "CHỮ": "M",
    "CỤM": "卖长舌",
    "PINYIN": "mài cháng shé",
    "NGHĨA": "指人多嘴多舌。"
  },
  {
    "STT": 183,
    "CHỮ": "M",
    "CỤM": "买得起马，备不起鞍",
    "PINYIN": "mǎi de qǐ mǎ, bèi bù qǐ ān",
    "NGHĨA": "讥讽人大钱都出了,却舍不得花些 小钱。"
  },
  {
    "STT": 184,
    "CHỮ": "M",
    "CỤM": "买得起马，置得起鞍",
    "PINYIN": "mǎi de qǐ mǎ, zhì de qǐ ān",
    "NGHĨA": "比喻能出得起大钱就不会在乎几个小钱。"
  },
  {
    "STT": 185,
    "CHỮ": "M",
    "CỤM": "买豆腐掏了个肉价钱",
    "PINYIN": "mǎi dòu fu tāo le gè ròu jià qián",
    "NGHĨA": "指本不值钱的东西,却费周折花了大价钱。"
  },
  {
    "STT": 186,
    "CHỮ": "M",
    "CỤM": "卖风月",
    "PINYIN": "mài fēng yuè",
    "NGHĨA": "指女子卖弄姿色。\r\n也作“卖风情”。"
  },
  {
    "STT": 187,
    "CHỮ": "M",
    "CỤM": "埋伏笔",
    "PINYIN": "mái fú bǐ",
    "NGHĨA": "喻指为以后留下线索。"
  },
  {
    "STT": 188,
    "CHỮ": "M",
    "CỤM": "卖个眼前俏",
    "PINYIN": "mài gè yǎn qián qiào",
    "NGHĨA": "指做事只图表面成效,敷衍了事。"
  },
  {
    "STT": 189,
    "CHỮ": "M",
    "CỤM": "卖狗皮膏药",
    "PINYIN": "mài gǒu pí gāo yào",
    "NGHĨA": "狗皮膏药;中医外用膏药。将药膏涂 抹在小块狗皮上制成,能消痞止痛。旧 时常有走江湖的人制造假的狗皮膏药来 骗取钱财。\r\n比喻用巧言或假货骗人。"
  },
  {
    "STT": 190,
    "CHỮ": "M",
    "CỤM": "卖关节",
    "PINYIN": "mài guān jié",
    "NGHĨA": "指暗中收受贿赂,通过职权之便为别 人办事或做人情。"
  },
  {
    "STT": 191,
    "CHỮ": "M",
    "CỤM": "卖后悔药",
    "PINYIN": "mài hòu huǐ yào",
    "NGHĨA": "见“吃后悔药”。"
  },
  {
    "STT": 192,
    "CHỮ": "M",
    "CỤM": "卖灰面碰见吹大风",
    "PINYIN": "mài huī miàn pèng jiàn chuī dà fēng",
    "NGHĨA": "灰面:石灰面。\r\n比喻事不凑巧,偏赶上倒霉事。"
  },
  {
    "STT": 193,
    "CHỮ": "M",
    "CỤM": "卖架子",
    "PINYIN": "mài jià zi",
    "NGHĨA": "指卖弄、显示自认为高贵的身份、地位。"
  },
  {
    "STT": 194,
    "CHỮ": "M",
    "CỤM": "买金的遇见卖金的",
    "PINYIN": "mǎi jīn de yù jiàn mài jīn de",
    "NGHĨA": "比喻事情十分凑巧。"
  },
  {
    "STT": 195,
    "CHỮ": "M",
    "CỤM": "买金偏撞不着卖金的",
    "PINYIN": "mǎi jīn piān zhuàng bù zháo mài jīn de",
    "NGHĨA": "比喻事情偏不那么凑巧。多指佳人 难逢才子。"
  },
  {
    "STT": 196,
    "CHỮ": "M",
    "CỤM": "卖老俏",
    "PINYIN": "mài lǎo qiào",
    "NGHĨA": "指年老之人在人前招摇、卖弄。"
  },
  {
    "STT": 197,
    "CHỮ": "M",
    "CỤM": "卖了儿子招女婿",
    "PINYIN": "mài le ér zi zhāo nǚ xù",
    "NGHĨA": "招女婿:招人入赘做女婿。\r\n比喻瞎折腾。"
  },
  {
    "STT": 198,
    "CHỮ": "M",
    "CỤM": "卖了馄饨买面吃",
    "PINYIN": "mài le hún tun mǎi miàn chī",
    "NGHĨA": "比喻舍优取劣。"
  },
  {
    "STT": 199,
    "CHỮ": "M",
    "CỤM": "卖路子",
    "PINYIN": "mài lù zi",
    "NGHĨA": "指断了财路。"
  },
  {
    "STT": 200,
    "CHỮ": "M",
    "CỤM": "卖破绽",
    "PINYIN": "mài pò zhàn",
    "NGHĨA": "指故作失误,有意给对方漏洞,诱使对 方上当。"
  },
  {
    "STT": 201,
    "CHỮ": "M",
    "CỤM": "买一个，饶一个",
    "PINYIN": "mǎi yī gè, ráo yī gè",
    "NGHĨA": "指获得一个又白得一个。"
  },
  {
    "STT": 202,
    "CHỮ": "M",
    "CỤM": "卖嘴皮",
    "PINYIN": "mài zuǐ pí",
    "NGHĨA": "指光说不做。\r\n指人夸夸其谈。"
  },
  {
    "STT": 203,
    "CHỮ": "M",
    "CỤM": "满脑袋高粱花子",
    "PINYIN": "mǎn nǎo dài gāo liáng huā zi",
    "NGHĨA": "指人农民出身。 \r\n也作“满头高粱花”。"
  },
  {
    "STT": 204,
    "CHỮ": "M",
    "CỤM": "满堂红",
    "PINYIN": "mǎn táng hóng",
    "NGHĨA": "原指绢灯的一种。\r\n比喻全面胜利或到 处兴旺。"
  },
  {
    "STT": 205,
    "CHỮ": "M",
    "CỤM": "满天开价，就地还钱",
    "PINYIN": "mǎn tiān kāi jià, jiù dì hái qián",
    "NGHĨA": "见“漫天要价,就地还钱”。"
  },
  {
    "STT": 206,
    "CHỮ": "M",
    "CỤM": "满桶油打翻，糖饼上刮屑",
    "PINYIN": "mǎn tǒng yóu dǎ fān, táng bǐng shàng guā xiè",
    "NGHĨA": "见“大篓撒油,满地捡芝麻”。"
  },
  {
    "STT": 207,
    "CHỮ": "M",
    "CỤM": "馒头落地狗造化",
    "PINYIN": "mán tou luò dì gǒu zào huà",
    "NGHĨA": "造化:福分;幸运。\r\n馒头落在地上,成了狗的美食。戏骂 人意外地得到福分。"
  },
  {
    "STT": 208,
    "CHỮ": "M",
    "CỤM": "满嘴飞出唾沫星",
    "PINYIN": "mǎn zuǐ fēi chū tuò mò xīng",
    "NGHĨA": "形容人情绪激动,话语滔滔而来。"
  },
  {
    "STT": 209,
    "CHỮ": "M",
    "CỤM": "满嘴跑火车",
    "PINYIN": "mǎn zuǐ pǎo huǒ chē",
    "NGHĨA": "形容人说话浮夸,不切实际。"
  },
  {
    "STT": 210,
    "CHỮ": "M",
    "CỤM": "满嘴跑舌头",
    "PINYIN": "mǎn zuǐ pǎo shé tou",
    "NGHĨA": "形容人能言善辩。"
  },
  {
    "STT": 211,
    "CHỮ": "M",
    "CỤM": "盲人骑瞎马",
    "PINYIN": "máng rén qí xiā mǎ",
    "NGHĨA": "指人的某段经历是乱闯过来的。\r\n比喻人育日行动。"
  },
  {
    "STT": 212,
    "CHỮ": "M",
    "CỤM": "忙中遇着腿抽筋",
    "PINYIN": "máng zhōng yù zhe tuǐ chōu jīn",
    "NGHĨA": "比喻忙正事时偏碰到別的事干扰。"
  },
  {
    "STT": 213,
    "CHỮ": "M",
    "CỤM": "貌不惊人，言不出众",
    "PINYIN": "mào bù jīng rén, yán bù chū zhòng",
    "NGHĨA": "指人的才貌很一般,无出众之处。\r\n也作“言不压众,貌不惊人”。"
  },
  {
    "STT": 214,
    "CHỮ": "M",
    "CỤM": "猫吃腥",
    "PINYIN": "māo chī xīng",
    "NGHĨA": "本指猫天性爱吃荤食。\r\n比喻男人好色。\r\n比喻人贪恋财物。"
  },
  {
    "STT": 215,
    "CHỮ": "M",
    "CỤM": "猫对爪儿",
    "PINYIN": "māo duì zhǎor",
    "NGHĨA": "比喻双方发生争斗。"
  },
  {
    "STT": 216,
    "CHỮ": "M",
    "CỤM": "猫儿见了鱼鲜饭",
    "PINYIN": "māo ér jiàn le yú xiān fàn",
    "NGHĨA": "形容人见到心爱的人或物急欲得手的 神态或心情。"
  },
  {
    "STT": 217,
    "CHỮ": "M",
    "CỤM": "猫儿哭老鼠",
    "PINYIN": "māo ér kū lǎo shǔ",
    "NGHĨA": "比喻假装同情受害者。"
  },
  {
    "STT": 218,
    "CHỮ": "M",
    "CỤM": "猫儿要老鼠",
    "PINYIN": "māo ér yào lǎo shǔ",
    "NGHĨA": "指强权者玩弄、欺压弱势者。"
  },
  {
    "STT": 219,
    "CHỮ": "M",
    "CỤM": "猫盖屎",
    "PINYIN": "māo gài shǐ",
    "NGHĨA": "猫很爱干净,拉屎后总会用东西掩埋。\r\n比喻掩盖事实,蒙骗别人。"
  },
  {
    "STT": 220,
    "CHỮ": "M",
    "CỤM": "冒坏水儿",
    "PINYIN": "mào huài shuǐr",
    "NGHĨA": "比喻使坏心眼儿,出坏主意。"
  },
  {
    "STT": 221,
    "CHỮ": "M",
    "CỤM": "冒火星",
    "PINYIN": "mào huǒ xīng",
    "NGHĨA": "形容人发怒时火气十足的神情。"
  },
  {
    "STT": 222,
    "CHỮ": "M",
    "CỤM": "猫口里挖鳅",
    "PINYIN": "māo kǒu lǐ wā qiū",
    "NGHĨA": "鳅:泥鳅,鱼的一种,常生活在河湖、池 沼、水田中,潜伏泥中,猫喜食。\r\n比喻事情很难办到。"
  },
  {
    "STT": 223,
    "CHỮ": "M",
    "CỤM": "毛了手脚",
    "PINYIN": "máo le shǒu jiǎo",
    "NGHĨA": "见“慌了手脚”。"
  },
  {
    "STT": 224,
    "CHỮ": "M",
    "CỤM": "冒凉腔",
    "PINYIN": "mào liáng qiāng",
    "NGHĨA": "见“打凉腔”。"
  },
  {
    "STT": 225,
    "CHỮ": "M",
    "CỤM": "毛驴不行埋怨轴棍子打脸",
    "PINYIN": "máo lǘ bù xíng mán yuàn zhóu gùn zi dǎ liǎn",
    "NGHĨA": "轴棍子:套绳后面系着的横棍,用于连 接磨盘。腚:屁股。\r\n比喻自己能力不行而反怨条件不利。"
  },
  {
    "STT": 226,
    "CHỮ": "M",
    "CỤM": "冒傻气",
    "PINYIN": "mào shǎ qì",
    "NGHĨA": "指说话、做事幼稚,不老到。"
  },
  {
    "STT": 227,
    "CHỮ": "M",
    "CỤM": "猫嫌狗不是",
    "PINYIN": "māo xián gǒu bù shì",
    "NGHĨA": "比喻嫌这怨那,成心和人作对。"
  },
  {
    "STT": 228,
    "CHỮ": "M",
    "CỤM": "冒一身冷汗",
    "PINYIN": "mào yī shēn lěng hàn",
    "NGHĨA": "形容人非常紧张、恐惧。"
  },
  {
    "STT": 229,
    "CHỮ": "M",
    "CỤM": "猫捉老鼠狗看门",
    "PINYIN": "māo zhuō lǎo shǔ gǒu kān mén",
    "NGHĨA": "比喻各司其职。"
  },
  {
    "STT": 230,
    "CHỮ": "M",
    "CỤM": "猫子屙屎自己盖",
    "PINYIN": "māo zi ē shǐ zì jǐ gài",
    "NGHĨA": "比喻自己做下的事自己来收场。"
  },
  {
    "STT": 231,
    "CHỮ": "M",
    "CỤM": "没把柄",
    "PINYIN": "méi bǎ bǐng",
    "NGHĨA": "把柄:器物上便于手拿的部分。\r\n比喻没有被攻击或要挟的短处、过失。"
  },
  {
    "STT": 232,
    "CHỮ": "M",
    "CỤM": "没白日没黑夜",
    "PINYIN": "méi bái rì méi hēi yè",
    "NGHĨA": "指人不分昼夜地做事。"
  },
  {
    "STT": 233,
    "CHỮ": "M",
    "CỤM": "没奔头",
    "PINYIN": "méi bēn tou",
    "NGHĨA": "指没有可追求的前途或希望。"
  },
  {
    "STT": 234,
    "CHỮ": "M",
    "CỤM": "没鼻子没脸",
    "PINYIN": "méi bí zi méi liǎn",
    "NGHĨA": "指批评人一点儿都不顾及对方脸面。"
  },
  {
    "STT": 235,
    "CHỮ": "M",
    "CỤM": "没病揽伤寒",
    "PINYIN": "méi bìng lǎn shāng hán",
    "NGHĨA": "比喻自找麻烦。"
  },
  {
    "STT": 236,
    "CHỮ": "M",
    "CỤM": "没槽道",
    "PINYIN": "méi cáo dào",
    "NGHĨA": "槽道:本指牲口槽,比喻规矩。\r\n比喻没规矩,不正经。"
  },
  {
    "STT": 237,
    "CHỮ": "M",
    "CỤM": "没成色",
    "PINYIN": "méi chéng sè",
    "NGHĨA": "成色:体统。\r\n指行事不成体统,没样子。"
  },
  {
    "STT": 238,
    "CHỮ": "M",
    "CỤM": "没吃过猪肉，也见过猪跑",
    "PINYIN": "méi chī guò zhū ròu, yě jiàn guò zhū pǎo",
    "NGHĨA": "比喻虽未亲身经历,但还有一定的见识。"
  },
  {
    "STT": 239,
    "CHỮ": "M",
    "CỤM": "没出路",
    "PINYIN": "méi chū lù",
    "NGHĨA": "也作“没吃过猪肉,还没见过猪跑”, “没吃过猪肉,还没听过猪哼哼”。"
  },
  {
    "STT": 240,
    "CHỮ": "M",
    "CỤM": "没大小",
    "PINYIN": "méi dà xiǎo",
    "NGHĨA": "比喻好处没得到反而惹了麻烦。"
  },
  {
    "STT": 241,
    "CHỮ": "M",
    "CỤM": "没打着狐狸惹一身骚",
    "PINYIN": "méi dǎ zhe hú li rě yī shēn sāo",
    "NGHĨA": "指没前途。"
  },
  {
    "STT": 242,
    "CHỮ": "M",
    "CỤM": "没动静",
    "PINYIN": "méi dòng jing",
    "NGHĨA": "指不注意尊卑、长幼之间的关系,没规矩。"
  },
  {
    "STT": 243,
    "CHỮ": "M",
    "CỤM": "没耳朵",
    "PINYIN": "méi ěr duo",
    "NGHĨA": "指安静,没有声音。\r\n指没有进展 的消息。"
  },
  {
    "STT": 244,
    "CHỮ": "M",
    "CỤM": "没耳朵听着，也有鼻子闻着",
    "PINYIN": "méi ěr duo tīng zhe, yě yǒu bí zi wén zhe",
    "NGHĨA": "讥讽人听而不闻或糊涂没记性。\r\n也作“没耳性”。"
  },
  {
    "STT": 245,
    "CHỮ": "M",
    "CỤM": "没二话",
    "PINYIN": "méi èr huà",
    "NGHĨA": "指不讲求任何条件,爽快地应承人。"
  },
  {
    "STT": 246,
    "CHỮ": "M",
    "CỤM": "没饭吃",
    "PINYIN": "méi fàn chī",
    "NGHĨA": "指没有谋生的手段,或指人吃不开。"
  },
  {
    "STT": 247,
    "CHỮ": "M",
    "CỤM": "没缝也要下蛆",
    "PINYIN": "méi fèng yě yào xià qū",
    "NGHĨA": "比喻无端寻衅滋事。"
  },
  {
    "STT": 248,
    "CHỮ": "M",
    "CỤM": "没给好嘴脸",
    "PINYIN": "méi gěi hǎo zuǐ liǎn",
    "NGHĨA": "指对人态度冷淡,有意排斥对方。"
  },
  {
    "STT": 249,
    "CHỮ": "M",
    "CỤM": "没给孔夫子磕过头",
    "PINYIN": "méi gěi kǒng fū zǐ kē guò tóu",
    "NGHĨA": "旧时读书,必须先给孔夫子磕头行礼。\r\n指没上过学。"
  },
  {
    "STT": 250,
    "CHỮ": "M",
    "CỤM": "没根基",
    "PINYIN": "méi gēn jī",
    "NGHĨA": "比喻没基础,无势力。"
  },
  {
    "STT": 251,
    "CHỮ": "M",
    "CỤM": "没骨头",
    "PINYIN": "méi gǔ tou",
    "NGHĨA": "形容人懦弱,没志气。\r\n也作“没骨气”。"
  },
  {
    "STT": 252,
    "CHỮ": "M",
    "CỤM": "没过河就拆桥",
    "PINYIN": "méi guò hé jiù chāi qiáo",
    "NGHĨA": "比喻还没得到好处或达到目的,就迫 不及待地先把恩人抛开。"
  },
  {
    "STT": 253,
    "CHỮ": "M",
    "CỤM": "没好果子吃",
    "PINYIN": "méi hǎo guǒ zi chī",
    "NGHĨA": "比喻没好结果。"
  },
  {
    "STT": 254,
    "CHỮ": "M",
    "CỤM": "没合槽就先咬群",
    "PINYIN": "méi hé cáo jiù xiān yǎo qún",
    "NGHĨA": "比喻还没有和人相处就先闹矛盾。"
  },
  {
    "STT": 255,
    "CHỮ": "M",
    "CỤM": "没合眼",
    "PINYIN": "méi hé yǎn",
    "NGHĨA": "指没睡觉。"
  },
  {
    "STT": 256,
    "CHỮ": "M",
    "CỤM": "没活口",
    "PINYIN": "méi huó kǒu",
    "NGHĨA": "指话已说死,无回旋余地。\r\n指失 去活人口供。"
  },
  {
    "STT": 257,
    "CHỮ": "M",
    "CỤM": "没活路",
    "PINYIN": "méi huó lù",
    "NGHĨA": "指没有生存的希望。"
  },
  {
    "STT": 258,
    "CHỮ": "M",
    "CỤM": "没火种",
    "PINYIN": "méi huǒ zhǒng",
    "NGHĨA": "比喻没有传宗接代的后人或接班人。"
  },
  {
    "STT": 259,
    "CHỮ": "M",
    "CỤM": "没脊骨",
    "PINYIN": "méi jǐ gǔ",
    "NGHĨA": "指没志气或没主见。"
  },
  {
    "STT": 260,
    "CHỮ": "M",
    "CỤM": "没有架子",
    "PINYIN": "méi jià zi",
    "NGHĨA": "比喻待人和蔼诚恳，没有一点儿自高自大、装腔作势的样子。"
  },
  {
    "STT": 261,
    "CHỮ": "M",
    "CỤM": "没见过簸箕大的天",
    "PINYIN": "méi jiàn guo bò ji dà de tiān",
    "NGHĨA": "比喻没见过大的世面或没有多的 见识。"
  },
  {
    "STT": 262,
    "CHỮ": "M",
    "CỤM": "没见过世面",
    "PINYIN": "méi jiàn guo shì miàn",
    "NGHĨA": "世面:指形形色色的社会情况。\r\n指经见少,见识浅。"
  },
  {
    "STT": 263,
    "CHỮ": "M",
    "CỤM": "没经纬",
    "PINYIN": "méi jīng wěi",
    "NGHĨA": "比喻说话或办事没条理。"
  },
  {
    "STT": 264,
    "CHỮ": "M",
    "CỤM": "没靠山",
    "PINYIN": "méi kào shān",
    "NGHĨA": "比喻没有可以倚仗的人或势力。 \r\n也作“无靠山”。"
  },
  {
    "STT": 265,
    "CHỮ": "M",
    "CỤM": "没了王的蜜蜂",
    "PINYIN": "méi le wáng de mì fēng",
    "NGHĨA": "比喻失去管束、胡乱折腾的人。"
  },
  {
    "STT": 266,
    "CHỮ": "M",
    "CỤM": "没理占三分",
    "PINYIN": "méi lǐ zhàn sān fēn",
    "NGHĨA": "见“无理搅三分”。"
  },
  {
    "STT": 267,
    "CHỮ": "M",
    "CỤM": "没脸面",
    "PINYIN": "méi liǎn miàn",
    "NGHĨA": "指丢人,没面子。 也作“没脸皮”。"
  },
  {
    "STT": 268,
    "CHỮ": "M",
    "CỤM": "没笼头的马",
    "PINYIN": "méi lóng tóu de mǎ",
    "NGHĨA": "比喻心野而不受约束的人。 \r\n也作“脱掉笼头的马”。"
  },
  {
    "STT": 269,
    "CHỮ": "M",
    "CỤM": "眉毛眼睛都会说话",
    "PINYIN": "méi mao yǎn jing dōu huì shuō huà",
    "NGHĨA": "形容人灵秀,善于眉目传情。"
  },
  {
    "STT": 270,
    "CHỮ": "M",
    "CỤM": "没门路",
    "PINYIN": "méi mén lù",
    "NGHĨA": "门路:特指能达到个人日的的途径。\r\n指办事没有渠道,拉不上关系。\r\n也作“没门子”、“无门路”。"
  },
  {
    "STT": 271,
    "CHỮ": "M",
    "CỤM": "没脾气",
    "PINYIN": "méi pí qì",
    "NGHĨA": "指对人无可奈何。"
  },
  {
    "STT": 272,
    "CHỮ": "M",
    "CỤM": "没前后眼",
    "PINYIN": "méi qián hòu yǎn",
    "NGHĨA": "比喻无法预料事态的发展和结果。\r\n也作“没长后眼”。"
  },
  {
    "STT": 273,
    "CHỮ": "M",
    "CỤM": "没请来财神，倒贴了些香表纸银",
    "PINYIN": "méi qǐng lái cái shén, dào tiē le xiē xiāng biǎo zhǐ yín",
    "NGHĨA": "香表:即黄表,祭祀时烧化的黄表纸。\r\n纸银:即纸钱,给死人或鬼神用。\r\n指钱没捞到,反而受了损失。"
  },
  {
    "STT": 274,
    "CHỮ": "M",
    "CỤM": "没人味",
    "PINYIN": "méi rén wèi",
    "NGHĨA": "指言行卑劣,不齿于人。"
  },
  {
    "STT": 275,
    "CHỮ": "M",
    "CỤM": "没入脚处",
    "PINYIN": "méi rù jiǎo chù",
    "NGHĨA": "形容欢喜或慌乱得手足无措,不知如 何是好。"
  },
  {
    "STT": 276,
    "CHỮ": "M",
    "CỤM": "没三顿饱饭，有三顿饱气",
    "PINYIN": "méi sān dùn bǎo fàn, yǒu sān dùn bǎo qì",
    "NGHĨA": "形容生活极不顺心。"
  },
  {
    "STT": 277,
    "CHỮ": "M",
    "CỤM": "没杀人反沾一身血",
    "PINYIN": "méi shā rén fǎn zhān yī shēn xuè",
    "NGHĨA": "比喻无辜受连累。"
  },
  {
    "STT": 278,
    "CHỮ": "M",
    "CỤM": "没市场",
    "PINYIN": "méi shì chǎng",
    "NGHĨA": "比喻思想言论、谣言等没有引起反响。"
  },
  {
    "STT": 279,
    "CHỮ": "M",
    "CỤM": "没水分",
    "PINYIN": "méi shuǐ fèn",
    "NGHĨA": "喻指真实可信,无虚夸成分。"
  },
  {
    "STT": 280,
    "CHỮ": "M",
    "CỤM": "没死活",
    "PINYIN": "méi sǐ huó",
    "NGHĨA": "形容做事拼命,不顾一切。"
  },
  {
    "STT": 281,
    "CHỮ": "M",
    "CỤM": "没头脑",
    "PINYIN": "méi tóu nǎo",
    "NGHĨA": "形容人思想简单,不明事理。"
  },
  {
    "STT": 282,
    "CHỮ": "M",
    "CỤM": "眉头一皱，计上心来",
    "PINYIN": "méi tóu yī zhòu, jì shàng xīn lái",
    "NGHĨA": "指稍作思考,便有了主意。\r\n也作“眉头方一皱,妙计上心来”、“眉 头一蹙,计上心来”、“眉头一皱,心生一 计”、“眉头一纵,计上心来”。"
  },
  {
    "STT": 283,
    "CHỮ": "M",
    "CỤM": "没味道",
    "PINYIN": "méi wèi dào",
    "NGHĨA": "指没意思,没趣味。"
  },
  {
    "STT": 284,
    "CHỮ": "M",
    "CỤM": "没胃口",
    "PINYIN": "méi wèi kǒu",
    "NGHĨA": "指没有食欲。"
  },
  {
    "STT": 285,
    "CHỮ": "M",
    "CỤM": "没心肠",
    "PINYIN": "méi xīn cháng",
    "NGHĨA": "指没心思,无兴致。"
  },
  {
    "STT": 286,
    "CHỮ": "M",
    "CỤM": "没心肺",
    "PINYIN": "méi xīn fèi",
    "NGHĨA": "形容人头脑简单,不在乎任何事。\r\n也作“没心没肺”。"
  },
  {
    "STT": 287,
    "CHỮ": "M",
    "CỤM": "没心肝",
    "PINYIN": "méi xīn gān",
    "NGHĨA": "斥责人没良心或对人狠毒。"
  },
  {
    "STT": 288,
    "CHỮ": "M",
    "CỤM": "没心没肺",
    "PINYIN": "méi xīn méi fèi",
    "NGHĨA": "比喻没良心，品质恶劣。\r\n比喻头脑简单，不关心时势。"
  },
  {
    "STT": 289,
    "CHỮ": "M",
    "CỤM": "没心眼",
    "PINYIN": "méi xīn yǎn",
    "NGHĨA": "形容人思想单纯,无心计。"
  },
  {
    "STT": 290,
    "CHỮ": "M",
    "CỤM": "没眼珠",
    "PINYIN": "méi yǎn zhū",
    "NGHĨA": "指没眼力,不辨好坏。"
  },
  {
    "STT": 291,
    "CHỮ": "M",
    "CỤM": "没印把子",
    "PINYIN": "méi yìn bǎ zi",
    "NGHĨA": "印把子:行政机关的图章的把儿,代指 政权。\r\n指手中无权。"
  },
  {
    "STT": 292,
    "CHỮ": "M",
    "CỤM": "没影子",
    "PINYIN": "méi yǐng zi",
    "NGHĨA": "指不见踪影。\r\n喻指某事物根本不存在。"
  },
  {
    "STT": 293,
    "CHỮ": "M",
    "CỤM": "没有功劳，也有苦劳",
    "PINYIN": "méi yǒu gōng láo, yě yǒu kǔ láo",
    "NGHĨA": "虽谈不上贡献,但也付出了辛苦。多 指应对人付出的辛苦予以肯定。"
  },
  {
    "STT": 294,
    "CHỮ": "M",
    "CỤM": "没有鸡蛋照样做槽子糕",
    "PINYIN": "méi yǒu jī dàn zhào yàng zuò cáo zi gāo",
    "NGHĨA": "比喻缺了某个人照样能办成事。"
  },
  {
    "STT": 295,
    "CHỮ": "M",
    "CỤM": "没有金刚钻，偏要揽瓷器活",
    "PINYIN": "méi yǒu jīn gāng zuàn, piān yào lǎn cí qì huó",
    "NGHĨA": "金刚钻:明·李时珍《本草纲目,金石 四·金刚石》:“金刚钻,其砂可以钻玉补 瓷,故谓之钻。” \r\n比喻没有做某事的技能或条件,却偏要承揽。"
  },
  {
    "STT": 296,
    "CHỮ": "M",
    "CỤM": "没有他地球照样转",
    "PINYIN": "méi yǒu tā dì qiú zhào yàng zhuǎn",
    "NGHĨA": "指缺了某人,原有的生活或事情仍会 照旧进行。"
  },
  {
    "STT": 297,
    "CHỮ": "M",
    "CỤM": "没有张屠夫，不吃浑毛猪",
    "PINYIN": "méi yǒu zhāng tú fū, bù chī hún máo zhū",
    "NGHĨA": "比喻缺了某人或某种条件,事情照样 能够办成。\r\n也作“死了张屠夫,不吃浑毛猪”。"
  },
  {
    "STT": 298,
    "CHỮ": "M",
    "CỤM": "没长眼",
    "PINYIN": "méi zhǎng yǎn",
    "NGHĨA": "讥讽人视而不见或不辨是非善恶。"
  },
  {
    "STT": 299,
    "CHỮ": "M",
    "CỤM": "昧着惺惺使糊涂",
    "PINYIN": "mèi zhe xīng xīng shǐ hú tu",
    "NGHĨA": "指心里明白却故意装糊涂。"
  },
  {
    "STT": 300,
    "CHỮ": "M",
    "CỤM": "没正形",
    "PINYIN": "méi zhèng xíng",
    "NGHĨA": "指人言行不庄重。"
  },
  {
    "STT": 301,
    "CHỮ": "M",
    "CỤM": "没咒念",
    "PINYIN": "méi zhòu niàn",
    "NGHĨA": "比喻无一点办法、手段来应对。"
  },
  {
    "STT": 302,
    "CHỮ": "M",
    "CỤM": "没主心骨",
    "PINYIN": "méi zhǔ xīn gǔ",
    "NGHĨA": "指人没主见。\r\n指失去可依靠的人。"
  },
  {
    "STT": 303,
    "CHỮ": "M",
    "CỤM": "没罪找枷扣",
    "PINYIN": "méi zuì zhǎo jiā kòu",
    "NGHĨA": "旧时套在罪犯脖子上的一种木 制刑具。\r\n嘲讽人没事自己找罪受。"
  },
  {
    "STT": 304,
    "CHỮ": "M",
    "CỤM": "没做理会处",
    "PINYIN": "méi zuò lǐ huì chù",
    "NGHĨA": "理会:处置。\r\n指不知该如何是好。 也作“没理会处”。"
  },
  {
    "STT": 305,
    "CHỮ": "M",
    "CỤM": "门边跌倒赖门神，灶边跌倒赖灶神",
    "PINYIN": "mén biān diē dǎo lài mén shén, zào biān diē dǎo lài zào shén",
    "NGHĨA": "比喻失败了不找主观原因,却赖这怨 那乱找借口。\r\n也作“门边跌倒赖门神,灶边跌倒怨灶 神”、“门边摔倒赖门神,灶边摔倒怨灶 神”。"
  },
  {
    "STT": 306,
    "CHỮ": "M",
    "CỤM": "门不当户不对",
    "PINYIN": "mén bù dàng hù bù duì",
    "NGHĨA": "指联姻双方家庭的社会地位和经济条 件都有悬殊,不相配。"
  },
  {
    "STT": 307,
    "CHỮ": "M",
    "CỤM": "门槛精",
    "PINYIN": "mén kǎn jīng",
    "NGHĨA": "形容人精明,会找窍门,善占便宜。"
  },
  {
    "STT": 308,
    "CHỮ": "M",
    "CỤM": "门坎儿高",
    "PINYIN": "mén kǎnr gāo",
    "NGHĨA": "比喻界限(多指社会地位)高。"
  },
  {
    "STT": 309,
    "CHỮ": "M",
    "CỤM": "门头硬",
    "PINYIN": "mén tóu yìng",
    "NGHĨA": "喻指家庭背景大,势力强。"
  },
  {
    "STT": 310,
    "CHỮ": "M",
    "CỤM": "闷在葫芦里",
    "PINYIN": "mèn zài hú lu lǐ",
    "NGHĨA": "见“蒙在鼓里”。"
  },
  {
    "STT": 311,
    "CHỮ": "M",
    "CỤM": "蒙虎皮",
    "PINYIN": "méng hǔ pí",
    "NGHĨA": "比喻改换行头,假装正派。"
  },
  {
    "STT": 312,
    "CHỮ": "M",
    "CỤM": "米缸里头长青草",
    "PINYIN": "mǐ gāng lǐ tou zhǎng qīng cǎo",
    "NGHĨA": "指断粮已久。形容穷困至极。"
  },
  {
    "STT": 313,
    "CHỮ": "M",
    "CỤM": "米箩里跳入糠箩里",
    "PINYIN": "mǐ luó lǐ tiào rù kāng luó lǐ",
    "NGHĨA": "比喻舍弃富贵之家,走进贫苦之地。"
  },
  {
    "STT": 314,
    "CHỮ": "M",
    "CỤM": "面朝黄土背朝天",
    "PINYIN": "miàn cháo huáng tǔ bèi cháo tiān",
    "NGHĨA": "形容农民种地的艰辛。 也作“脸朝黄土背朝天”。"
  },
  {
    "STT": 315,
    "CHỮ": "M",
    "CỤM": "面和心不和",
    "PINYIN": "miàn hé xīn bù hé",
    "NGHĨA": "指人表面彼此和气,内心却互有意见。"
  },
  {
    "STT": 316,
    "CHỮ": "M",
    "CỤM": "棉花耳朵风车心",
    "PINYIN": "mián huā ěr duo fēng chē xīn",
    "NGHĨA": "形容人耳软心活没主见,容易听信他 人的话而改变主意。"
  },
  {
    "STT": 317,
    "CHỮ": "M",
    "CỤM": "面孔冷",
    "PINYIN": "miàn kǒng lěng",
    "NGHĨA": "形容人神情冷漠,不友善。"
  },
  {
    "STT": 318,
    "CHỮ": "M",
    "CỤM": "免口舌",
    "PINYIN": "miǎn kǒu shé",
    "NGHĨA": "见“省口舌”。"
  },
  {
    "STT": 319,
    "CHỮ": "M",
    "CỤM": "绵里针，肉里刺",
    "PINYIN": "mián lǐ zhēn, ròu lǐ cì",
    "NGHĨA": "比喻表面柔和,内心歹毒。"
  },
  {
    "STT": 320,
    "CHỮ": "M",
    "CỤM": "面面光",
    "PINYIN": "miàn miàn guāng",
    "NGHĨA": "形容人圆滑世故,各方面都能周全 应付。\r\n也作“两面光”。"
  },
  {
    "STT": 321,
    "CHỮ": "M",
    "CỤM": "面前起火，背后冒烟",
    "PINYIN": "miàn qián qǐ huǒ, bèi hòu mào yān",
    "NGHĨA": "形容处境极端困厄。"
  },
  {
    "STT": 322,
    "CHỮ": "M",
    "CỤM": "面上不好看",
    "PINYIN": "miàn shàng bù hǎo kàn",
    "NGHĨA": "指某种行为有损颜面,不光彩。 也作“面上没光辉”。"
  },
  {
    "STT": 323,
    "CHỮ": "M",
    "CỤM": "面似靴皮厚",
    "PINYIN": "miàn sì xuē pí hòu",
    "NGHĨA": "形容人不顾廉耻。"
  },
  {
    "STT": 324,
    "CHỮ": "M",
    "CỤM": "面子上落不下",
    "PINYIN": "miàn zi shàng luò bù xià",
    "NGHĨA": "指感到尷尬、难堪。"
  },
  {
    "STT": 325,
    "CHỮ": "M",
    "CỤM": "面儿光光嘴儿亮",
    "PINYIN": "miànr guāng guāng zuǐr liàng",
    "NGHĨA": "指人相貌漂亮,能说会道。多讥讽对 方看起来还人模人样的。"
  },
  {
    "STT": 326,
    "CHỮ": "M",
    "CỤM": "描不成画不就",
    "PINYIN": "miáo bù chéng huà bù jiù",
    "NGHĨA": "画工难以画出。形容女子生得极美。"
  },
  {
    "STT": 327,
    "CHỮ": "M",
    "CỤM": "庙穷和尚富",
    "PINYIN": "miào qióng hé shang fù",
    "NGHĨA": "指集体的钱财被个人吞占,以致集体 贫穷,个人富有。"
  },
  {
    "STT": 328,
    "CHỮ": "M",
    "CỤM": "庙是那个庙，神不是那个神",
    "PINYIN": "miào shì nà gè miào, shén bù shì nà gè shén",
    "NGHĨA": "指地方依旧,而主事的人变了。"
  },
  {
    "STT": 329,
    "CHỮ": "M",
    "CỤM": "庙小牌子大",
    "PINYIN": "miào xiǎo pái zi dà",
    "NGHĨA": "指名不副实(含讥讽义)。"
  },
  {
    "STT": 330,
    "CHỮ": "M",
    "CỤM": "庙小装不了大菩萨",
    "PINYIN": "miào xiǎo zhuāng bù liǎo dà pú sà",
    "NGHĨA": "比喻小地方容不下大人物。拒绝接受 来者的委婉之语。\r\n也作“小庙蹲不下大菩萨”。"
  },
  {
    "STT": 331,
    "CHỮ": "M",
    "CỤM": "灭威风",
    "PINYIN": "miè wēi fēng",
    "NGHĨA": "指压制、消灭人或事物的威势、声势。\r\n也作“杀威风”。"
  },
  {
    "STT": 332,
    "CHỮ": "M",
    "CỤM": "名师出高徒",
    "PINYIN": "míng shī chū gāo tú",
    "NGHĨA": "名师有成就,要求严格,就能培养出高 材生。"
  },
  {
    "STT": 333,
    "CHỮ": "M",
    "CỤM": "明是一盆火，暗是一把刀",
    "PINYIN": "míng shì yī pén huǒ, àn shì yī bǎ dāo",
    "NGHĨA": "比喻表面对人亲热,暗里却使手段 害人。"
  },
  {
    "STT": 334,
    "CHỮ": "M",
    "CỤM": "明修栈道，暗渡陈仓",
    "PINYIN": "míng xiū zhàn dào, àn dù chén cāng",
    "NGHĨA": "栈道:在险绝处傍山架木而 成的一种道路。陈仓:古县名,在今陕西 省宝鸡市东,古为攻守战略要地。\r\n楚汉相争故事,刘邦将要从汉中出兵 攻打关中时,听取张良、韩信的计策,表"
  },
  {
    "STT": 335,
    "CHỮ": "M",
    "CỤM": "名又不成，功又不就",
    "PINYIN": "míng yòu bù chéng, gōng yòu bù jiù",
    "NGHĨA": "指人功名全无,一事无成。"
  },
  {
    "STT": 336,
    "CHỮ": "M",
    "CỤM": "抹下脸",
    "PINYIN": "mǒ xià liǎn",
    "NGHĨA": "指突然翻脸,变得严厉而不讲情面。\r\n也作“抹脸皮”。"
  },
  {
    "STT": 337,
    "CHỮ": "M",
    "CỤM": "昧着惺惺使糊涂",
    "PINYIN": "mèi zhe xīng xīng shǐ hú tu",
    "NGHĨA": "指心里明白却故意装糊涂。"
  },
  {
    "STT": 338,
    "CHỮ": "M",
    "CỤM": "没正形",
    "PINYIN": "méi zhèng xíng",
    "NGHĨA": "指人言行不庄重。"
  },
  {
    "STT": 339,
    "CHỮ": "M",
    "CỤM": "没眼色",
    "PINYIN": "méi yǎn sè",
    "NGHĨA": "比喻不会看情况办事，不知趣儿。"
  },
  {
    "STT": 340,
    "CHỮ": "M",
    "CỤM": "没眼珠",
    "PINYIN": "méi yǎn zhū",
    "NGHĨA": "指没眼力,不辨好坏。"
  },
  {
    "STT": 341,
    "CHỮ": "M",
    "CỤM": "莫须有",
    "PINYIN": "mò xū yǒu",
    "NGHĨA": "宋朝奸臣秦桧诬陷岳飞谋反，韩世忠不平，去质问他有没有证据，秦桧回答说“莫须有”，意思是“也许有吧”。后来用此语表示凭空捏造。"
  },
  {
    "STT": 342,
    "CHỮ": "M",
    "CỤM": "磨洋工",
    "PINYIN": "mó yánɡ gōnɡ",
    "NGHĨA": "工作时拖延时间，也泛指工作懒散拖沓。"
  },
  {
    "STT": 343,
    "CHỮ": "M",
    "CỤM": "母老虎",
    "PINYIN": "mǔ lǎo hǔ",
    "NGHĨA": "比喻特别凶的女人。"
  },
  {
    "STT": 344,
    "CHỮ": "M",
    "CỤM": "木头人",
    "PINYIN": "mù tou rén",
    "NGHĨA": "比喻愚笨或不灵活的人。"
  },
  {
    "STT": 345,
    "CHỮ": "M",
    "CỤM": "母夜叉",
    "PINYIN": "mǔ yè chā",
    "NGHĨA": "比喻相貌丑陋、凶恶的女人。夜叉，佛教指恶鬼。"
  },
  {
    "STT": 346,
    "CHỮ": "M",
    "CỤM": "抹下脸",
    "PINYIN": "mǒ xià liǎn",
    "NGHĨA": "指突然翻脸,变得严厉而不讲情面。\r\n也作“抹脸皮”。"
  },
  {
    "STT": 347,
    "CHỮ": "M",
    "CỤM": "没星秤",
    "PINYIN": "méi xīnɡ chènɡ",
    "NGHĨA": "比喻没有主见、没有固定看法的人。星: 指秤上标记斤、两、钱的小点子。"
  },
  {
    "STT": 348,
    "CHỮ": "M",
    "CỤM": "没眼力",
    "PINYIN": "méi yǎn lì",
    "NGHĨA": "比喻不善观察，没有辨别是非好坏的能力。也说“没眼光”。"
  },
  {
    "STT": 349,
    "CHỮ": "N",
    "CỤM": "拿不起来",
    "PINYIN": "ná bù qǐ lái",
    "NGHĨA": "不能胜任某项工作。"
  },
  {
    "STT": 350,
    "CHỮ": "N",
    "CỤM": "拿手戏",
    "PINYIN": "ná shǒu xì",
    "NGHĨA": "戏剧演员最擅长的剧目。比喻最擅长的本领。也说“拿手好戏”。"
  },
  {
    "STT": 351,
    "CHỮ": "N",
    "CỤM": "闹别扭",
    "PINYIN": "nào biè niu",
    "NGHĨA": "比喻彼此有意见而合不来或故意为难对方。"
  },
  {
    "STT": 352,
    "CHỮ": "N",
    "CỤM": "闹饥荒",
    "PINYIN": "nào jī huānɡ",
    "NGHĨA": "遇到荒年，比喻经济困难。"
  },
  {
    "STT": 353,
    "CHỮ": "N",
    "CỤM": "闹口舌",
    "PINYIN": "nào kǒu shé",
    "NGHĨA": "比喻发生纠纷、争吵。"
  },
  {
    "STT": 354,
    "CHỮ": "N",
    "CỤM": "闹乱子",
    "PINYIN": "nào luàn zi",
    "NGHĨA": "惹祸，惹出麻烦。"
  },
  {
    "STT": 355,
    "CHỮ": "N",
    "CỤM": "闹摩擦",
    "PINYIN": "nào mó cā",
    "NGHĨA": "比喻个人或团体之间因彼此利害矛盾而蓄意制造事端，引起冲突。"
  },
  {
    "STT": 356,
    "CHỮ": "N",
    "CỤM": "闹笑话",
    "PINYIN": "nào xiào hua",
    "NGHĨA": "因粗心大意或缺乏常识、经验而发生可笑的错误。"
  },
  {
    "STT": 357,
    "CHỮ": "N",
    "CỤM": "闹着玩儿",
    "PINYIN": "nào zhe wánr",
    "NGHĨA": "做游戏或戏弄人，比喻用轻率的态度对待人或事情。"
  },
  {
    "STT": 358,
    "CHỮ": "N",
    "CỤM": "泥腿子",
    "PINYIN": "ní tuǐ zi",
    "NGHĨA": "指做农活的人。"
  },
  {
    "STT": 359,
    "CHỮ": "N",
    "CỤM": "牛皮大王",
    "PINYIN": "niú pí dà wánɡ",
    "NGHĨA": "指喜欢吹牛、说大话的人。"
  },
  {
    "STT": 360,
    "CHỮ": "N",
    "CỤM": "扭转乾坤",
    "PINYIN": "niǔ zhuǎn qián kūn",
    "NGHĨA": "指彻底改变局面。"
  },
  {
    "STT": 361,
    "CHỮ": "N",
    "CỤM": "弄玄虚",
    "PINYIN": "nòng xuán xū",
    "NGHĨA": "故意弄点花头，迷惑别人"
  },
  {
    "STT": 362,
    "CHỮ": "N",
    "CỤM": "弄潮儿",
    "PINYIN": "nònɡ cháo ér",
    "NGHĨA": "比喻敢于在风险中拼搏的人。"
  },
  {
    "STT": 363,
    "CHỮ": "P",
    "CỤM": "拍马屁",
    "PINYIN": "pāi mǎ pì",
    "NGHĨA": "比喻给别人说好话，谄媚奉承。"
  },
  {
    "STT": 364,
    "CHỮ": "P",
    "CỤM": "拍脑袋",
    "PINYIN": "pāi nǎo dai"
  },
  {
    "STT": 365,
    "CHỮ": "P",
    "CỤM": "攀高枝",
    "PINYIN": "pān ɡāo zhī",
    "NGHĨA": "比喻巴结或投靠有权势的人。也叫“爬高枝”。"
  },
  {
    "STT": 366,
    "CHỮ": "P",
    "CỤM": "跑龙套",
    "PINYIN": "pǎo lónɡ tào",
    "NGHĨA": "戏曲用语，即扮演随从或兵卒等不重要的角色，现在常用来比喻在人手下打杂。"
  },
  {
    "STT": 367,
    "CHỮ": "P",
    "CỤM": "泡蘑菇",
    "PINYIN": "pào mó ɡū",
    "NGHĨA": "比喻故意纠缠，拖延时间。"
  },
  {
    "STT": 368,
    "CHỮ": "P",
    "CỤM": "碰一鼻子灰",
    "PINYIN": "pèng yī bí zi huī",
    "NGHĨA": "遭到拒绝或斥责，落得没趣。"
  },
  {
    "STT": 369,
    "CHỮ": "P",
    "CỤM": "碰壁",
    "PINYIN": "pènɡ bì",
    "NGHĨA": "比喻受到阻碍或遭到拒绝。也指事情行不通或达不到目的。"
  },
  {
    "STT": 370,
    "CHỮ": "P",
    "CỤM": "碰钉子",
    "PINYIN": "pènɡ dīnɡ zi",
    "NGHĨA": "比喻遭到拒绝或受斥责。也说“吃钉子”"
  },
  {
    "STT": 371,
    "CHỮ": "P",
    "CỤM": "偏心眼",
    "PINYIN": "piān xīn yǎn",
    "NGHĨA": "偏向、袒护一方面，不公正。"
  },
  {
    "STT": 372,
    "CHỮ": "P",
    "CỤM": "拼命三郎",
    "PINYIN": "pīn mìnɡ sān lánɡ",
    "NGHĨA": "把性命豁出去。谑指竭尽全力、甚至不惜生命去工作的人。"
  },
  {
    "STT": 373,
    "CHỮ": "P",
    "CỤM": "泼辣货",
    "PINYIN": "pō là huò",
    "NGHĨA": "谑指能干而又厉害的女人。"
  },
  {
    "STT": 374,
    "CHỮ": "P",
    "CỤM": "泼冷水",
    "PINYIN": "pō lěnɡ shuǐ",
    "NGHĨA": "用言语或行动打消某人做某事的积极性。"
  },
  {
    "STT": 375,
    "CHỮ": "P",
    "CỤM": "破天荒",
    "PINYIN": "pò tiān huānɡ",
    "NGHĨA": "打破从未开垦过的荒芜状态。比喻事情第一次出现。"
  },
  {
    "STT": 376,
    "CHỮ": "P",
    "CỤM": "菩萨心肠",
    "PINYIN": "pú sɑ xīn chánɡ",
    "NGHĨA": "心肠像菩萨一样软，见不得人家受苦例。"
  },
  {
    "STT": 377,
    "CHỮ": "Q",
    "CỤM": "骑墙派",
    "PINYIN": "qí qiánɡ pài",
    "NGHĨA": "比喻立场不明确、站在中间、向两方面讨好的人。"
  },
  {
    "STT": 378,
    "CHỮ": "Q",
    "CỤM": "千里马",
    "PINYIN": "qiān lǐ mǎ",
    "NGHĨA": "指很有才华、很有能力、很有前途的人。"
  },
  {
    "STT": 379,
    "CHỮ": "Q",
    "CỤM": "千里眼",
    "PINYIN": "qiān lǐ yǎn",
    "NGHĨA": "目光敏锐，看得远。"
  },
  {
    "STT": 380,
    "CHỮ": "Q",
    "CỤM": "前怕狼，后怕虎",
    "PINYIN": "qián pà lánɡ，hòu pà hǔ",
    "NGHĨA": "形容胆小怕事，畏缩不前。"
  },
  {
    "STT": 381,
    "CHỮ": "Q",
    "CỤM": "牵着鼻子走",
    "PINYIN": "qiān zhe bí zi zǒu",
    "NGHĨA": "控制、摆布。"
  },
  {
    "STT": 382,
    "CHỮ": "Q",
    "CỤM": "枪打出头鸟",
    "PINYIN": "qiānɡ dǎ chū tóu niǎo",
    "NGHĨA": "露出头来的鸟一定会遭到枪击。比喻首先打击带头的人。"
  },
  {
    "STT": 383,
    "CHỮ": "Q",
    "CỤM": "抢手货",
    "PINYIN": "qiǎnɡ shǒu huò",
    "NGHĨA": "很受欢迎的东西。"
  },
  {
    "STT": 384,
    "CHỮ": "Q",
    "CỤM": "墙头草",
    "PINYIN": "qiánɡ tóu cǎo",
    "NGHĨA": "比喻立场不坚定、缺乏主见、左右动摇的人。"
  },
  {
    "STT": 385,
    "CHỮ": "Q",
    "CỤM": "敲边鼓",
    "PINYIN": "qiāo biān ɡǔ",
    "NGHĨA": "比喻从旁帮腔，从旁助势。也说“打边鼓”。"
  },
  {
    "STT": 386,
    "CHỮ": "Q",
    "CỤM": "敲门砖",
    "PINYIN": "qiāo mén zhuān",
    "NGHĨA": "比喻谋取名利的初步手段。"
  },
  {
    "STT": 387,
    "CHỮ": "Q",
    "CỤM": "翘尾巴",
    "PINYIN": "qiào wěi bā",
    "NGHĨA": "比喻骄傲自大。"
  },
  {
    "STT": 388,
    "CHỮ": "Q",
    "CỤM": "敲竹杠",
    "PINYIN": "qiāo zhú gànɡ",
    "NGHĨA": "利用别人的弱点敲诈勒索。"
  },
  {
    "STT": 389,
    "CHỮ": "Q",
    "CỤM": "穷光蛋",
    "PINYIN": "qiónɡ ɡuānɡ dàn",
    "NGHĨA": "很穷的人。"
  },
  {
    "STT": 390,
    "CHỮ": "Q",
    "CỤM": "秋老虎",
    "PINYIN": "qiū lǎo hǔ",
    "NGHĨA": "比喻立秋以后的炎热天气。"
  },
  {
    "STT": 1,
    "CHỮ": "W",
    "CỤM": "挖墙脚",
    "PINYIN": "wā qiánɡ jiǎo",
    "NGHĨA": "比喻施行破坏手段使人或集体垮台或使事情不能顺利进行。"
  },
  {
    "STT": 2,
    "CHỮ": "W",
    "CỤM": "王老五",
    "PINYIN": "wánɡ lǎo wǔ",
    "NGHĨA": "大龄未婚男子。"
  },
  {
    "STT": 3,
    "CHỮ": "W",
    "CỤM": "窝里斗",
    "PINYIN": "wō lǐ dòu",
    "NGHĨA": "比喻在内部进行的激烈斗争。"
  },
  {
    "STT": 4,
    "CHỮ": "W",
    "CỤM": "窝囊废",
    "PINYIN": "wō nánɡ fèi",
    "NGHĨA": "指怯懦无能的人(含讥讽义)。"
  },
  {
    "STT": 5,
    "CHỮ": "W",
    "CỤM": "无底洞",
    "PINYIN": "wú dǐ dònɡ",
    "NGHĨA": "永远填不满的洞。比喻永远满足不了的欲望和要求。"
  },
  {
    "STT": 6,
    "CHỮ": "W",
    "CỤM": "乌纱帽",
    "PINYIN": "wū shā mào",
    "NGHĨA": "旧时官员戴的一种帽子。喻指官位。"
  },
  {
    "STT": 7,
    "CHỮ": "W",
    "CỤM": "乌鸦嘴",
    "PINYIN": "wū yā zuǐ",
    "NGHĨA": "比喻多嘴多舌的人，说倒霉话的人。"
  },
  {
    "STT": 8,
    "CHỮ": "W",
    "CỤM": "乌眼鸡似的",
    "PINYIN": "wū yǎn jī shì de",
    "NGHĨA": "像个好斗的鸡。"
  },
  {
    "STT": 9,
    "CHỮ": "X",
    "CỤM": "下不来台",
    "PINYIN": "xià bù lái tái",
    "NGHĨA": "比喻处境尴尬窘迫。也说“下不了台”。"
  },
  {
    "STT": 10,
    "CHỮ": "X",
    "CỤM": "下毒手",
    "PINYIN": "xià dú shǒu",
    "NGHĨA": "用不人道的、狠毒的方法、手段对待人和事。"
  },
  {
    "STT": 11,
    "CHỮ": "X",
    "CỤM": "下工夫",
    "PINYIN": "xià gōnɡ fu",
    "NGHĨA": "努力，花力气。"
  },
  {
    "STT": 12,
    "CHỮ": "X",
    "CỤM": "下海",
    "PINYIN": "xià hǎi",
    "NGHĨA": "从国有单位辞职。"
  },
  {
    "STT": 13,
    "CHỮ": "X",
    "CỤM": "下马威",
    "PINYIN": "xià mǎ wēi",
    "NGHĨA": "原指官吏初到任时对下属显示的威风，现在泛指一开头就向对方显 示威力。比喻给他一点颜色看看，让他为难或难堪。"
  },
  {
    "STT": 14,
    "CHỮ": "X",
    "CỤM": "下台",
    "PINYIN": "xià tái",
    "NGHĨA": "指失去职位。"
  },
  {
    "STT": 15,
    "CHỮ": "X",
    "CỤM": "象牙塔",
    "PINYIN": "xiànɡ yá tǎ",
    "NGHĨA": "比喻脱离现实生活的文艺家或知识分子的小天地。"
  },
  {
    "STT": 16,
    "CHỮ": "X",
    "CỤM": "小把戏",
    "PINYIN": "xiǎo bǎ xì",
    "NGHĨA": "小花招，小手段。"
  },
  {
    "STT": 17,
    "CHỮ": "X",
    "CỤM": "小辫子",
    "PINYIN": "xiǎo biàn zi",
    "NGHĨA": "比喻把柄。常与“抓”连用。"
  },
  {
    "STT": 18,
    "CHỮ": "X",
    "CỤM": "小插曲",
    "PINYIN": "xiǎo chā qǔ",
    "NGHĨA": "比喻连续进行的事情中插入小小的特殊情况。"
  },
  {
    "STT": 19,
    "CHỮ": "X",
    "CỤM": "小聪明",
    "PINYIN": "xiǎo cōnɡ ming",
    "NGHĨA": "在小事情上表现出来的聪明(多含贬义)。"
  },
  {
    "STT": 20,
    "CHỮ": "X",
    "CỤM": "小道消息",
    "PINYIN": "xiǎo dào xiāo xi",
    "NGHĨA": "指道听途说的非正式消息。"
  },
  {
    "STT": 21,
    "CHỮ": "X",
    "CỤM": "小儿科",
    "PINYIN": "xiǎo ér kē",
    "NGHĨA": "本指医院中专门诊治儿童疾病的部门。比喻不重要的工作部门或事 情。"
  },
  {
    "STT": 22,
    "CHỮ": "X",
    "CỤM": "小金库",
    "PINYIN": "xiǎo jīn kù",
    "NGHĨA": "指国家机关、团体、企事业单位违反国家财经法规，弄虚作假，将应该 纳入账内核算的各种收入转移到账外，隐匿起来，使之变成小团体的“私产” 的那部分资金。"
  },
  {
    "STT": 23,
    "CHỮ": "X",
    "CỤM": "小九九",
    "PINYIN": "xiǎo jiǔ jiu",
    "NGHĨA": "比喻心中的算计或打算。"
  },
  {
    "STT": 24,
    "CHỮ": "X",
    "CỤM": "笑面虎",
    "PINYIN": "xiào miàn hǔ",
    "NGHĨA": "比喻面带笑容的坏人。"
  },
  {
    "STT": 25,
    "CHỮ": "X",
    "CỤM": "小算盘",
    "PINYIN": "xiǎo suàn pán",
    "NGHĨA": "比喻为个人或局部利益的打算。"
  },
  {
    "STT": 26,
    "CHỮ": "X",
    "CỤM": "小字辈",
    "PINYIN": "xiǎo zì bèi",
    "NGHĨA": "指团体中一些年纪较小、资历较浅的人员。"
  },
  {
    "STT": 27,
    "CHỮ": "X",
    "CỤM": "心头肉",
    "PINYIN": "xīn tóu ròu",
    "NGHĨA": "比喻非常宠爱、难以割舍的人和事物。"
  },
  {
    "STT": 28,
    "CHỮ": "X",
    "CỤM": "绣花枕头",
    "PINYIN": "xiù huā zhěn tou",
    "NGHĨA": "比喻徒有外表而无学识、无才能的人。"
  },
  {
    "STT": 29,
    "CHỮ": "Y",
    "CỤM": "演独角戏",
    "PINYIN": "yǎn dú jiǎo xì",
    "NGHĨA": "一个人表演的戏，比喻没人帮忙。"
  },
  {
    "STT": 30,
    "CHỮ": "Y",
    "CỤM": "眼中钉",
    "PINYIN": "yǎn zhōnɡ dīnɡ",
    "NGHĨA": "比喻心中最讨厌、最憎恨的人。"
  },
  {
    "STT": 31,
    "CHỮ": "Y",
    "CỤM": "摇钱树",
    "PINYIN": "yáo qián shù",
    "NGHĨA": "神话中的一种宝树，一摇晃就会有很多钱落下来。比喻借以获取钱 财的人或物。"
  },
  {
    "STT": 32,
    "CHỮ": "Y",
    "CỤM": "夜猫子",
    "PINYIN": "yè māo zi",
    "NGHĨA": "指特别喜欢熬夜的人。"
  },
  {
    "STT": 33,
    "CHỮ": "Y",
    "CỤM": "一把鼻涕一把眼泪",
    "PINYIN": "yī bǎ bí tì yī bǎ lèi",
    "NGHĨA": "伤心地哭。"
  },
  {
    "STT": 34,
    "CHỮ": "Y",
    "CỤM": "一把手",
    "PINYIN": "yī bǎ shǒu",
    "NGHĨA": "指非常能干的人。也说“一把好手”。单位或组织的主要负责人。指 带头人。"
  },
  {
    "STT": 35,
    "CHỮ": "Y",
    "CỤM": "一百八十度",
    "PINYIN": "yī bǎi bā shí dù",
    "NGHĨA": "比喻与原来相反。"
  },
  {
    "STT": 36,
    "CHỮ": "Y",
    "CỤM": "一边倒",
    "PINYIN": "yī biān dǎo",
    "NGHĨA": "朝一个方向倾斜。比喻人的立场、思想、情绪等都倾向一个方面。也 说“一面倒”。"
  },
  {
    "STT": 37,
    "CHỮ": "Y",
    "CỤM": "一刀切",
    "PINYIN": "yī dāo qiē",
    "NGHĨA": "比喻用划一的办法处理情况或性质不同的事物。"
  },
  {
    "STT": 38,
    "CHỮ": "Y",
    "CỤM": "一朵花",
    "PINYIN": "yī duǒ huā",
    "NGHĨA": "指人有魅力。"
  },
  {
    "STT": 39,
    "CHỮ": "Y",
    "CỤM": "一个鼻子出气",
    "PINYIN": "yī gè bí zi chū qì",
    "NGHĨA": "比喻勾结在一起，对某事采取同样的态度和主张。"
  },
  {
    "STT": 40,
    "CHỮ": "Y",
    "CỤM": "一个劲儿",
    "PINYIN": "yī gè jìnr",
    "NGHĨA": "表示不停地。"
  },
  {
    "STT": 41,
    "CHỮ": "Y",
    "CỤM": "一根筋",
    "PINYIN": "yī gēn jīn",
    "NGHĨA": "指认死理，不妥协。"
  },
  {
    "STT": 42,
    "CHỮ": "Y",
    "CỤM": "一棍子打死",
    "PINYIN": "yī gùn zi dǎ sǐ",
    "NGHĨA": "不问明原因就把对方打死，完全否决。"
  },
  {
    "STT": 43,
    "CHỮ": "Y",
    "CỤM": "一锅粥",
    "PINYIN": "yī guō zhōu",
    "NGHĨA": "比喻非常混乱，一团糟。"
  },
  {
    "STT": 44,
    "CHỮ": "Y",
    "CỤM": "一路货",
    "PINYIN": "yī lù huò",
    "NGHĨA": "同类或同等的货物。比喻同类的人或事物(含贬义)。也说“一路货 色”。"
  },
  {
    "STT": 45,
    "CHỮ": "Y",
    "CỤM": "一盘棋",
    "PINYIN": "yī pán qí",
    "NGHĨA": "比喻一个整体或全局。"
  },
  {
    "STT": 46,
    "CHỮ": "Y",
    "CỤM": "一条龙",
    "PINYIN": "yī tiáo lónɡ",
    "NGHĨA": "比喻生产程序或工作上的紧密联系和配合。"
  },
  {
    "STT": 47,
    "CHỮ": "Y",
    "CỤM": "一条心",
    "PINYIN": "yī tiáo xīn",
    "NGHĨA": "携手共进的意思。"
  },
  {
    "STT": 48,
    "CHỮ": "Y",
    "CỤM": "一头雾水",
    "PINYIN": "yī tóu wù shuǐ",
    "NGHĨA": "指糊涂不清。"
  },
  {
    "STT": 49,
    "CHỮ": "Y",
    "CỤM": "一团乱麻",
    "PINYIN": "yī tuán luàn má",
    "NGHĨA": "比喻心绪或事物紊乱。"
  },
  {
    "STT": 50,
    "CHỮ": "Y",
    "CỤM": "一团糟",
    "PINYIN": "yī tuán zāo",
    "NGHĨA": "非常混乱、不整齐、肮脏。"
  },
  {
    "STT": 51,
    "CHỮ": "Y",
    "CỤM": "一窝蜂",
    "PINYIN": "yī wō fēnɡ",
    "NGHĨA": "比喻许多人乱哄哄地同时说话或行动。也比喻混乱的局面或烦乱的 心情。"
  },
  {
    "STT": 52,
    "CHỮ": "Y",
    "CỤM": "一言堂",
    "PINYIN": "yī yán tánɡ",
    "NGHĨA": "比喻领导缺乏民主作风，一个人说了算。"
  },
  {
    "STT": 53,
    "CHỮ": "Y",
    "CỤM": "一阵风",
    "PINYIN": "yī zhèn fēnɡ",
    "NGHĨA": "比喻行动时间短，不能持久。"
  },
  {
    "STT": 54,
    "CHỮ": "Y",
    "CỤM": "硬骨头",
    "PINYIN": "yìng gǔ tou",
    "NGHĨA": "比喻坚强不屈的人或气概。也比喻艰巨的任务。"
  },
  {
    "STT": 55,
    "CHỮ": "Y",
    "CỤM": "硬着头皮",
    "PINYIN": "yìng zhe tóu pí",
    "NGHĨA": "比喻勉强去做不愿做的事情。"
  },
  {
    "STT": 56,
    "CHỮ": "Y",
    "CỤM": "应声虫",
    "PINYIN": "yìnɡ shēnɡ chónɡ",
    "NGHĨA": "比喻随声附和的人。"
  },
  {
    "STT": 57,
    "CHỮ": "Y",
    "CỤM": "有板有眼",
    "PINYIN": "yǒu bǎn yǒu yǎn",
    "NGHĨA": "比喻言语、行为有条理。板眼，指民族音乐和戏曲中的节拍，每小 节中最强的拍子叫板，其余的拍子叫眼。"
  },
  {
    "STT": 58,
    "CHỮ": "Y",
    "CỤM": "有奔头",
    "PINYIN": "yǒu bèn tou",
    "NGHĨA": "指有前途，有希望。"
  },
  {
    "STT": 59,
    "CHỮ": "Y",
    "CỤM": "有鼻子有眼",
    "PINYIN": "yǒu bí zi yǒu yǎn",
    "NGHĨA": "比喻述说某事具体，活灵活现，仿佛真有其事。"
  },
  {
    "STT": 60,
    "CHỮ": "Y",
    "CỤM": "有分寸",
    "PINYIN": "yǒu fēn cùn",
    "NGHĨA": "比喻说话或做事能掌握适当的限度。"
  },
  {
    "STT": 61,
    "CHỮ": "Y",
    "CỤM": "有分量",
    "PINYIN": "yǒu fèn liànɡ",
    "NGHĨA": "比喻某种事物具有重要的意义或价值。"
  },
  {
    "STT": 62,
    "CHỮ": "Y",
    "CỤM": "有杆秤",
    "PINYIN": "yǒu ɡǎn chènɡ",
    "NGHĨA": "比喻有评判是非好坏的标准。"
  },
  {
    "STT": 63,
    "CHỮ": "Y",
    "CỤM": "有瓜葛",
    "PINYIN": "yǒu ɡuā gé",
    "NGHĨA": "比喻有互相牵连的关系。"
  },
  {
    "STT": 64,
    "CHỮ": "Y",
    "CỤM": "有好戏看",
    "PINYIN": "yǒu hǎo xì kàn",
    "NGHĨA": "也说“有好戏”。指事情越来越复杂，矛盾越来越尖锐或角逐越来 越激烈。"
  },
  {
    "STT": 65,
    "CHỮ": "Y",
    "CỤM": "有来头",
    "PINYIN": "yǒu lái tou",
    "NGHĨA": "有来历(多指人的资历或背景)。"
  },
  {
    "STT": 66,
    "CHỮ": "Y",
    "CỤM": "有棱角",
    "PINYIN": "yǒu lénɡ jiǎo",
    "NGHĨA": "比喻敢说敢做的锐气。"
  },
  {
    "STT": 67,
    "CHỮ": "Y",
    "CỤM": "有两把刷子",
    "PINYIN": "yǒu liǎnɡ bǎ shuā zi",
    "NGHĨA": "也说“有几把刷子”、“有两手”、“有两下子”。比喻有一些本领、 本事、技能。"
  },
  {
    "STT": 68,
    "CHỮ": "Y",
    "CỤM": "有两下子",
    "PINYIN": "yǒu liǎnɡ xià zi",
    "NGHĨA": "有些本事。"
  },
  {
    "STT": 69,
    "CHỮ": "Y",
    "CỤM": "有眉目",
    "PINYIN": "yǒu méi mù",
    "NGHĨA": "比喻事情有了头绪。"
  },
  {
    "STT": 70,
    "CHỮ": "Y",
    "CỤM": "有门道",
    "PINYIN": "yǒu mén dào",
    "NGHĨA": "比喻做事懂得诀窍，有办法，也说有门路。"
  },
  {
    "STT": 71,
    "CHỮ": "Y",
    "CỤM": "有苗头",
    "PINYIN": "yǒu miáo tou",
    "NGHĨA": "比喻有略微显露出来的某种趋势或情况。"
  },
  {
    "STT": 72,
    "CHỮ": "Y",
    "CỤM": "有谱儿",
    "PINYIN": "yǒu pǔr",
    "NGHĨA": "指有大致的标准、打算或有把握。"
  },
  {
    "STT": 73,
    "CHỮ": "Y",
    "CỤM": "有起色",
    "PINYIN": "yǒu qǐ sè",
    "NGHĨA": "指开始好转(多指涣散的工作或严重的疾病)。"
  },
  {
    "STT": 74,
    "CHỮ": "Y",
    "CỤM": "有人味儿",
    "PINYIN": "yǒu rén wèir",
    "NGHĨA": "具有一个人起码应具有的品质。"
  },
  {
    "STT": 75,
    "CHỮ": "Y",
    "CỤM": "有色眼镜",
    "PINYIN": "yǒu sè yǎn jìnɡ",
    "NGHĨA": "比喻具有个人主观色彩的眼光。"
  },
  {
    "STT": 76,
    "CHỮ": "Y",
    "CỤM": "有水分",
    "PINYIN": "yǒu shuǐ fèn",
    "NGHĨA": "比喻有虚假或无价值的成分。"
  },
  {
    "STT": 77,
    "CHỮ": "Y",
    "CỤM": "有头有脸",
    "PINYIN": "yǒu tóu yǒu liǎn",
    "NGHĨA": "比喻有身份，有声望。"
  },
  {
    "STT": 78,
    "CHỮ": "Y",
    "CỤM": "有文章",
    "PINYIN": "yǒu wén zhānɡ",
    "NGHĨA": "比喻有暗含着的意思。"
  },
  {
    "STT": 79,
    "CHỮ": "Y",
    "CỤM": "有眼光",
    "PINYIN": "yǒu yǎn ɡuānɡ",
    "NGHĨA": "指善于观察事物，看得准，看得远。"
  },
  {
    "STT": 80,
    "CHỮ": "Y",
    "CỤM": "有一搭没一搭",
    "PINYIN": "yǒu yī dā méi yī dā",
    "NGHĨA": "形容漫不经心，没话找话说。"
  },
  {
    "STT": 81,
    "CHỮ": "Y",
    "CỤM": "有油水",
    "PINYIN": "yǒu yóu shuǐ",
    "NGHĨA": "比喻可以得到的好处(多指不正当的额外收入)。油水，指饭菜里所 含的脂肪质。"
  },
  {
    "STT": 82,
    "CHỮ": "Y",
    "CỤM": "冤大头",
    "PINYIN": "yuān dà tóu",
    "NGHĨA": "指枉费钱财或气力的人(含讥讽意)。"
  },
  {
    "STT": 83,
    "CHỮ": "Y",
    "CỤM": "月下老人",
    "PINYIN": "yuè xià lǎo rén",
    "NGHĨA": "为男女牵线、撮合的人。"
  },
  {
    "STT": 84,
    "CHỮ": "Y",
    "CỤM": "云里雾里",
    "PINYIN": "yún lǐ wù lǐ",
    "NGHĨA": "表示看不清，不太明白。"
  },
  {
    "STT": 85,
    "CHỮ": "Z",
    "CỤM": "砸场子",
    "PINYIN": "zá chǎng zi",
    "NGHĨA": "一般指恶人拆台，搞破坏。"
  },
  {
    "STT": 86,
    "CHỮ": "Z",
    "CỤM": "栽跟头",
    "PINYIN": "zāi ɡēn tou",
    "NGHĨA": "指失误，受挫败。"
  },
  {
    "STT": 87,
    "CHỮ": "Z",
    "CỤM": "站得住脚",
    "PINYIN": "zhàn de zhù jiǎo",
    "NGHĨA": "有道理，能被人接受。"
  },
  {
    "STT": 88,
    "CHỮ": "Z",
    "CỤM": "占上风",
    "PINYIN": "zhàn shànɡ fēnɡ",
    "NGHĨA": "有优势，处在优势地位。"
  },
  {
    "STT": 89,
    "CHỮ": "Z",
    "CỤM": "站稳脚跟",
    "PINYIN": "zhàn wěn jiǎo gēn",
    "NGHĨA": "指得以立足。"
  },
  {
    "STT": 90,
    "CHỮ": "Z",
    "CỤM": "占小便宜，吃大亏",
    "PINYIN": "zhàn xiáo pián yi, chī dà kuī",
    "NGHĨA": "指得到了小的好处却遭受了很大的损失。"
  },
  {
    "STT": 91,
    "CHỮ": "Z",
    "CỤM": "丈二和尚摸不着头脑",
    "PINYIN": "zhànɡ èr hé shànɡ mō bù zháo tóu nǎo",
    "NGHĨA": "比喻搞不清楚什么意思。"
  },
  {
    "STT": 92,
    "CHỮ": "Z",
    "CỤM": "找个台阶下",
    "PINYIN": "zhǎo ɡe tái jiē xià",
    "NGHĨA": "比喻为避免受窘而寻找途径或机会。"
  },
  {
    "STT": 93,
    "CHỮ": "Z",
    "CỤM": "照妖镜",
    "PINYIN": "zhào yāo jìnɡ",
    "NGHĨA": "原指能照出妖怪原形的镜子。现比喻能揭露丑恶现象或行为的武 器。"
  },
  {
    "STT": 94,
    "CHỮ": "Z",
    "CỤM": "睁一只眼闭一只眼",
    "PINYIN": "zhēng yī zhī yǎn bì yī zhī yǎn",
    "NGHĨA": "比喻对事物(多指不好的)看见了，装出没看见的样子，不 去过问。"
  },
  {
    "STT": 95,
    "CHỮ": "Z",
    "CỤM": "争上游",
    "PINYIN": "zhēnɡ shànɡ yóu",
    "NGHĨA": "争取向上。"
  },
  {
    "STT": 96,
    "CHỮ": "Z",
    "CỤM": "智多星",
    "PINYIN": "zhì duō xīnɡ",
    "NGHĨA": "原为古典小说《水浒传》中梁山军师吴用的绰号，现泛指聪明机智、计 谋多的人。"
  },
  {
    "STT": 97,
    "CHỮ": "Z",
    "CỤM": "纸老虎",
    "PINYIN": "zhǐ lǎo hǔ",
    "NGHĨA": "就是用纸做的老虎，一点儿都不可怕。"
  },
  {
    "STT": 98,
    "CHỮ": "Z",
    "CỤM": "直筒子",
    "PINYIN": "zhí tǒnɡ zi",
    "NGHĨA": "比喻性情直爽，有什么说什么;也指性情直爽的人。"
  },
  {
    "STT": 99,
    "CHỮ": "Z",
    "CỤM": "主心骨",
    "PINYIN": "zhǔ xīn ɡǔ",
    "NGHĨA": "比喻可依靠的人或事物。"
  },
  {
    "STT": 100,
    "CHỮ": "Z",
    "CỤM": "装门面",
    "PINYIN": "zhuānɡ mén miàn",
    "NGHĨA": "比喻为了表面好看而做某事。也说“壮门面”"
  },
  {
    "STT": 101,
    "CHỮ": "Z",
    "CỤM": "装洋蒜",
    "PINYIN": "zhuānɡ yánɡ suàn",
    "NGHĨA": "装糊涂。"
  },
  {
    "STT": 102,
    "CHỮ": "Z",
    "CỤM": "走下坡路",
    "PINYIN": "zǒu xià pō lù",
    "NGHĨA": "比喻朝衰落、灭亡的方向发展。"
  },
  {
    "STT": 103,
    "CHỮ": "Z",
    "CỤM": "钻空子",
    "PINYIN": "zuān kònɡ zi",
    "NGHĨA": "比喻利用某种漏洞，进行对自己有利的活动。"
  },
  {
    "STT": 104,
    "CHỮ": "Z",
    "CỤM": "钻牛角尖",
    "PINYIN": "zuān niú jiǎo jiān",
    "NGHĨA": "比喻特别认真或较真。"
  },
  {
    "STT": 105,
    "CHỮ": "Z",
    "CỤM": "钻死胡同",
    "PINYIN": "zuān sǐ hú tong",
    "NGHĨA": "死胡同指走不通的小街道，比喻走到绝路上了。"
  },
  {
    "STT": 106,
    "CHỮ": "Z",
    "CỤM": "坐冷板凳",
    "PINYIN": "zuò lěnɡ bǎn dènɡ",
    "NGHĨA": "原为讽刺乡村私塾先生清冷职位的话。后来比喻不受重视，遭到 冷遇。"
  },
  {
    "STT": 107,
    "CHỮ": "Z",
    "CỤM": "做手脚",
    "PINYIN": "zuò shǒu jiǎo",
    "NGHĨA": "比喻为了实现某种企图而暗中采取行动(含贬义)。"
  }
]

const allAnswers = Array.from(new Set(data.flatMap((d) => [d['ĐÁP ÁN 1'], d['ĐÁP ÁN 2']])));
function generateChoices(correctAnswer, optionsPool) {
  // Lọc ra những đáp án không trùng với correctAnswer
  const filteredPool = optionsPool.filter((opt) => opt !== correctAnswer);

  if (filteredPool.length < 3) {
    throw new Error('Không đủ đáp án sai để tạo 4 lựa chọn');
  }

  // Xáo trộn pool
  const shuffled = [...filteredPool].sort(() => Math.random() - 0.5);

  // Lấy 3 đáp án sai
  const choices = shuffled.slice(0, 3);

  // Thêm đáp án đúng
  choices.push(correctAnswer);

  // Xáo trộn lại để đáp án đúng không luôn đứng cuối
  return choices.sort(() => Math.random() - 0.5);
}

const newData = data
  .map((d) => {
    return {
      letter: d['CHỮ'],
      index: d['STT'],
      simplified: d['CỤM'],
      meaning: d['NGHĨA'],
      pinyin: d['PINYIN']
    };
  })
  .sort((a, b) => {
    if (a.index !== b.index) return a.letter - b.letter;
    return a.index - b.index;
  });
const fs = require('fs');
fs.writeFileSync('new-noi-nghia.json', JSON.stringify(newData, null, 2));
