const data = [
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604265',
    },
    paragraph:
      '女人有了工作，就有了独立的经济来源，家庭地位一下子上去了。因为不再 因为经济问题而被男人..... (1)..... ，女人也改变了....(2).... 的形象，也不需要练就一副.....(3)...... ，靠..... (4)......赢得生存空间。',
    correctAnswer: ['牵着鼻子走', '长舌妇', '刀子嘴', '耍嘴皮子'],
    answers: [
      ['牵着鼻子走', '丢面子', '翻白眼', '红眼病'],
      ['白眼狼', '红眼病', '老掉牙', '长舌妇'],
      ['刀子嘴', '顺风耳', '近视眼', '千里眼'],
      ['翻白眼', '千里眼', '耍嘴皮子', '红眼病'],
    ],
  },
  {
    paragraph:
      '男人也不敢.....(1)......地对女人........ (2)...... 了。倒是女人，不仅掌管着自己的经济，也控制了男人的收入，家里家外，大事小事,....(3)..... ，好不惬意。这个时候，男人只能在一旁........ (4).......，他也得......... (5)..... 女人的......... (5).........了。',
    correctAnswer: ['不问青红皂白', '吹胡子瞪眼', '眉毛胡子一把抓', '干瞪眼', '看看……脸色'],
    answers: [
      ['翻白眼', '不问青红皂白', '抹一鼻子灰', '干瞪眼'],
      ['吹胡子瞪眼', '不分青红皂白', '抹一鼻子灰', '翻白眼'],
      ['眉毛胡子一把抓', '不分青红皂白', '抹一鼻子灰', '吹胡子瞪眼'],
      ['干瞪眼', '丢面子', '红眼病', '吹胡子瞪眼'],
      ['看看……脸色', '丢丢……面子', '翻翻……白眼', '打打……小报告'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604266',
    },
    paragraph:
      '1. 北京奥运快到了，福娃成了奥运商品的........(1).......。贪心的不法商人打起了奥运商标的主意。他们在商标上..... (2)....。有的是模仿，混淆视听，欺骗别人，有的直接造假，简直是...... (3).........奥运的........ (3).....，该严厉打击，到了给他们一个..........(4).......... 的时候了。',
    correctAnswer: ['抢手货', '做手脚', '拖……后腿', '下马威'],
    answers: [
      ['狗腿子', '拿手戏', '抢手货', '心头肉'],
      ['死心眼', '肉中刺', '迷魂阵', '做手脚'],
      ['做……手脚', '耍……手腕', '拍……马屁', '拖……后腿'],
      ['拿手戏', '耍手腕', '露马脚', '下马威'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604267',
    },
    paragraph:
      '2． 当时剑拔弩张，眼看就要吵起来了，在这个......(1)........上，出现了一个...... (2)....... ，三言两语，就把他们劝和了，避免了一场争吵。',
    correctAnswer: ['节骨眼', '和事佬'],
    answers: [
      ['死心眼', '冷心肠', '倒胃口', '节骨眼'],
      ['定心丸', '和事佬', '负心郎', '死心眼'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604268',
    },
    paragraph:
      '1．她跟他.......(1).........，整天去跟他那些不三不四的朋友瞎混，什么事都让她....... (2)..........。最近不知怎么啦，她来了个.........(3)..........的转弯，原来的朋友她一个也不见，天天待在家里看起书来。',
    correctAnswer: ['一路货', '搅成一锅粥', '一百八十度'],
    answers: [
      ['一锅粥', '一路货', '一窝蜂', '一阵风'],
      ['变成四不像', '弄成一条龙', '伸出三只手', '搅成一锅粥'],
      ['十一路', '一百八十度', '一边倒', '一团乱麻'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604269',
    },
    paragraph:
      '2．谁不知道他那.......(1)........，.......(2).........一个，什么事只要他一........(3)..........，准是......(4)....。',
    correctAnswer: ['两把刷子', '半吊子', '搅和', '一团糟'],
    answers: [
      ['一盘棋', '两把刷子', '两张皮', '一根筋'],
      ['半吊子', '一边倒', '一言堂', '二百五'],
      ['搅和', '参加', '参与', '一把手'],
      ['一窝蜂', '一团糟', '四不像', '半吊子'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426a',
    },
    paragraph:
      '1．一些饭店..........(1)..........，欺骗顾客，我们应该提高警惕，既不要和他们...... (2).........，也不要上当受骗。',
    correctAnswer: ['耍花招', '闹摩擦'],
    answers: [
      ['耍手腕', '耍赖皮', '耍花招', '耍滑头'],
      ['闹摩擦', '闹乱子', '耍贫嘴', '耍心眼儿'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426b',
    },
    paragraph:
      '2．一些不法分子在商场........(1).........，.........(2)........，当场被警察...........(3).........。',
    correctAnswer: ['耍流氓', '闹乱子', '抓获'],
    answers: [
      ['耍把戏', '耍花招', '耍手腕', '耍流氓'],
      ['闹摩擦', '闹脾气', '闹饥荒', '闹乱子'],
      ['看到', '批评', '逮捕', '抓获'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426c',
    },
    paragraph:
      '华南虎事件，近来闹得沸沸扬扬，周正龙，一个本应是(1)_____的农民，猎人，突然说拍到了野生华南虎，而镇坪县官方，也不管这个结论是否(2) _____，正式对外公布了这一发现。\n    据最官方的表述，野生华南虎在几十年前就已经灭绝了，如果镇坪真的发现了野生华南虎，那将是一个重大的科学发现。\n    但是，随着媒体的介入，一些疑问产生了。照片怎么跟年画上的如此相像？照片到底是真是假?镇坪官方是否(3) _____ ?能否(4) _____，让大家相信?',
    correctAnswer: ['守本分', '站得住脚', '说了过头话', '摊出底牌'],
    answers: [
      ['翘尾巴', '守本分', '吐苦水', '卖关子'],
      ['卖了关子', '守本分', '敲竹杠', '站得住脚'],
      ['伤脑筋', '开空头支票', '蒙在鼓里', '说了过头话'],
      ['摊出底牌', '挤牙膏', '留一手', '蒙在鼓里'],
    ],
  },
  {
    paragraph:
      '而通过对几个当事人的采访发现，他们都有明显的前后矛盾，特别是周正龙邻居的话，简直是(1) _____，让大家的热情顿时(2) _____。但镇坪官方似乎(3)了，坚持认为照片是真的，而网络调查显示，认为照片为假的(4) _____。    国家林业局已经介入，真相快要出来了，是不是有人心(5)，会不会有官员在这个问题上(6) _____，人们拭目以待。\n',
    correctAnswer: ['揭出了老底', '凉了半截', '铁了心', '占了上风', '怀鬼胎', '栽跟头'],
    answers: [
      ['蒙在了鼓里', '挤出了牙膏', '卖了关子', '揭出了老底'],
      ['走了下坡路', '凉了半截', '留了一手', '敲了竹杠'],
      ['铁了心', '凉了半截', '留了一手', '倒苦水'],
      ['占了上风', '卖了关子', '揭了谜底', '怀了鬼胎'],
      ['怀鬼胎', '放空炮', '走下坡路', '钻死胡同'],
      ['脸皮薄', '背包袱', '栽跟头', '开空头支票'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426d',
    },
    paragraph:
      '王宁最害怕的事情就是开会了，作为秘书，他要准备各种会议材料，印发通 知，会前会后，他都要做很多工作。这些工作对他这个 (1)_____ 来说，可不是一件 轻松的事情。为了准备会议，他经常加班加点，家里人都说他成 (2) _____ 了。',
    correctAnswer: ['马前卒', '夜猫子'],
    answers: [
      ['地头蛇', '千里马', '马前卒', '马后炮'],
      ['拦路虎', '地头蛇', '纸老虎', '夜猫子'],
    ],
  },
  {
    paragraph:
      '即使如此，他也会因为一些小错误而受到领导的批评。他总是在心里暗暗地骂领导 都是 (1) _____ ，一点也不体恤他的辛苦。心里虽然这样想，可他嘴上还要对领导 连连说好话。在别人的眼里，他就是一个 (2) _____ 。在领导身边工作的人可真不 容易呀!',
    correctAnswer: ['冷血动物', '顺毛驴'],
    answers: [
      ['狗腿子', '冷血动物', '牛皮大王', '狗头军师'],
      ['癞皮狗', '哈巴狗', '马屁精', '顺毛驴'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426e',
    },
    paragraph:
      '2. 真拿李涛这样的(1)_____没有办法，我一个同学借了他钱，按理这事和我没有关系，可他老是缠住我不放，我也不明白为什么自己成了(2) _____。我建议让他去找老师帮忙，他却骂我是(3) _____，出的都是馊主意。',
    correctAnswer: ['癞皮狗', '替罪羊', '狗头军师'],
    answers: [
      ['哈巴狗', '癞皮狗', '落水狗', '书虫儿'],
      ['带头羊', '替罪羊', '笑面虎', '秋老虎'],
      ['丑八怪', '狗头军师', '老狐狸', '白眼狼'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60426f',
    },
    paragraph:
      '1.  大家选李宁做班长，真是 (1) _____ ，李宁为人腼腆，不善于和人 (2) _____ ， 他自己也觉得不合适。但是为什么大家都会选他呢? 所有了解李宁的人，都认为 他正直、勇敢、有责任心，不像原来的班长性格张扬，爱 (3) _____ ，所以李宁被拉上 马也是理所当然的。果然李宁不负众望，给那些平时欺负女同学的男生一 个 (4)_____ 。',
    correctAnswer: ['赶鸭子上架', '打交道', '吹牛皮', '下马威'],
    answers: [
      ['赶鸭子上架', '牛头不对马嘴', '挂羊头卖狗肉', '驴唇不对马嘴'],
      ['打交道', '穿小鞋', '拍马屁', '搭鹊桥'],
      ['吹牛皮', '犯牛脾气', '钻牛角尖', '打死老虎'],
      ['拉下马', '打马虎眼', '下马威', '拍马屁'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604270',
    },
    paragraph:
      '2． 中国有句俗话“要想人不知，除非己莫为”。有些人干了坏事，不是主动承 认错误，而是想方设法进行掩盖。可是事情往往越掩盖越容易 (1)_____ 。因为遮 遮掩掩，人们不得不说更多的谎言。然而说谎也并非是轻而易举的事情，有的时 候就会犯 (2) _____  的错误，搞不好还会 (3) _____。\n',
    correctAnswer: ['露马脚', '驴唇不对马嘴', '狗咬狗'],
    answers: [
      ['露马脚', '吹牛皮', '下马威', '拍马屁'],
      ['露出狐狸尾巴', '驴唇不对马嘴', '赶鸭子上架', '挂羊头卖狗肉'],
      ['狗咬狗', '打死老虎', '打马虎眼', '穿小鞋'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604271',
    },
    paragraph:
      '1. 义务教育阶段是孩子们 (1)_____ 的关键时候，所以我们提倡全面的素质 教育。当然，素质教育并不能为每个孩子的成功 (2) _____ ，只是为孩子未来的发 展奠定比较全面的基础。但是，有些家长只是追求考试分数，不管孩子的兴趣，非 让孩子去上各种各样的补习班，结果，孩子不喜欢学，也使家长的钱都 (3)_____ 了。',
    correctAnswer: ['打底子', '打包票', '打水漂'],
    answers: [
      ['打底子', '打边鼓', '打光棍', '打哈哈'],
      ['打主意', '打包票', '打牙祭', '打头阵'],
      ['打腹稿', '打游击', '打水漂', '打入冷宫'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604272',
    },
    paragraph:
      '2． 现代社会 (1)_____的年轻小伙子越来越多了。这个社会现象已经引起了 社会学家的高度重视。调查发现，越来越多的年轻男子感到压力太大。他们的经 济并不宽裕，不愿意 (2) _____ ，花很多钱讨女孩子的欢心。面对女孩子日益现实 的婚姻条件，他们常常不由自主地 (3) _____ 。',
    correctAnswer: ['打光棍', '打肿脸充胖子', '打退堂鼓'],
    answers: [
      ['打光棍', '打入冷宫', '打哈哈', '打头阵'],
      ['打包票', '打肿脸充胖子', '打时间差', '打如意算盘'],
      ['打游击', '打了个照面', '打退堂鼓', '打第一炮'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604273',
    },
    paragraph:
      '"转眼，玛丽来中国已经一个多月了。她来中国前，她的父母就给她**（1），告诉她学好汉语可不是一件轻而易举的事情。\n可是玛丽知难而进，来到中国以后，她经常和中国人（2），譬如有时到菜市场给卖菜的小贩（3)在帮助别人的过程中，她获得了快乐，\n也丰富了自己的汉语知识。\n"',
    correctAnswer: ['打预防针\n"', '打交道', '打下手'],
    answers: [
      ['打小报告', '打如意算盘', '打破饭碗', '打预防针\n"'],
      ['打圆场', '打官司', '打擂台', '打交道'],
      ['打哑谜', '打板子', '打掩护', '打下手'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604274',
    },
    paragraph:
      '年轻人有（1）的雄心壮志固然让人赞叹，但是更重要的是要有心怀天下的胸襟。有了这样的胸襟，你不会时时局限于个人的得失，为自己（2）。相反，你会为了更多人的利益而去（3），去冲锋陷阵，即使被（4），献出自己的青春和生命也在所不惜。',
    correctAnswer: ['打天下', '打小算盘', '打头阵', '打入十八层地狱'],
    answers: [
      ['打天下', '打前站', '打冷枪', '打官司'],
      ['打小算盘', '打马虎眼', '打小报告', '打破饭碗'],
      ['打头阵', '打掩护', '打下手', '打板子'],
      ['打入十八层地狱', '丈二和尚摸不着头脑', '打预防针', '打如意算盘'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604275',
    },
    paragraph:
      '单位的（1）发发牢骚，提提意见，以为反映到领导那儿就可以得到解决，这种想法未免太天真。在一些（2）看来，这都是（3）的做法，简直是（4），那些年轻人都是（5），只有三分钟热情。心里有气，有不满，说出来，自然就啥也没有了，所以你意见提是提了，领导听是听了，但根本不予以实际的解决，但那些愣头青们偏偏不那么认为。',
    correctAnswer: ['小字辈', '老油条', '老掉牙', '小儿科', '愣头青'],
    answers: [
      ['老油条', '书呆子', '波辣货', '小字辈'],
      ['书虫', '绣花枕头', '实心眼', '老油条'],
      ['热心肠', '窝囊废', '老掉牙', '没头苍蝇'],
      ['实心眼', '小儿科', '窝囊废', '跟风'],
      ['愣头青', '窝囊废', '母老虎', '波辣货'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604276',
    },
    paragraph:
      '从南京玄武湖成为富人的后花园到虎山风景区抢建别墅成风，许多景区修建了大（1）的人工景点。而这些景点的管理者都干了什么呢? 他们为追逐利润，不顾景区承受力而上马这些项目，这不是在（2）吗? 他们对那些违法违规者（3），（4）放行，是一种渎职行为，他们的责任应该追究。',
    correctAnswer: ['煞风景', '刮地皮', '睁一只眼，闭一只眼', '开绿灯'],
    answers: [
      ['破天荒', '地头蛇', '煞风景', '攀高枝'],
      ['刮地皮', '地头蛇', '争上游', '无底洞'],
      ['有一搭没一搭', '挂羊头，卖狗肉', '前怕狼，后怕虎', '睁一只眼，闭一只眼'],
      ['和稀泥', '耳边风', '开绿灯', '神不知，鬼不觉'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604277',
    },
    paragraph:
      '那些不法煤矿矿主之所以敢无视安全问题，把工人的生命（1），拼命地开采赚钱, 就是因为有地方政府给他们做（2）。而在事发之后, 那些官员为了保住自己头上的（3），故意地隐瞒虚报，欺上瞒下, 恶劣之极。',
    correctAnswer: ['当儿戏', '保护伞', '乌纱帽'],
    answers: [
      ['敲门砖', '打理伏', '下马威', '当儿戏'],
      ['安乐窝', '撒手锏', '保护伞', '试金石'],
      ['乌纱帽', '铁饭碗', '鸿门宴', '保护伞'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604278',
    },
    paragraph:
      '我是个比较传统的女人, 一直认为恋爱的目的是结婚, 两个人在一起就是为了 一辈子的相守, 否则, 没必要浪费感情。爱情是婚姻的（1），有了爱情, 发展下去, 开启结婚之门也就顺理成章了。如果一方想结婚, 而另一方总找借口, 找各种（2）来推脱的话, 这样的感情是值得怀疑的。我认为, 婚约是爱情的（3），可以试出爱情的真假, 婚约也是一面（4），能照出许多无法兑现的虚情假意来。',
    correctAnswer: ['敲门砖', '挡箭牌', '试金石', '照妖镜'],
    answers: [
      ['挡箭牌', '敲门砖', '照妖镜', '保护伞'],
      ['敲门砖', '冷处理', '保护伞', '挡箭牌'],
      ['吃错药', '试金石', '当儿戏', '冷处理'],
      ['保护伞', '敲门砖', '挡箭牌', '照妖镜'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604279',
    },
    paragraph:
      '他不喜欢在单位   (1)   的味道，也不能容忍某个领导给他穿小鞋，他放弃了优厚的待遇，辞职不干了。\n他的决定令人大   (2)   ，如果是别人，也许会选择忍让，毕竟，这样的铁饭碗不好找。\n有人说他   (3)   ，只看眼前。有人说他在   (4)   。',
    correctAnswer: ['坐冷板凳', '跌眼镜', '近视眼', '捅娄子'],
    answers: [
      ['捅漏子', '坐冷板凳', '敲边鼓', '钻牛角尖'],
      ['敲边鼓', '钻牛角尖', '钻空子', '跌眼镜'],
      ['磨洋工', '捅娄子', '近视眼', '绕弯子'],
      ['磨洋工', '捅娄子', '近视眼', '绕弯子'],
    ],
  },
  {
    paragraph:
      '在众人面前他表现得毫不留恋，好马不吃回头草，那段时间成了他的   (1)   。\n其实，他多少也为自己的冲动而后悔，但他不希望别人提起，因为那简直是在   (2)   他的   (3)   。\n他也不会表现出后悔，因为那会更   (4)   。',
    correctAnswer: ['口头禅', '揭……伤疤', '丢面子'],
    answers: [
      ['弄玄虚', '踢皮球', '近视眼', '口头禅'],
      ['穿……小鞋', '揭……伤疤', '踢……皮球', '钻空子'],
      ['揭疮疤', '钻牛角尖', '绕弯子', '丢面子'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427a',
    },
    paragraph:
      '曾经有一段时间，农民工工资是社会关注的重点。许多农民工像 (1) 一样，辛苦一年后，只拿到老板   (2)   。\n这些老板真是   (3)   。民工们赚的可是血汗钱。\n他们倒逍遥自在，心安理得地胡吃海喝，其实都是不劳而获，都是在吃农民工的白食。\n后来，温家宝总理亲自出面调查解决这个问题。农民工算是 (4) 了，讨回了自己的工钱。\n否则回家过个快乐年只能是  (5)  。',
    correctAnswer: ['老黄牛', '打的白条', '黑心贼', '交了红运', '黄粱梦'],
    answers: [
      ['老黄牛', '吃白食', '闯红灯', '开绿灯'],
      ['打的白条', '吃了白食', '喝了黄汤', '开的绿灯'],
      ['交白卷', '黑心贼', '开门红', '老黄牛'],
      ['吃了白食', '交了红运', '开了绿灯', '闯了红灯'],
      ['黄粱梦', '翻白眼', '交白卷', '告黑状'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427b',
    },
    paragraph:
      '老张本来筹划着用股市里赚的钱买辆车。但这个计划现在彻底 (1)  了。\n他本以为会赚得盆满钵满，可最近股市暴跌，他投在股市里的钱严重缩水。他老婆气得直骂他是   (2)   。\n\n老张原来看别人在股市里大赚，就   (3)   ，自己也跟进，现在几乎赔了个   (4)   。',
    correctAnswer: ['黄', '败家子', '害了红眼病', '底朝天'],
    answers: [
      ['红', '黄', '紫', '绿'],
      ['闷葫芦', '白眼狼', '败家子', '急先锋'],
      ['头疼', '急先锋', '事后诸葛亮', '害了红眼病'],
      ['底朝天', '露原形', '害红眼病', '不像话'],
    ],
  },
  {
    paragraph:
      '他对股市很不了解，不知道股市里有很多黑幕，也不知道满天飞的   (1)   哪个是真哪个是假。\n\n他的儿女曾建议他别碰股票，可他说，你们黄口小儿、   (2)  懂什么? 仍一意孤行。\n现在知道了股市的可怕，看着指数下跌，也没办法，只能 (3) 。',
    correctAnswer: ['小道消息', '黄毛丫头', '干瞪眼'],
    answers: [
      ['广告', '谣言', '耳边风', '小道消息'],
      ['黄毛丫头', '老黄牛', '事后诸葛亮', '小儿科'],
      ['害红眼病', '干瞪眼', '闷葫芦', '败家子'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427c',
    },
    paragraph:
      '1．2007 年度诺贝尔文学奖 10 月 11 日  (1)  ，结果再度  (2)  ，出生于 1919 年的英国女作家多丽丝·莱辛获得该奖。\n而此前，在广泛的猜测中，呼声最高的并不是她。',
    correctAnswer: ['揭晓', '爆出冷门'],
    answers: [
      ['揭老底', '揭晓', '露马脚', '露馅儿'],
      ['露马脚', '出风头', '吊胃口', '爆出冷门'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427d',
    },
    paragraph:
      '2．明明这个学期没有下工夫学习，考前只好临时  (1)  ，突击了一个通宵。\n还好原来的底子好，成绩还过得去，全班第八，他平均分82 分，语文   (2)   。\n要不然，可能会排到前五名。',
    correctAnswer: ['抱佛脚', '拖了后腿'],
    answers: [
      ['打圆场', '耍赖皮', '出难题', '抱佛脚'],
      ['爆了冷门', '吊了胃口', '揭了老底', '拖了后腿'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427e',
    },
    paragraph:
      '"转眼，玛丽来中国已经一个多月了。她来中国前，她的父母就给她**（1），告诉她学好汉语可不是一件轻而易举的事情。\n可是玛丽知难而进，来到中国以后，她经常和中国人（2），譬如有时到菜市场给卖菜的小贩（3)在帮助别人的过程中，她获得了快乐，\n也丰富了自己的汉语知识。\n"',
    correctAnswer: ['打预防针\n"', '打交道', '打下手'],
    answers: [
      ['"打小报告', '打如意算盘', '打破饭碗', '打预防针\n"'],
      ['打圆场', '打官司', '打搅', '打交道'],
      ['打哑谜', '打板子', '打掩护', '打下手'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f60427f',
    },
    paragraph:
      '1.我们为人处世应该文明礼貌。如果有不順心的事情，不要像 (1) 样,乱发脾气，要是有人开口向你请教或者请你帮忙，你不能动不动就给人家 (2)，要照顾到别人的感受,尽量帮助，去拜访别人最好先预约，一是礼貌，二也可以避免你去了，主人不在，而 (3)。',
    correctAnswer: ['吃了枪药', '碰钉子', '吃了闭门类'],
    answers: [
      ['吃了枪药', '碰钉子', '吃闭门类', '吃了豹子胆'],
      ['吃了枪药', '碰钉子', '吃闭门羹', '吃亏'],
      ['碰钉子', '吃亏', '吃了闭门类', '吃了豹子胆'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604280',
    },
    paragraph:
      '2.张明 (1) 这份文件的意思,就去问老板,没想到老板给张明吃了一个 (2),不但不回答，还批评了他，张明想这样的老板，真让人 (3)。',
    correctAnswer: ['吃不准', '钉子', '吃不消'],
    answers: [
      ['吃不消', '吃不准', '吃不开', '吃不香'],
      ['人闭门羹', '钉子', '官司', '醋'],
      ['吃不透', '吃不消', '吃不开', '吃不了兜着走'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604281',
    },
    paragraph:
      '当初，朋友需要用钱，又一个劲地跟我 (1) ，弄\n得我挺不好意思的，一毛不拔好像也很不够朋友，我也真心想（2）他 (2) ，就借钱给他了。',
    correctAnswer: ['拉近乎', '拉……一把'],
    answers: [
      ['演独角戏', '唱老调', '嚼舌根', '拉近乎'],
      ['拉……一把', '碰……钉子', '拉……交情', '说……怪话'],
      ['说怪话', '拉不下脸', '拉长脸', '拉长线'],
    ],
  },
  {
    paragraph:
      '可一年多了，对方却迟迟不还，我也实在 (1) 问他要。但无奈最近收入减少了，家里 (2) ，只好开了口。但他居然 (3) ，我只好跟他打起了官司。这可真是个 (4) ，整整打了三个月，才讨回了欠款。',
    correctAnswer: ['拉不下脸', '拉了亏空', '不认账', '拉锯战'],
    answers: [
      ['说怪话', '拉不下脸', '拉长脸', '拉长线'],
      ['拉了亏空', '说漏了嘴', '拉下水', '听墙根'],
      ['说鬼话', '拉下马', '不认账', '拉偏架'],
      ['拉闲篇', '拉下脸', '拉帮结伙', '拉锯战'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604282',
    },
    paragraph:
      '加不加息,怎么加,是很 (1) 的。要看国内的经济情\n况,也要看国际的局势。政府高层心里 (2) 一旦看出 (3) 通货膨胀的 (3) ,而且认为 (4) 发挥宏观调控的作用,中央银行就会制订独立的货币政策,果断推出 (5) 的举措。从最近这几次加息来看,无论是时机还\n是幅度的选择,都充分显示出决策层的确 (6)。',
    correctAnswer: ['有讲究', '有一杆秤', '有……苗头', '有把握', '有分量', '有两下子'],
    answers: [
      ['有杆秤', '有苗头', '有眉目', '有讲究'],
      ['有眉目', '有一杆秤', '有来头', '有文章'],
      ['有……眉目', '有……油水', '有……苗头', '有……门道'],
      ['有分寸', '有头有脸', '有把握', '有谱儿'],
      ['有瓜葛', '有气色', '有苗头', '有分量'],
      ['有两下子', '有心人', '有分量', '有奔头'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604283',
    },
    paragraph:
      '2.我很佩服那些实力派演员,觉得他们很了不起。他\n们在表演上很 （1）表演起来 (2) 。演什么像\n什么，而且很能打动人。而要做到这些，光是靠漂亮可不行，必须要有很高的悟性,还要肯下工夫,平时要做个 (3) ,多观察多思考，勤学苦练,这样才会培养出高超的演技。',
    correctAnswer: ['有两下子', '有板有眼', '有心人'],
    answers: [
      ['有苗头', '有鼻子有眼', '有讲究', '有两下子'],
      ['有板有眼', '有头有脸', '有杆秤', '有奔头'],
      ['有眼光', '有两手', '有谱儿', '有心人'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604284',
    },
    paragraph:
      '对方迟迟不签合同，这件事很蹊跷，有点 (1) ,说他\n们的经理不在，应该只是个借口，其中一定另有原\n因，听说我们的竞争对手也在和他们洽谈,现 在经\n济 (2) ,而且这个单子很大，对我们公司而言，意义\n非同小可，丢了可 (3) 。趁现在还有机会，我们一\n定要努力促成合同的签订，不要坐以待毙, 一旦他们\n跟别人签了，我们就 (4) 了。',
    correctAnswer: ['不对头', '不景气', '不是玩儿的', '没戏唱'],
    answers: [
      ['不对头', '不是个儿', '不认账', '没规矩'],
      ['不起眼', '不着边', '不成器', '不景气'],
      ['没分寸', '不是玩儿的', '不到家', '不忘本'],
      ['没底儿', '不买账', '没戏唱', '没分寸'],
    ],
  },
  {
    _id: {
      $oid: '674c918a4d77ae4a7f604285',
    },
    paragraph:
      '2.说话做事要掌握一个合适的度,不能 (1)。批评别\n人不要太严厉了, 要给别人留一点面子,不能让\n人 (2) ,说话要先过过大脑,考虑一下别人的 感受,\n不能 (3)。',
    correctAnswer: ['没分寸', '下不了台', '没遮拦'],
    answers: [
      ['没好气儿', '不着边儿', '没分寸', '没规矩'],
      ['下不了台', '没有架子', '没戏唱', '没好气儿'],
      ['没遮拦', '没星秤', '不买账', '不到家'],
    ],
  },
];

const originalData = [
  {
    paragraph:
      '转眼，玛丽来中国已经一个多月了。她来中国前，她的父母就给她__(1)__，告诉她学好汉语可不是一件轻而易举的事情。\n可是玛丽知难而进，来到中国以后，她经常和中国人__(2)__，譬如有时到菜市场给卖菜的小贩__(3)__在帮助别人的过程中，她获得了快乐，\n也丰富了自己的汉语知识。\n',
    '1)A': ' 打小报告\n\n\n',
    '1)B': '\n  打如意算盘\n\n',
    '1)C': '\n  打破饭碗\n\n',
    '1)D': ' 打预防针\n"',
    '2)A': ' 打圆场',
    '2)B': ' 打官司',
    '2)C': ' 打擂台',
    '2)D': ' 打交道',
    '3)A': ' 打哑谜 ',
    '3)B': ' 打板子',
    '3)C': ' 打掩护',
    '3)D': ' 打下手',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '年轻人有__(1)__的雄心壮志固然让人赞叹，但是更重要的是要有心怀天下的胸襟。有了这样的胸襟，你不会时时局限于个人的得失，为自己__(2)__。相反，你会为了更多人的利益而去__(3)__，去冲锋陷阵，即使被打入十八层地狱，献出自己的青春和生命也在所不惜。',
    '1)A': ' 打天下',
    '1)B': ' 打前站',
    '1)C': ' 打冷枪',
    '1)D': ' 打官司',
    '2)A': ' 打小算盘',
    '2)B': ' 打马虎眼',
    '2)C': ' 打小报告',
    '2)D': ' 打破饭碗',
    '3)A': ' 打头阵',
    '3)B': ' 打掩护',
    '3)C': ' 打下手',
    '3)D': ' 打板子',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '单位的__(1)__发发牢骚，提提意见，以为反映到领导那儿就可以得到解决，这种想法未免太天真。在一些__(2)__看来，这都是__(3)__的做法，简直是小儿科，那些年轻人都是愣头青，只有三分钟热情。心里有气，有不满，说出来，自然就啥也没有了，所以你意见提是提了，领导听是听了，但根本不予以实际的解决，但那些愣头青们偏偏不那么认为。',
    '1)A': ' 老油条',
    '1)B': ' 书呆子',
    '1)C': ' 波辣货',
    '1)D': ' 小字辈',
    '2)A': ' 书虫',
    '2)B': ' 绣花枕头',
    '2)C': ' 实心眼',
    '2)D': ' 老油条',
    '3)A': ' 热心肠',
    '3)B': ' 窝囊废',
    '3)C': ' 老掉牙',
    '3)D': ' 没头苍蝇',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'C',
  },
  {
    paragraph:
      '从南京玄武湖成为富人的后花园到虎山风景区抢建别墅成风，许多景区修建了大__(1)__的人工景点。而这些景点的管理者都干了什么呢? 他们为追逐利润，不顾景区承受力而上马这些项目，这不是在__(2)__吗? 他们对那些违法违规者__(3)__， 开绿灯放行，是一种渎职行为，他们的责任应该追究。',
    '1)A': ' 破天荒',
    '1)B': ' 地头蛇',
    '1)C': ' 煞风景',
    '1)D': ' 攀高枝',
    '2)A': ' 刮地皮',
    '2)B': ' 地头蛇',
    '2)C': ' 争上游',
    '2)D': ' 无底洞',
    '3)A': ' 有一搭没一搭',
    '3)B': ' 挂羊头，卖狗肉',
    '3)C': ' 前怕狼，后怕虎',
    '3)D': ' 睁一只眼，闭一只眼',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '那些不法煤矿矿主之所以敢无视安全问题，把工人的生命__(1)__，拼命地开采赚钱, 就是因为有地方政府给他们做__(2)__。而在事发之后, 那些官员为了保住自己头上的__(1)__，故意地隐瞒虚报，欺上瞒下, 恶劣之极。',
    '1)A': ' 敲门砖',
    '1)B': ' 打理伏',
    '1)C': ' 下马威',
    '1)D': ' 当儿戏',
    '2)A': ' 安乐窝',
    '2)B': ' 撒手锏',
    '2)C': ' 保护伞',
    '2)D': ' 试金石',
    '3)A': ' 乌纱帽',
    '3)B': ' 铁饭碗',
    '3)C': ' 鸿门宴',
    '3)D': ' 保护伞',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'C',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '我是个比较传统的女人, 一直认为恋爱的目的是结婚, 两个人在一起就是为了 一辈子的相守, 否则, 没必要浪费感情。爱情是婚姻的__(1)__，有了爱情, 发展下去, 开启结婚之门也就顺理成章了。如果一方想结婚, 而另一方总找借口, 找各种__(1)__来推脱的话, 这样的感情是值得怀疑的。我认为, 婚约是爱情的__(1)__，可以试出爱情的真假, 婚约也是一面照妖镜，能照出许多无法兑现的虚情假意来。',
    '1)A': ' 挡箭牌',
    '1)B': ' 敲门砖',
    '1)C': ' 照妖镜',
    '1)D': ' 保护伞',
    '2)A': ' 敲门砖',
    '2)B': ' 冷处理',
    '2)C': ' 保护伞',
    '2)D': ' 挡箭牌',
    '3)A': ' 吃错药',
    '3)B': ' 试金石',
    '3)C': ' 当儿戏',
    '3)D': ' 冷处理',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'B',
  },
  {
    paragraph:
      '华南虎事件，近来闹得沸沸扬扬，周正龙，一个本应是 ____(1)____ 的农民，猎人，突然说拍到了野生华南虎，而镇坪县官方，也不管这个结论是否 ____(2)____，正式对外公布了这一发现。\n据最官方的表述，野生华南虎在几十年前就已经灭绝了，如果镇坪真的发现了野生华南虎，那将是一个重大的科学发现。但是，随着媒体的介入，一些疑问产生了。照片怎么跟年画上的如此相像？照片到底是真是假?镇坪官方是否____(3)____?能否摊出底牌，让大家相信?\n',
    '1)A': '翘尾巴',
    '1)B': '守本分',
    '1)C': '吐苦水',
    '1)D': '卖关子',
    '2)A': '卖了关子',
    '2)B': '守本分',
    '2)C': '敲竹杠',
    '2)D': '站得住脚',
    '3)A': '伤脑筋',
    '3)B': '开空头支票',
    '3)C': '蒙在鼓里',
    '3)D': '说了过头话',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '而通过对几个当事人的采访发现，他们都有明显的前后矛盾，特别是周正龙邻居的话，简直是____(1)____，让大家的热情顿时凉了半截。但镇坪官方似乎____(2)____了，坚持认为照片是真的，而网络调查显示，认为照片为假的占了上风。国家林业局已经介入，真相快要出来了，是不是有人心怀鬼胎_，会不会有官员在这个问题上____(3)____，人们拭目以待。\n',
    '1)A': '蒙在了鼓里',
    '1)B': '挤出了牙膏',
    '1)C': '卖了关子',
    '1)D': '揭出了老底',
    '2)A': '铁了心',
    '2)B': '凉了半截',
    '2)C': '留了一手',
    '2)D': '倒苦水',
    '3)A': '脸皮薄',
    '3)B': '背包袱',
    '3)C': '栽跟头',
    '3)D': '开空头支票',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'C',
  },
  {
    paragraph:
      '王宁最害怕的事情就是开会了，作为秘书，他要准备各种会议材料，印发通 知，会前会后，他都要做很多工作。这些工作对他这个 ____(1)____来说，可不是一件 轻松的事情。为了准备会议，他经常加班加点，家里人都说他成____(2)____了。\n\n即使如此，他也会因为一些小错误而受到领导的批评。他总是在心里暗暗地骂领导 都是____(3)____，一点也不体恤他的辛苦。心里虽然这样想，可他嘴上还要对领导 连连说好话。在别人的眼里，他就是一个顺毛驴。在领导身边工作的人可真不 容易呀!\n\n',
    '1)A': '地头蛇',
    '1)B': '千里马',
    '1)C': '马前卒',
    '1)D': '马后炮',
    '2)A': '拦路虎',
    '2)B': '地头蛇',
    '2)C': '纸老虎',
    '2)D': '夜猫子',
    '3)A': '狗腿子',
    '3)B': '冷血动物',
    '3)C': '牛皮大王',
    '3)D': '狗头军师',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'B',
  },
  {
    paragraph:
      '真拿李涛这样的____(1)____没有办法，我一个同学借了他钱，按理这事和我没有关系，可他老是缠住我不放，我也不明白为什么自己成了____(2)____。我建议让他去找老师帮忙，他却骂我是____(3)____，出的都是馊主意。',
    '1)A': '哈巴狗',
    '1)B': '癞皮狗',
    '1)C': '落水狗',
    '1)D': '书虫儿',
    '2)A': '带头羊',
    '2)B': '替罪羊',
    '2)C': '笑面虎',
    '2)D': '秋老虎',
    '3)A': '丑八怪',
    '3)B': '狗头军师',
    '3)C': '老狐狸',
    '3)D': '白眼狼',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'B',
  },
  {
    paragraph:
      '大家选李宁做班长，真是____(1)____，李宁为人腼腆，不善于和人____(2)____， 他自己也觉得不合适。但是为什么大家都会选他呢? 所有了解李宁的人，都认为 他正直、勇敢、有责任心，不像原来的班长性格张扬，爱____(3)____，所以李宁被拉上 马也是理所当然的。果然李宁不负众望，给那些平时欺负女同学的男生一 个 下马威 。',
    '1)A': '赶鸭子上架',
    '1)B': '牛头不对马嘴',
    '1)C': '挂羊头卖狗肉',
    '1)D': '驴唇不对马嘴',
    '2)A': '打交道',
    '2)B': '穿小鞋',
    '2)C': '拍马屁',
    '2)D': '搭鹊桥',
    '3)A': '吹牛皮',
    '3)B': '犯牛脾气',
    '3)C': '钻牛角尖',
    '3)D': '打死老虎',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '中国有句俗话“要想人不知，除非己莫为”。有些人干了坏事，不是主动承 认错误，而是想方设法进行掩盖。可是事情往往越掩盖越容易____(1)____。因为遮 遮掩掩，人们不得不说更多的谎言。然而说谎也并非是轻而易举的事情，有的时 候就会犯____(2)____的错误，搞不好还会____(3)____。\n',
    '1)A': '露马脚',
    '1)B': '吹牛皮',
    '1)C': '下马威',
    '1)D': '拍马屁',
    '2)A': '露出狐狸尾巴',
    '2)B': '驴唇不对马嘴',
    '2)C': '赶鸭子上架',
    '2)D': '挂羊头卖狗肉',
    '3)A': '狗咬狗',
    '3)B': '打死老虎',
    '3)C': '打马虎眼',
    '3)D': '穿小鞋',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '义务教育阶段是孩子们____(1)____的关键时候，所以我们提倡全面的素质 教育。当然，素质教育并不能为每个孩子的成功____(2)____，只是为孩子未来的发 展奠定比较全面的基础。但是，有些家长只是追求考试分数，不管孩子的兴趣，非 让孩子去上各种各样的补习班，结果，孩子不喜欢学，也使家长的钱都____(3)____了。',
    '1)A': '打底子',
    '1)B': '打边鼓',
    '1)C': '打光棍',
    '1)D': '打哈哈',
    '2)A': '打主意',
    '2)B': '打包票',
    '2)C': '打牙祭',
    '2)D': '打头阵',
    '3)A': '打腹稿',
    '3)B': '打游击',
    '3)C': '打水漂',
    '3)D': '打入冷宫',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'C',
  },
  {
    paragraph:
      '现代社会____(1)____的年轻小伙子越来越多了。这个社会现象已经引起了 社会学家的高度重视。调查发现，越来越多的年轻男子感到压力太大。他们的经 济并不宽裕，不愿意 ____(2)____，花很多钱讨女孩子的欢心。面对女孩子日益现实 的婚姻条件，他们常常不由自主地 ____(3)____。',
    '1)A': '打光棍',
    '1)B': '打入冷宫',
    '1)C': '打哈哈',
    '1)D': '打头阵',
    '2)A': '打包票',
    '2)B': '打肿脸充胖子',
    '2)C': '打时间差',
    '2)D': '打如意算盘',
    '3)A': '打游击',
    '3)B': '打了个照面',
    '3)C': '打退堂鼓',
    '3)D': '打第一炮',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'C',
  },
  {
    paragraph:
      '他不喜欢在单位__(1)__，的味道，也不能容忍某个领导给他穿小鞋，他放弃了优厚的待遇，辞职不干了。\n他的决定令人大跌眼镜，如果是别人，也许会选择忍让，毕竟，这样的铁饭碗不好找。\n有人说他__(2)__，，只看眼前。有人说他在捅娄子。\n在众人面前他表现得毫不留恋，好马不吃回头草，那段时间成了他的口头禅。\n其实，他多少也为自己的冲动而后悔，但他不希望别人提起，因为那简直是在揭他的伤疤。\n他也不会表现出后悔，因为那会更丢面子。',
    '1)A': '捅漏子',
    '1)B': '坐冷板凳',
    '1)C': '敲边鼓',
    '1)D': '钻牛角尖',
    '2)A': '磨洋工',
    '2)B': '捅娄子',
    '2)C': '近视眼',
    '2)D': '绕弯子',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'C',
  },
  {
    paragraph:
      '他不喜欢在单位坐冷板凳 的味道，也不能容忍某个领导给他穿小鞋，他放弃了优厚的待遇，辞职不干了。\n他的决定令人大__(1)__，，如果是别人，也许会选择忍让，毕竟，这样的铁饭碗不好找。\n有人说他近视眼 ，只看眼前。有人说他在__(2)__，。\n在众人面前他表现得毫不留恋，好马不吃回头草，那段时间成了他的口头禅。\n其实，他多少也为自己的冲动而后悔，但他不希望别人提起，因为那简直是在揭他的伤疤。\n他也不会表现出后悔，因为那会更丢面子。',
    '1)A': '敲边鼓',
    '1)B': '钻牛角尖',
    '1)C': '钻空子',
    '1)D': '跌眼镜',
    '2)A': '磨洋工',
    '2)B': '捅娄子',
    '2)C': '近视眼',
    '2)D': '绕弯子',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'B',
  },
  {
    paragraph:
      '他不喜欢在单位坐冷板凳 的味道，也不能容忍某个领导给他穿小鞋，他放弃了优厚的待遇，辞职不干了。\n他的决定令人大跌眼镜，如果是别人，也许会选择忍让，毕竟，这样的铁饭碗不好找。\n有人说他近视眼 ，只看眼前。有人说他在捅娄子。\n在众人面前他表现得毫不留恋，好马不吃回头草，那段时间成了他的__(1)__，。\n其实，他多少也为自己的冲动而后悔，但他不希望别人提起，因为那简直是在__(2)__，他的__(2)__，。\n他也不会表现出后悔，因为那会更__(3)__，。',
    '1)A': '弄玄虚',
    '1)B': '踢皮球',
    '1)C': '近视眼',
    '1)D': '口头禅',
    '2)A': '穿……小鞋',
    '2)B': '揭……伤疤',
    '2)C': '踢……皮球',
    '2)D': '钻空子',
    '3)A': '揭疮疤',
    '3)B': '钻牛角尖',
    '3)C': '绕弯子',
    '3)D': '丢面子',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '曾经有一段时间，农民工工资是社会关注的重点。许多农民工像__(1)__，一样，辛苦一年后，只拿到老板__(2)__，。\n这些老板真是黑心贼。民工们赚的可是血汗钱。\n他们倒逍遥自在，心安理得地胡吃海喝，其实都是不劳而获，都是在吃农民工的白食。\n后来，温家宝总理亲自出面调查解决这个问题。农民工算是交了红运了，讨回了自己的工钱。\n否则回家过个快乐年只能是黄粱梦。',
    '1)A': '老黄牛',
    '1)B': '吃白食',
    '1)C': '闯红灯',
    '1)D': '开绿灯',
    '2)A': '打的白条',
    '2)B': '吃了白食',
    '2)C': '喝了黄汤',
    '2)D': '开的绿灯',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'A',
  },
  {
    paragraph:
      '曾经有一段时间，农民工工资是社会关注的重点。许多农民工像老黄牛一样，辛苦一年后，只拿到老板 打的白条。\n这些老板真是__(1)__，。民工们赚的可是血汗钱。\n他们倒逍遥自在，心安理得地胡吃海喝，其实都是不劳而获，都是在吃农民工的白食。\n后来，温家宝总理亲自出面调查解决这个问题。农民工算是__(2)__，了，讨回了自己的工钱。\n否则回家过个快乐年只能是___(3)__，。',
    '1)A': '交白卷',
    '1)B': '黑心贼',
    '1)C': '开门红',
    '1)D': '老黄牛',
    '2)A': '吃了白食',
    '2)B': '交了红运',
    '2)C': '开了绿灯',
    '2)D': '闯了红灯',
    '3)A': '黄粱梦',
    '3)B': '翻白眼',
    '3)C': '交白卷',
    '3)D': '告黑状',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '老张本来筹划着用股市里赚的钱买辆车。但这个计划现在彻底__(1)__了。\n他本以为会赚得盆满钵满，可最近股市暴跌，他投在股市里的钱严重缩水。他老婆气得直骂他是败家子。\n\n老张原来看别人在股市里大赚，就害了红眼病，自己也跟进，现在几乎赔了个底朝天。\n他对股市很不了解，不知道股市里有很多黑幕，也不知道满天飞的小道消息哪个是真哪个是假。\n\n他的儿女曾建议他别碰股票，可他说，你们黄口小儿、黄毛丫头懂什么? 仍一意孤行。\n现在知道了股市的可怕，看着指数下跌，也没办法，只能__(2)__。',
    '1)A': '红',
    '1)B': '黄',
    '1)C': '紫',
    '1)D': '绿',
    '2)A': '害红眼病',
    '2)B': '干瞪眼',
    '2)C': '闷葫芦',
    '2)D': '败家子',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'B',
  },
  {
    paragraph:
      '老张本来筹划着用股市里赚的钱买辆车。但这个计划现在彻底黄了。\n他本以为会赚得盆满钵满，可最近股市暴跌，他投在股市里的钱严重缩水。他老婆气得直骂他是__(1)__。\n\n老张原来看别人在股市里大赚，就害了红眼病，自己也跟进，现在几乎赔了个底朝天。\n他对股市很不了解，不知道股市里有很多黑幕，也不知道满天飞的小道消息哪个是真哪个是假。\n\n他的儿女曾建议他别碰股票，可他说，你们黄口小儿、__(2)__懂什么? 仍一意孤行。\n现在知道了股市的可怕，看着指数下跌，也没办法，只能干瞪眼。',
    '1)A': '闷葫芦',
    '1)B': '白眼狼',
    '1)C': '败家子',
    '1)D': '急先锋',
    '2)A': '黄毛丫头',
    '2)B': '老黄牛',
    '2)C': '事后诸葛亮',
    '2)D': '小儿科',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'A',
  },
  {
    paragraph:
      '老张本来筹划着用股市里赚的钱买辆车。但这个计划现在彻底黄了。\n他本以为会赚得盆满钵满，可最近股市暴跌，他投在股市里的钱严重缩水。他老婆气得直骂他是败家子。\n\n老张原来看别人在股市里大赚，就__(1)__，自己也跟进，现在几乎赔了个__(2)__。\n他对股市很不了解，不知道股市里有很多黑幕，也不知道满天飞的__(3)__哪个是真哪个是假。\n\n他的儿女曾建议他别碰股票，可他说，你们黄口小儿、黄毛丫头懂什么? 仍一意孤行。现在知道了股市的可怕，看着指数下跌，也没办法，只能干瞪眼。',
    '1)A': '头疼',
    '1)B': '急先锋',
    '1)C': '事后诸葛亮',
    '1)D': '害了红眼病',
    '2)A': '底朝天',
    '2)B': '露原形',
    '2)C': '害红眼病',
    '2)D': '不像话',
    '3)A': '广告',
    '3)B': '谣言',
    '3)C': '耳边风',
    '3)D': '小道消息',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '1．2007 年度诺贝尔文学奖 10 月 11 日__(1)__，结果再度__(2)__，出生于 1919 年的英国女作家多丽丝·莱辛获得该奖。\n而此前，在广泛的猜测中，呼声最高的并不是她。',
    '1)A': '揭老底',
    '1)B': '揭晓',
    '1)C': '露马脚',
    '1)D': '露馅儿',
    '2)A': '露马脚',
    '2)B': '出风头',
    '2)C': '吊胃口',
    '2)D': '爆出冷门',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'D',
  },
  {
    paragraph:
      '2．明明这个学期没有下工夫学习，考前只好临时__(1)__，突击了一个通宵。\n还好原来的底子好，成绩还过得去，全班第八，他平均分82 分，语文__(2)__。\n要不然，可能会排到前五名。',
    '1)A': '打圆场',
    '1)B': '耍赖皮',
    '1)C': '出难题',
    '1)D': '抱佛脚',
    '2)A': '爆了冷门',
    '2)B': '吊了胃口',
    '2)C': '揭了老底',
    '2)D': '拖了后腿',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'D',
  },
  {
    paragraph:
      '女人有了工作，就有了独立的经济来源，家庭地位一下子上去了。因为不再 因为经济问题而被男人___（1）___ ，女人也改\n变了长舌妇的形象，也不需要练就一副 刀子嘴，靠___（2）___赢得生存空间。男人也不敢不问青红皂白地对\n女人___（3）___ 了。倒是女人，不仅掌管着自己的经济，也控制了男人的收入，家里家外，大事小事, 眉毛胡子一把抓，\n好不惬意。这个时候，男人只能在一旁干瞪眼，他也得看看女人的脸色了。',
    '1)A': '牵着鼻子走',
    '1)B': '丢面子',
    '1)C': '翻白眼',
    '1)D': '红眼病',
    '2)A': '翻白眼',
    '2)B': '千里眼',
    '2)C': '耍嘴皮子',
    '2)D': '红眼病',
    '3)A': '吹胡子瞪眼',
    '3)B': '不分青红皂白',
    '3)C': '抹一鼻子灰',
    '3)D': '翻白眼',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'C',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '北京奥运快到了，福娃成了奥运商品的___（1）___。贪心的不法商人打起了奥运商标的主意。他们在商标上\n___（2）___。有的是模仿，混淆视听，欺骗别人，有的直接造假，简直是___(3)___奥运的___(3)___，\n该严厉打击，到了给他们一个下马威的时候了。',
    '1)A': '狗腿子',
    '1)B': '拿手戏',
    '1)C': '抢手货',
    '1)D': '心头肉',
    '2)A': '死心眼',
    '2)B': '肉中刺',
    '2)C': '迷魂阵',
    '2)D': '做手脚',
    '3)A': '做……手脚',
    '3)B': '耍……手腕',
    '3)C': '拍……马屁',
    '3)D': '拖……后腿',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '当时剑拔弩张，眼看就要吵起来了，在这个___（1）___上，出现了一个___（2）___，三言两语，\n就把他们劝和了，避免了一场争吵。',
    '1)A': '死心眼',
    '1)B': '冷心肠',
    '1)C': '倒胃口',
    '1)D': '节骨眼',
    '2)A': '定心丸',
    '2)B': '和事佬',
    '2)C': '负心郎',
    '2)D': '死心眼',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'B',
  },
  {
    paragraph:
      '她跟他___（1）___，整天去跟他那些不三不四的朋友瞎混，什么事都让她___（2）___。最近不知怎么啦，\n她来了个___（3）___的转弯，原来的朋友她一个也不见，天天待在家里看起书来。',
    '1)A': '一锅粥',
    '1)B': '一路货',
    '1)C': '一窝蜂',
    '1)D': '一阵风',
    '2)A': '变成四不像',
    '2)B': '弄成一条龙',
    '2)C': '伸出三只手',
    '2)D': '搅成一锅粥',
    '3)A': '十一路',
    '3)B': '一百八十度',
    '3)C': '一边倒',
    '3)D': '一团乱麻',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'B',
  },
  {
    paragraph: '谁不知道他那两把刷子，___（1）___ 一个，什么事只要他一 ___（2）___，准是一团糟。',
    '1)A': '半吊子',
    '1)B': '一边倒',
    '1)C': '一言堂',
    '1)D': '二百五',
    '2)A': '搅和',
    '2)B': '参加',
    '2)C': '参与',
    '2)D': '一把手',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'A',
  },
  {
    paragraph: '一些饭店___（1）___，欺骗顾客，我们应该提高警惕，既不要和他们___（2）___，也不要上当受骗。',
    '1)A': '耍手腕',
    '1)B': '耍赖皮',
    '1)C': '耍花招',
    '1)D': '耍滑头',
    '2)A': '闹摩擦',
    '2)B': '闹乱子',
    '2)C': '耍贫嘴',
    '2)D': '耍心眼儿',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'A',
  },
  {
    paragraph: '一些不法分子在商场___（1）___，闹乱子，当场被警察___（2）___。',
    '1)A': '耍把戏',
    '1)B': '耍花招',
    '1)C': '耍手腕',
    '1)D': '耍流氓',
    '2)A': '看到',
    '2)B': '批评',
    '2)C': '逮捕',
    '2)D': '抓获',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'D',
  },
  {
    paragraph:
      '我们为人处世应该文明礼貌。如果有不順心的事情，不要像 __(1)__ 样,乱发脾气，要是有人开口向你请教或者请你帮忙，你不能动不动就给人家 __(2)__，要照顾到别人的感受,尽量帮助，去拜访别人最好先预约，一是礼貌，二也可以避免你去了，主人不在，而 __(3)__。',
    '1)A': '吃了枪药',
    '1)B': '碰钉子',
    '1)C': '吃闭门类',
    '1)D': '吃了豹子胆',
    '2)A': '吃了枪药',
    '2)B': '碰钉子',
    '2)C': '吃闭门羹',
    '2)D': '吃亏',
    '3)A': '碰钉子',
    '3)B': '吃亏',
    '3)C': '吃了闭门类',
    '3)D': '吃了豹子胆',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'C',
  },
  {
    paragraph:
      '张明 __(1)__ 这份文件的意思,就去问老板,没想到老板给张明吃了一个__(2)__,不但不回答，还批评了他，张明想这样的老板，真让人__(3)__。',
    '1)A': '吃不消',
    '1)B': '吃不准',
    '1)C': '吃不开',
    '1)D': '吃不香',
    '2)A': '人闭门羹',
    '2)B': '钉子',
    '2)C': '官司',
    '2)D': '醋',
    '3)A': '吃不透',
    '3)B': '吃不消',
    '3)C': '吃不开',
    '3)D': '吃不了兜着走',
    'Đáp án 1)': 'B',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'B',
  },
  {
    paragraph:
      '当初，朋友需要用钱，又一个劲地跟我__(1)__，弄得我挺不好意思的，一毛不拔好像也很不够朋友，我也真心想拉他一把，就借钱给他了。可一年多了，对方却迟迟不还，我也实在__(2)__问他要。但无奈最近收入减少了，家里__(3)__，只好开了口。',
    '1)A': '演独角戏',
    '1)B': '唱老调',
    '1)C': '嚼舌根',
    '1)D': '拉近乎',
    '2)A': '说怪话',
    '2)B': '拉不下脸',
    '2)C': '拉长脸',
    '2)D': '拉长线',
    '3)A': '拉了亏空',
    '3)B': '说漏了嘴',
    '3)C': '拉下水',
    '3)D': '听墙根',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'B',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '加不加息,怎么加,是很有讲究的。要看国内的经济情况,也要看国际的局势。政府高层心里__(1)__一旦看出有通货膨胀的苗头,而且认为__(2)__发挥宏观调控的作用,中央银行就会制订独立的货币政策,果断推出有分量的举措。从最近这几次加息来看,无论是时机还 是幅度的选择,都充分显示出决策层的确__(3)__。',
    '1)A': '有眉目',
    '1)B': '有一杆秤',
    '1)C': '有来头',
    '1)D': '有文章',
    '2)A': '有分寸',
    '2)B': '有头有脸',
    '2)C': '有把握',
    '2)D': '有谱儿',
    '3)A': '有两下子',
    '3)B': '有心人',
    '3)C': '有分量',
    '3)D': '有奔头',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'C',
    'Đáp án 3)': 'A',
  },
  {
    paragraph:
      '我很佩服那些实力派演员,觉得他们很了不起。他们在表演上很__(1)__表演起来__(2)__。演什么像什么，而且很能打动人。而要做到这些，光是靠漂亮可不行，必须要有很高的悟性,还要肯下工夫,平时要做个__(3)__,多观察多思考，勤学苦练,这样才会培养出高超的演技。',
    '1)A': '有苗头',
    '1)B': '有鼻子有眼',
    '1)C': '有讲究',
    '1)D': '有两下子',
    '2)A': '有板有眼',
    '2)B': '有头有脸',
    '2)C': '有杆秤',
    '2)D': '有奔头',
    '3)A': '有眼光',
    '3)B': '有两手',
    '3)C': '有谱儿',
    '3)D': '有心人',
    'Đáp án 1)': 'D',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'D',
  },
  {
    paragraph:
      '对方迟迟不签合同，这件事很蹊跷，有点__(1)__,说他们的经理不在，应该只是个借口，其中一定另有原因，听说我们的竞争对手也在和他们洽谈,现 在经济__(2)__,而且这个单子很大，对我们公司而言，意义非同小可，丢了可__(3)__。趁现在还有机会，我们一定要努力促成合同的签订，不要坐以待毙, 一旦他们跟别人签了，我们就没戏唱了。',
    '1)A': 'A.不对头',
    '1)B': 'B.不是个儿',
    '1)C': 'C.不认账',
    '1)D': 'D.没规矩',
    '2)A': 'A.不起眼',
    '2)B': 'B.不着边',
    '2)C': 'C.不成器',
    '2)D': 'D.不景气',
    '3)A': 'A.没分寸',
    '3)B': 'B.不是玩儿的',
    '3)C': 'C.不到家',
    '3)D': 'D.不忘本',
    'Đáp án 1)': 'A',
    'Đáp án 2)': 'D',
    'Đáp án 3)': 'B',
  },
  {
    paragraph:
      '说话做事要掌握一个合适的度,不能__(1)__。批评别人不要太严厉了, 要给别人留一点面子,不能让人__(2)__,说话要先过过大脑,考虑一下别人的 感受,不能__(3)__。',
    '1)A': 'A.没好气儿',
    '1)B': 'B.不着边儿',
    '1)C': 'C.没分寸',
    '1)D': 'D.没规矩',
    '2)A': 'A.下不了台',
    '2)B': 'B.没有架子',
    '2)C': 'C.没戏唱',
    '2)D': 'D.没好气儿',
    '3)A': 'A.没遮拦',
    '3)B': 'B.没星秤',
    '3)C': 'C.不买账',
    '3)D': 'D.不到家',
    'Đáp án 1)': 'C',
    'Đáp án 2)': 'A',
    'Đáp án 3)': 'A',
  },
];

const transformedData = originalData.map((item) => {
  const answers = [
    [item['1)A']?.trim(), item['1)B']?.trim(), item['1)C']?.trim(), item['1)D']?.trim()].filter((r) => r),
    [item['2)A']?.trim(), item['2)B']?.trim(), item['2)C']?.trim(), item['2)D']?.trim()].filter((r) => r),
    [item['3)A']?.trim(), item['3)B']?.trim(), item['3)C']?.trim(), item['3)D']?.trim()].filter((r) => r),
  ].filter((r) => r.length > 0);
  const indexes = {
    A: 0,
    B: 1,
    C: 2,
    D: 3,
  };
  return {
    paragraph: item.paragraph,
    correctAnswer: [
      answers[0][indexes[item['Đáp án 1)']]],
      answers[1][indexes[item['Đáp án 2)']]],
      answers?.[2]?.[indexes[item['Đáp án 3)']]],
    ],
    answers: answers
      .map((r) =>
        r.map((a) =>
          a?.replaceAll('A.', '').replaceAll('B.', '').replaceAll('C.', '').replaceAll('D.', '')?.trim()
        )
      )
      .filter((r) => r.length > 0),
  };
});

const newdata = transformedData.map((item) => {
  const { _id, paragraph, correctAnswer, answers } = item;
  const newparagraph = paragraph
    // .replaceAll('.', '')
    // .replaceAll('）', ')')
    // .replaceAll('（', '(')
    // .replaceAll('_ ', '')
    // .replaceAll('_', '')
    // .replaceAll('   ', '')
    // .replace('(1)', ' (1)______ ')
    // .replace('(2)', ' (2)______ ')
    // .replace('(3)', ' (3)______ ')
    // .replace('(4)', ' (4)______ ')
    // .replace('(5)', ' (5)______ ')
    // .replace('(6)', ' (6)______ ')
    // .replace('(7)', ' (7)______ ')
    // .replace('(8)', ' (8)______ ')
    // .replace('(9)', ' (9)______ ')
    // .replace('(10)', ' (10)______ ')
    .replaceAll('_  ', '')
    .replaceAll('  (', ' (')
    .replaceAll('\n', '')
    .replaceAll('_ 。', '_。')
    .replaceAll('\\', '');
  return {
    paragraph: newparagraph,
    correctAnswer: correctAnswer
      .filter((r) => r?.length)
      .map((r) => r.replaceAll('\n', '').replaceAll('\\', '')),
    answers: answers
      .filter((r) => r?.length > 0)
      .map((r) => r.filter((r) => r).map((a) => a.replaceAll('\n', '').replaceAll('\n"', ''))),
  };
});
const fs = require('fs');
fs.writeFileSync('data-para.json', JSON.stringify(newdata));
